{
  "rss": {
    "-xmlns:yandex": "http://news.yandex.ru",
    "-xmlns:media": "http://search.yahoo.com/mrss/",
    "-xmlns:turbo": "http://turbo.yandex.ru",
    "-version": "2.0",
    "channel": {
      "title": "SpaceWeb — Бортовой Журнал",
      "link": "https://sweb.ru",
      "description": "Бортовой журнал: статьи о сайтах, маркетинге, продажах и IT",
      "language": "ru",
      "item": [
        {
          "-turbo": "true",
          "title": "Почтовый сервер на VPS: топ лучших программ",
          "link": "https://sweb.ru/journal/article/pochtovyy-server-na-vps:-top-luchshih-programm/",
          "turbo:topic": "Почтовый сервер на VPS: топ лучших программ",
          "turbo:source": "https://sweb.ru/journal/article/pochtovyy-server-na-vps:-top-luchshih-programm/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Почтовый сервер на VPS: топ лучших программ</h1><figure><img src=\"https://s.sweb.ru/img/news/001ca5d05b3f183425ac15d376843b09.png\"></figure><h2></h2></header><p>Наличие собственного почтового сервера характеризуется возможностью получить гибкую многокомпонентную систему, которая будет решать задачи обмена информацией внутри компании, поддерживать связь с клиентами и партнерами, поддерживать безопасность личных и коммерческих данных.</p> <p>Для поддержки работы и настройки почтового сервера потребуется дополнительный софт. Он предназначается для обеспечения безопасности почты, очистки от спама и выполнения других служебных задач. Ниже рассматриваются самые популярные программы.</p> <h2>Dovecot</h2> <p><img style=\"max-width: 150px;\" src=\"https://s.sweb.ru/img/news/4ca0af71f21c8573ba1c5d6b9b8d764e.png\" alt=\"Почтовый сервер Dovecot\"></p> <p>Данная программа разрабатывалась под Unix-подобные операционные системы c целью обработки входящей почты. Работает в качестве IMAP- и POP3-сервера и обеспечивает безопасный доступ к почте. Поддерживает обширный список способов аутентификации, шифрует информацию для защиты, предоставляет возможность настройки прав.</p> <h2>Postfix</h2> <p><img style=\"max-width: 150px;\" src=\"https://s.sweb.ru/img/news/f8b5fabc2bf0e51cce6be9b9fdd05c48.gif\" alt=\"Почтовый сервер Postfix\"></p> <p>Разрабатывался в качестве альтернативы Sendmail с целью повышения производительности без ущерба надежности и безопасности. Отличается простотой и легкостью, обладает множеством возможностей.</p> <p>Конфигурирующие файлы имеют подробные комментарии, что значительно облегчает настройку. Чтобы запустить базовую конфигурацию почтового сервера с учетом собственных предпочтений, требуется изменить несколько параметров.</p> <p>При работе приложение запускает несколько процессов, работающих от имени непривилегированных пользователей.</p> <p>Позволяет использовать внешние программы, запускающихся с процессом sendmail, поскольку имеет собственный пакет этой программы.</p> <h2>Exim</h2> <p><img style=\"max-width: 150px;\" src=\"https://s.sweb.ru/img/news/58474ad9a9919cc4ce0e6dc9cd3a513e.png\" alt=\"Почтовый сервер Exim\"></p> <p>Данная программа служит почтовым агентом для отправления писем с сервера. Разработана в Кембриджском университете для использования в системах Unix, подключенных к Интернету и распространяется на условиях лицензии GNU.</p> <p>Файл регистрации событий размещается /var/log/exim/main.log, там можно посмотреть отправку письма или проверить причину сбоя в работе. Сами файлы писем помещаются в папку /var/spool/exim/input. Дополнительные сведения о письмах размещены в папках db и msglog.</p> <h2>OpenDKIM</h2> <p>Замечательное приложение, которое позаботится о получении только важной информации. Оно объединило несколько существующих способов определения фишинга и спама. Это позволило значительно повысить качество определения легитимных поступлений по электронной почте. Приложение отказалось от традиционной идентификации отправителя по IP-адресу, в пользу добавления к сообщению цифровой подписи, связанной с наименованием домена организации. Получатель сверяет подпись автоматически, репутация определяется с помощью черных и белых списков.</p> <h2>OpenDMARC</h2> <p>Прекрасное приложение для борьбы со спамом. Оно обнаруживает навязчивую рекламу и сообщает о ней получателю, с рекомендациями о действиях, которые следует предпринять. Также оно собирает статистические данные и создает оперативный отчет об источниках получаемых сообщений. Таким образом DMARC обеспечивает реализацию политики домена-отправителя и отправляет аналитические отчеты в качестве поддержки борьбы со спамом.</p> <h2>Postfixadmin</h2> <p><img style=\"max-width: 150px;\" src=\"https://s.sweb.ru/img/news/dc4d21fcdd992cbea601fb23d1667ce6.png\" alt=\"Почтовый сервер Postfixadmin\"></p> <p>Приложение, созданное для облегчения процесса администрирования. С его помощью можно быстро и просто:</p> <ul> <li>добавлять и удалять домены, почтовые ящики, алиасы;</li> <li>изменять пароли;</li> <li>назначать администраторов.</li> </ul> <p>Вновь назначенным администраторам предоставляются права добавления и удаления почтовых ящиков, изменения паролей.</p> <h2>Roundcube</h2> <p><img style=\"max-width: 150px;\" src=\"https://s.sweb.ru/img/news/bb1b7709bbb53970f01248f08350efa4.png\" alt=\"Почтовый сервер Roundcube\"></p> <p>Приложение относится к почтовым клиентам и обладает интуитивно понятным интерфейсом. Для работы с ним требуется только браузер. RoundCube оснащен всеми функциями, которые нужны для почтового клиента:</p> <ul> <li>возможность создания почтовых сообщений</li> <li>адресная книга</li> <li>поддержка электронных писем в форматах IME / HTML</li> <li>идентификаторы отправителей</li> <li>проверка орфографии</li> </ul> <p></p> <h2>SquirrelMail</h2> <p><img style=\"max-width: 150px;\" src=\"https://s.sweb.ru/img/news/5314719234cfbb2f7c21446b279f2c09.jpg\" alt=\"Почтовый сервер SquirrelMail\"></p> <p>В переводе «Белка», поэтому иногда программисты используют такое название этого модуля. Очень мощный пакет веб-почты. Поддерживает протоколы IMAP и SMTP. При работе с ним есть доступ ко многим модулям, которые значительно увеличивают его функциональность:</p> <ul> <li>ведение логов</li> <li>фильтрация спама</li> <li>календарь</li> <li>шифрование почты с GPG и т. д.</li> </ul> <p>Приложение поддерживает русский язык, работа с ним не доставит никаких неудобств русскоязычным пользователям.</p> <h2>ClamSMTP</h2> <p>Представляет собой фильтр для проверки входящих сообщений на вирусы. Для проверки используется антивирус ClamAV.</p> <p>Программа отличается простотой и надежностью, не зависит от библиотек. Она не фильтрует спам, только определяет вирусы в почте.</p> <h2>SpamAssassin</h2> <p>Относится к категории почтовых фильтров. Спам выявляется путем проведения эвристического анализа заголовков и текстов присланных сообщений путем взаимодействия оценочного сервиса, транспортного агента и базы шаблонов.</p> <p>Запускается тремя способами:</p> <ul> <li>отдельным приложением;</li> <li>частью программы;</li> <li>в качестве клиента.</li> </ul> <p>Более высоким быстродействием отличается использование приложения в качестве клиента.</p> <p>Исследуя тексты, приложение подсчитывает баллы, присваиваемые тексту после прохождения тестов. Порог определения настраиваемый, обычно письмо должно набрать несколько баллов, чтобы подойти по определению спама.</p> <h2>Certbot</h2> <p>Данная программа является официальным клиентом для получения бесплатного SSL-сертификата Let's Encrypt. В случае с почтовым сервером, это позволяет настроить безопасную работу почтовых служб по защищенному протоколу.</p> <h2>Заключение</h2> <p>Некоторые программы из этого списка отлично работают при их совместном использовании. Примером тому может послужить связка Postfix+ OpenDKIM. Совместная работа этих приложений позволяет творить чудеса. Администратор может запретить посторонним сайтам принимать письма от сайта без цифровой подписи.</p> <p>Отлично работает связка ClamAV + clamsmtpd + Postfix – такое решение обеспечит полную безопасность почтового сервера от возможности получить вирус. Изначально устанавливается и настраивается антивирус, запускается файл конфигурации. Потом выполняется привязка антивируса к Postfix.</p> <p>Dovecot+Exim+Spamassassin – этот комплект позволит настроить фильтр от спама и повысит безопасность сервера. Для начала устанавливается Exim, отвечающий, за отправку сообщений, потом устанавливается Dovecot, выполняющий аутентификацию отправителей. Программу Spamassassin администратор настраивает в последнюю очередь.</p> <p>Наличие своего почтового сервера значительно облегчает ведение дел в компании, обеспечивает безопасность, упрощает переписку. <a href=\"/vds/?utm_source=site&utm_medium=article&utm_campaign=bj&utm_term=vps\" target=\"_blank\">Заказать VPS</a> для создания своего проекта можно в нашей компании.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Установка Docker и Portainer на Ubuntu, Debian и CentOS",
          "link": "https://sweb.ru/journal/article/ustanovka-docker-i-portainer-na-ubuntu-debian-i-centos/",
          "turbo:topic": "Установка Docker и Portainer на Ubuntu, Debian и CentOS",
          "turbo:source": "https://sweb.ru/journal/article/ustanovka-docker-i-portainer-na-ubuntu-debian-i-centos/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Установка Docker и Portainer на Ubuntu, Debian и CentOS</h1><figure><img src=\"https://s.sweb.ru/img/news/68c64df9100c30b71dca3f12b65416fa.png\"></figure><h2>Инструкция / мануал / руководство</h2></header><p><strong>Docker</strong>&nbsp;— специальное ПО, с помощью которого можно создавать отдельные контейнеры для приложений, каждый из которых имеет свое окружение и ряд зависимостей. Иными словами вы можете \"упаковать\" нужное вам приложение в отдельный контейнер с необходимым для его работы набором программного обеспечения. Подобные свойства объясняют популярность Docker, так как с его помощью разработчики и администраторы серверов могут тестировать приложения и масштабировать свои инфраструктуры, используя гибкость контейнерной системы.</p> <p><b>Основные понятия, используемые при работе с Docker</b></p> <ul> <li>Docker-ce — бесплатная версия программы для контейнеризации приложений (ce — community edition);</li> <li>Dockerfile — файл, содержащий \"инструкцию по сборке\" образа для того или иного контейнера;</li> <li>Образ — набор определенного ПО, запускаемый в контейнере Docker;</li> <li>Контейнер— виртуальная среда, внутри которой происходит развертывание и запуск сохраненного заранее образа с отдельным набором ПО;</li> </ul> <h2>Установка Docker на Ubuntu и Debian</h2> <p>Нижеприведенные инструкции предоставлены разработчиками в <a href=\"https://docs.docker.com/\" target=\"_blank\" rel=\"noindex nofollow noopener noreferrer\">Docker Docs.</a></p> <p>Первую установку и настройку Docker рекомендуем выполнить на тестовом, чистом сервере с предустановленной ОС. Для этих целей вы можете воспользоваться <a href=\"https://sweb.ru/vds/\">VPS-серверами от хостинга SpaceWeb</a> с тестовым периодом в течение 3 дней.</p> <p>Для установки Docker подойдет одна из следующих 64-разрядных версий ОС:</p> <ul> <li>Debian Bullseye 11 (stable), Debian Buster 10 (oldstable), Raspbian Bullseye 11 (stable), Raspbian Buster 10 (oldstable)</li> <li>Ubuntu Bionic 18.04 (LTS), Ubuntu Focal 20.04 (LTS), Ubuntu Groovy 20.10, Ubuntu Hirsute 21.04</li> </ul> <p>Поддерживаемые архитектуры: x86_64 (или amd64), armhf, arm64 и s390x.</p> <p>Есть несколько способов установки Docker, однако самый популярный и рекомендуемый разработчиками является установка с помощью репозитория. Перед установкой Docker на новой виртуальной машине или cервере необходимо настроить репозиторий.</p> <h3>Настройка репозитория Docker</h3> <p>Первым шагом обновите и установите необходимые пакеты. Обратите внимание, что для выполнения команд Docker необходимо использовать sudo.</p> <p><code> sudo apt-get update <br> sudo apt-get install \\ apt-transport-https \\ ca-certificates \\ curl \\ gnupg \\ lsb-release </code></p> <p>Добавьте официальный GPG ключ Docker:</p> <p><code> curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo gpg --dearmor -o /usr/share/keyrings/docker-archive-keyring.gpg </code></p> <p>Для финальной настройки репозитория используйте одну из следующих команд в зависимости от вашей архитектуры. Для использования каналов обновления nightly или test добавьте нужное название канала (nightly или test) в команду ниже после слова stable.</p> <p><b>x86_64 / amd64</b><code> echo \\ \"deb [arch=amd64 signed-by=/usr/share/keyrings/docker-archive-keyring.gpg] https://download.docker.com/linux/ubuntu \\ $(lsb_release -cs) stable\" | sudo tee /etc/apt/sources.list.d/docker.list > /dev/null </code><b>armhf</b><code> echo \\ \"deb [arch=armhf signed-by=/usr/share/keyrings/docker-archive-keyring.gpg] https://download.docker.com/linux/ubuntu \\ $(lsb_release -cs) stable\" | sudo tee /etc/apt/sources.list.d/docker.list > /dev/null </code><b>arm64</b><code> echo \\ \"deb [arch=arm64 signed-by=/usr/share/keyrings/docker-archive-keyring.gpg] https://download.docker.com/linux/ubuntu \\ $(lsb_release -cs) stable\" | sudo tee /etc/apt/sources.list.d/docker.list > /dev/null </code><b>s390x</b><code> echo \\ \"deb [arch=s390x signed-by=/usr/share/keyrings/docker-archive-keyring.gpg] https://download.docker.com/linux/ubuntu \\ $(lsb_release -cs) stable\" | sudo tee /etc/apt/sources.list.d/docker.list > /dev/null </code></p> <h3>Установка Docker Engine на Ubuntu и Debian</h3> <p>Обновляем пакеты</p> <p><code>sudo apt-get update</code></p> <p>Устанавливаем последнюю версию Docker</p> <p><code> sudo apt-get install docker-ce docker-ce-cli containerd.io</code></p> <p>Для проверки работоспособности Docker запустите тестовый контейнер с образом hello-world</p> <p><code> sudo docker run hello-world </code></p> <p>Проверить текущий статус Docker можно с помощью команды:</p> <p><code> sudo systemctl status docker </code></p> <p>В ответ получаем подобный вывод.</p> <p><img style=\"max-width: 100%;\" src=\"https://s.sweb.ru/img/news/a73e7fa64172079611c32ed7f2bf36c5.png\"></p> <h2>Установка Docker CentOS</h2> <p>Первым шагом установите пакет yum-utils и настройте репозиторий.</p> <p><code>sudo yum install -y yum-utils <br> sudo yum-config-manager \\ --add-repo \\ https://download.docker.com/linux/centos/docker-ce.repo </code></p> <p>Далее установите последнюю версию Docker и запустите его.</p> <p><code> sudo yum install docker-ce docker-ce-cli containerd.io <br> sudo systemctl start docker </code></p> <p>Убедитесь, что Docker работает корректно. Для этого запустите тестовый контейнер с образом hello-world.</p> <p><code> sudo docker run hello-world </code></p> <h2>Установка PORTAINER</h2> <p><strong>Portainer</strong> - графическая панель для управления docker контейнерами.</p> <p>Создайте хранилище данных для Portainer:</p> <p><code> docker volume create portainer_data </code></p> <p>Запустите контейнер c Portainer:</p> <p><code> docker run -d -p 9000:9000 -v /var/run/docker.sock:/var/run/docker.sock -v portainer_data:/data portainer/portainer </code></p> <p>После запуска перейдите в браузере по адресу ip-сервера:9000, интерфейс предложит установить пароль администратора.</p> <p>Далее выбираете расположение Docker на локальном сервере (Local) или на удаленном.</p> <p>Панель установлена, можно запускать контейнеры.</p> <p><img style=\"max-width: 100%;\" src=\"https://s.sweb.ru/img/news/50a1ed3c81fec41d0116fa876082aee1.png\"></p> <p>В панели управления в разделе \"App Template\" можно найти шаблоны с ПО и запустить их в контейнерах.</p> <p><img style=\"max-width: 100%;\" src=\"https://s.sweb.ru/img/news/a047e0ade25d352ff4c7db3797a7e9c0.png\"></p> <p>В разделе \"Containers\" можно увидеть все статусы по контейнерам на сервере. В нашем случае один контейнер с текущей панелью Portainer, а в двух других запущенные ранее тестовые образы hello-world.</p> <p><img style=\"max-width: 100%;\" src=\"https://s.sweb.ru/img/news/e2902438b181a4b6cf710559b02dd5a7.png\"></p> <p>Ставьте Docker <a href=\"https://sweb.ru/vds/\">на наши VPS</a> и тестируйте 3 дня бесплатно! Укажите промокод <b>journal</b> и получите скидку 20%.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Vesta Control Panel — обзор панели управления сервером",
          "link": "https://sweb.ru/journal/article/vesta-control-panel-obzor-paneli-upravleniya-serverom/",
          "turbo:topic": "Vesta Control Panel — обзор панели управления сервером",
          "turbo:source": "https://sweb.ru/journal/article/vesta-control-panel-obzor-paneli-upravleniya-serverom/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Vesta Control Panel — обзор панели управления сервером</h1><figure><img src=\"https://s.sweb.ru/img/news/a89a89a8fcfc58205a43b76f53aa475d.png\"></figure><h2>Вы готовы к встрече с «богиней»?</h2></header><p>Наверняка вы не раз слышали о бесплатной панели управления для работы с веб-сервером под названием <strong>Vesta Control Panel</strong>. Vesta CP хороша тем, что делает доступным взаимодействие с веб-сервером и экономит время специалиста. </p> <p>Чем же отличается Vesta Control Panel от других аналогичных панелей управления, таких, как <a href=\"/journal/article/brainycp:-obzor-i-otzyvy/\">Brainy CP</a>? Ее широкий функционал – первое и основное преимущество. Вы с легкостью добавите сайты, настроите работу с базами данных и почтой, отредактируете зоны DNS, Cron, добавите SSL (доступна быстрая установка бесплатного Let's Encrypt сертификата с помощью специальной кнопки).</p> <p>Заметим, что статья направлена на описание настроек Vesta CP и ее возможностей.</p> <p>Следующим образом выглядит панель при входе в систему. Она включает в себя 2 блока верхних меню.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/e4ac0e103fa3e3bdc4ea87d7b79fe5ad.jpg\"></p> <h3>Первый блок меню</h3> <p>Он содержит в себе технический функционал. Здесь находятся настройки и данные IP-сервера, графические показатели загруженности сайта, системный журнал. В общем, все важные технические показатели сайта.</p> <p>&nbsp;</p> <h3>Второй блок меню</h3> <p>Интерфейс этого блока содержит пользовательские характеристики. Здесь вы сможете добавить веб-сайты и базы данных, электронные почтовые ящики, управлять резервированием (бэкапы).</p> <p>&nbsp;</p> <p>Раздел «User» предоставляет возможность создания и удаления новых юзеров с определенными правами доступа. Доступна функция «пакетного выбора пользователей, в которую входят определенные лимиты на кол-во веб-сайтов, доменных имен, БД и т. д.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/fd01a668b3937e24424322518041f619.png\"></p> <p>Вкладка «WEB» — место управления сайтами в системе. Добавляя новый домен предоставляется возможность настройки <a href=\"/ssl/\" target=\"_blank\" rel=\"noopener noreferrer\">SSL-сертификатов</a>, пользователей для подключения по FTP, а также подключение системы по сбору статистики. Заметим, что в данную систему внедрен Let'sEncrypt. Именно поэтому при помощи VestaCP можно сделать множество бесплатных SSL сертификатов для своих сайтов, расположенных на одном VDS с панелью VestaCP. </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/147984b728b7e1ae6514c3046dbabf5c.jpg\"></p> <p>Раздел «DNS»- вкладка для настройки доменных зон.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/7bf3b8a218fa5277d2391f8d6d726529.jpg\"></p> <p>Хотите создать электронную почту для сайта? Тогда зайдите в раздел «MAIL». В качестве веб-интерфейса почты используется привычный многим RoundCube. Также доступны расширения ClamAV и SpamAssassin для антиспама. </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/0f8a06c63dc9a5ec9b1b4cbb02914c8c.jpg\"></p> <p>Базы данных создаются и хранятся во вкладке «DB». На этапе создания БД вам будет предоставлена возможность выбрать получателя дынных для подключения к БД. </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/0772ebcaf81cc131bb059f1911e08b59.jpg\"></p> <p>Во вкладке «CRON» вы сможете управлять cron-задачами проектов. </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/14bc94b357ac9e9031afe82bb23b298d.jpg\"></p> <p>А где же найти резервные копии? В разделе «BACKUP»! По стандартным настройкам VESTA автоматически формирует три бэкапа, каждый из которых дублирует предшествующий.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/5731d9e29fa214d777b25de80f69f1f0.jpg\"></p> <p>«Пакеты» - первый раздел в верхнем меню. Вкратце о них мы уже упоминали. На приложенном скрине экрана виден default пакет.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/f236ce713bf08c992cb1ad025f6f6218.jpg\"></p> <p>Во вкладке IP хранятся данные об IP-адресе сервера, на котором расположена ПУ VestaCP, а также информация об имеющихся IP для функционирования сайтов. Если вы купли выделенный IP, то пропишите его имя. Прилагаем форму, как это нужно сделать: </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/21650c17b263a47d2dffaa2e2f248e0f.png\"></p> <p>На этой картинке запечатлен раздел «Графики». Вы также можете наблюдать статистику по расходу диска, трафика и памяти.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/229ef8f088283190eb1947295061635f.png\"></p> <p>Раздел «Статистика» позволяет наблюдать за данными о количестве добавленных доменов, статистику по определенным пользователям и т.д. </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/c38e58d78d3d7396a49005462ac7cf97.png\"></p> <p>А для чего тогда нужен раздел «Фаервол»? Для управления правилами фильтрации, браузерный вариант iptables. </p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/e5b24610108ee3e7429dae1868cdd239.png\"></p> <p>«Сервер»- одна из важнейших вкладок VestaCP. Здесь предоставляется возможность запуска apache или nginx, их настройка, переименования имени сервера, настройка модулей.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/b2a5dfb6ead01ce21f83e22d69e59a70.png\"></p> <p>Таким образом, VestaCP отличный вариант поддержания контроля над проектами. Сервер обладает широким функционалам, который подойдет для использования небольшим компаниям. Используйте VestaCP. Оно того, непременно, стоит!</p> <p>&nbsp;</p> <p>О том, как установить Vesta CP на свой VDS смотрите в статье в нашей <a href=\"https://vk.com/@spaceweb_ru-ustanovka-vestacp-na-vpsvds\" target=\"_blank\" rel=\"nofollow\">группе Вконтакте</a></p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Что нового в PHP 8?",
          "link": "https://sweb.ru/journal/article/chto-novogo-v-php-8/",
          "turbo:topic": "Что нового в PHP 8?",
          "turbo:source": "https://sweb.ru/journal/article/chto-novogo-v-php-8/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Что нового в PHP 8?</h1><figure><img src=\"https://s.sweb.ru/img/news/982a2fc66eed03f61117bbedf6f69058.png\"></figure><h2></h2></header><p>PHP – один из самых популярных языков программирования, широко востребованный при разработке веб-приложений. Гибкий и интерпретированный, доступный и универсальный, PHP поддерживает большинство серверов и более двух десятков баз данных.</p> <p>Он открывает безграничные возможности для хостинга, ведь применяемые на основе PHP сервисы отлично масштабируются. Несмотря на частую критику инструмента, получившего в упрощенном переводе прозвище «препроцессор», колоссальное количество удачных проектов в своей основе используют именно его. Wordpress, Facebook, Drupal и другие&nbsp;проекты создавались с помощью PHP.</p> <p>Язык PHP имеет много преимуществ:</p> <ul> <li>Выучить общие принципы работы с PHP можно легко и быстро;</li> <li>Шаблонизатор предоставляет возможность писать сценарии для веб-приложений, программ и мобильных приложений;</li> <li>Совместимость со всеми операционными системами и платформами;</li> <li>Высокая производительность и финансовая доступность.</li> </ul> <p>Недовольство инструментом имеет корни в недалеком прошлом. Простота и доступность для изучения привела к тому, что на PHP создавали страницы, приложения все, кто хоть что-нибудь понимал в программировании. Это приводило к распространению некачественных программ и веб-ресурсов.</p> <p>PHP имеет и реальные недостатки. Это узкопрофильная разработка, предназначенная исключительно для программирования для сети Интернет. К недостаткам относятся также противоречивость кода, погрешности безопасности.</p> <h2>Вкратце о нововведениях в PHP8</h2> <p>Востребованность в совокупности с уязвимостью языка&nbsp;провоцирует постоянное обновление и усовершенствование PHP. Некоторое время назад мы рассказывали о <a href=\"https://sweb.ru/journal/article/chto-novogo-v-php-74/\" target=\"_blank\" rel=\"noopener noreferrer\">нововведениях в PHP 7.4</a>, однако уже в ноябре 2020 года состоялся выпуск версии PHP 8. Усовершенствованный вариант имеет ряд преимуществ. Рассмотрим, какие возможности были добавлены разработчиком:</p> <ul style=\"width: 100%;\"> <li>Union Types</li> <li>JIT</li> <li>Nullsafe-оператор</li> <li>Именованные аргументы</li> <li>Атрибуты</li> <li>Выражение соответствия</li> <li>Новый тип mixed</li> <li>Throw-выражения</li> <li>Weak maps</li> <li>Неименованные исключения</li> </ul> <h3>Union Types</h3> <p>Совокупность нескольких типов, указывающих на возможность использования любого из них, представляет собой функцию Union Types. Новая версия PHP позволяет использовать объявления Union Types, проверка которых осуществляется моментально, одновременно с выполнением. Такая возможность появилась взамен аннотаций PHP docs.</p> <p><img src=\"https://s.sweb.ru/img/news/87df895fc86491556630eef9af2715db.png\"></p> <h3>JIT</h3> <p>Компилятор Just In Time, именуемый JIT, оптимизирует производительность процессов во время работы программ, приложений и т.д., благодаря динамической компиляции. Первоочередно код транслируется в промежуточное представление, затем в машинный код. Выполнение происходит на процессоре, без использования виртуальной машины.</p> <p><img src=\"https://s.sweb.ru/img/news/d4c9e6aa5c1c0697ed734dcc167b4988.png\"></p> <h3>Nullsafe-оператор</h3> <p>Прежняя система, при работе с оператором null, демонстрировала неудобное свойство: невозможность применения в цепочке вызовов методов. Возникала потребность в промежуточных проверках или в применении помощников.</p> <p>Внедрение Nullsafe-оператора позволяет разработчику наблюдать поведение методов.</p> <p><img src=\"https://s.sweb.ru/img/news/f12f5ea7f3642d8498c3f4f76b4cf389.png\"></p> <h3>Именованные аргументы</h3> <p>Именованные аргументы открывают возможность передачи значения в функцию путем указания имени значения. Для разработчика это способ оптимизировать рабочий процесс, и спокойно без потерь пропускать второстепенные по значимости параметры. При этом порядок аргументов больше не имеет значения.</p> <p><img src=\"https://s.sweb.ru/img/news/9f9b2b6cbe6f2a13d01c36b7e9c6b917.png\"></p> <h3>Атрибуты</h3> <p>Атрибуты предоставляют возможность добавления метаданных с нативным синтаксисом PHP в классы удобным способом. Данная опция позволяет разделить абстрактную реализацию некоторой функции и ее кодовое использование. Атрибуты – это новые возможности и технически более совершенный способ добавлять дополнительную информацию и конфигурацию.</p> <p><img src=\"https://s.sweb.ru/img/news/ca175a7527358702785a03cd06886332.png\"></p> <h3>Выражение соответствия</h3> <p>Новинка PHP 8 – match. Это выражение с возможностью сохранения в переменной либо возврата. Новые условия позволяют применять исключительно однострочные выражения без использования конструкции break.</p> <p><img src=\"https://s.sweb.ru/img/news/59a164465d1d3ade68a11d6d5945000f.png\"></p> <h3>Новый тип mixed</h3> <p>В процессе эволюции PHP разработчиками добавлялись новые категории типов – скалярные, обнуляемые. В новой версии появились типы класса mixed – смешанные. Смешанная категория позволяет добавлять типы в параметры и свойства, может применяться как тип возвращаемого значения, а также использоваться как параметр или тип свойства.</p> <h3>Throw-выражения</h3> <p>Обновленная версия позволит преобразование в выражение инструкции throw – в предыдущих выпусках такой опции не было. Такое нововведение расширяет возможности использования инструмента.</p> <h3>Weak maps</h3> <p>Восьмая версия дополнена классом WeakMaps, позволяющим сохранять ссылку на объект. При этом сам объект можно свободно удалить.</p> <h3>Неименованные исключения</h3> <p>В прежних версиях перехват исключения был возможен с предварительным сохранением его в переменной. При этом не имело значения, использовалась ли переменная. PHP 8 позволяет перехватывать исключения, указание переменной при том не требуется. При этом следует иметь ввиду, что тип нужно указывать обязательно: PHP 8 не предусматривает возможность оставлять пустой catch.</p> <h3>Новые возможности PHP 8</h3> <p>Помимо добавленных для разработчиков возможностей, версия PHP 8 дополнена рядом других существенных изменений (деление на ноль, возвращение типа переменной, идентификация ресурса и т.д.).</p> <p>С полным списком изменений в версии PHP 8 вы можете ознакомиться <a href=\"https://www.php.net/ChangeLog-8.php\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">на официальном сайте</a>.</p> <h2 style=\"width:100%;\">PHP 8 на хостинге SpaceWeb</h2><br> <h3>PHP 8 для действующих клиентов хостинга SpaceWeb</h3> <p>Вы можете выбрать нужную версию PHP в разделе «Сайты» → «Настройки конфигурации». Обратите внимание, что PHP 8 доступен в связке с Apache 2.4, в котором отличается синтаксис некоторых директив .htaccess. Подробнее в разделе «<a href=\"https://help.sweb.ru/entry/1035/\">Помощь</a>» Перед сменой PHP настоятельно рекомендуем удостовериться в совместимости вашего сайта с выбираемой версией.</p> <h3>PHP 8 для новых клиентов</h3> <p>Хотите протестировать работу своего сайта на PHP 8 одним из первых? <a href=\"https://sweb.ru/hosting/\">Заказывайте виртуальный хостинг</a> в SpaceWeb — у нас PHP 8 уже доступен на любом тарифе! При необходимости мы можем бесплатно перенести ваш сайт к нам на хостинг. А бесплатный тестовый период в 14 дней позволит вам не спеша провести тестирование сайта на самом современном оборудовании и программном обеспечении.</p><img src=\"https://s.sweb.ru/img/onboardbnrs/c8c8340532e73ff0ba66258e5304efdb.png\" /><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Топ-6 сервисов для проверки кроссбраузерности сайта",
          "link": "https://sweb.ru/journal/article/top-6-servisov-dlya-proverki-krossbrauzernosti-sayta/",
          "turbo:topic": "Топ-6 сервисов для проверки кроссбраузерности сайта",
          "turbo:source": "https://sweb.ru/journal/article/top-6-servisov-dlya-proverki-krossbrauzernosti-sayta/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Топ-6 сервисов для проверки кроссбраузерности сайта</h1><figure><img src=\"https://s.sweb.ru/img/news/0cdf86f6c7fb46cb741e9ecb05a72869.jpg\"></figure><h2></h2></header><p>Кроссбраузерность - это важное свойство сайта, позволяющее ему идентично выполнять работу и правильно отображаться в любом браузере. Не должно быть места развалам верстки, весь материал должен оставаться одинаково читабельным. Сайт можно проверять в разных браузерах и системах десятками способов с помощью приложений, онлайн-сервисов и установив при этом одновременно несколько браузеров.</p> <h2 style=\"width: 100%;\">Список лучших сервисов для проверки&nbsp;кроссбраузерности сайта:</h2> <h3>1. Browsera</h3> <p>Предоставляет утилиты, за которые нужно платить, но они того стоят, потому что отличаются многофункциональностью. Кроссбраузерность макета он позволит протестировать легко, более того, он покажет, как работают скрипты в разных ситуациях, какова степень защищенности сайта и то, как происходит отображение страниц в динамике. Есть бесплатная версия сроком на месяц, но лучше всего будет выбрать базовый вариант. Он тоже не требует оплаты, но имеет более бедный функционал.</p> <h3>2. Browser Stack</h3> <p>С помощью возможности использования реальных приспособлений для тестирования и поддержки почти тысячи браузеров, сервис может тестировать на высоком уровне и выдавать скриншоты любого разрешения экрана. Фрилансеры могут получить неплохую скидку, а многие open source проекты могут пользоваться услугами этого сервиса бесплатно.</p> <h3>3. Browsershots</h3> <p>Не уступающий платным конкурентам, бесплатный сервер, отличающийся богатым разнообразием функций. Он позволит сделать скриншоты того, как смотрится сайт в разных браузерах. Тестирование нельзя провести автоматически, поэтому оно проходит довольно долго. Небольшой минус —&nbsp;отсутствие возможности тестирования мобильными браузерами. Платная версия значительно расширяет возможности.</p> <h3>4. Browser Sandbox</h3> <p>Сервер для тех, кто пользуется Windows, имеющий очень расширенный список разных браузеров. Бесплатно можно провести тестирование, если установленная версия браузера является последней. Для проверки старых версий нужно будет купить платную версию, ее стоимость не превышает 5 долларов на момент написания заметки.</p> <h3>5. IE Testers</h3> <p>Для тех, кто имеет проблемы с правильным отображением сайта в IE, предназначены такие инструменты как браузер Microsoft Edge, My Debugbar и Netrenderer. Более удобной платформой можно назвать Microsoft Edge, который даст возможность получения скриншота сайта в различных браузерах (даже мобильных).</p> <h3>6. CrossBrowserTesting</h3> <p>Характеризуется использованием реальных устройств для тестов и это даёт исчерпывающую информацию. Функционал огромен и инструмент точно будет стоить потраченных на него денег. Насчитывает около тысячи браузеров и операционных систем. Также он позволяет провести тестирование сайта в реальном времени,&nbsp;<span class=\"wo fr-4\" data-num=\"4\">чтобы проверить как работают&nbsp;HTML-формы, Flash и т.д. Ещё можно&nbsp;сравнивать скриншоты и автоматизировать тесты.</span></p> <p>&nbsp;</p> <p>Все вышеперечисленные сервисы неплохо совмещают в себе доступную цену и широкий функционал. Выводы делать нельзя, они довольно субъективны. Главное понимать, что бесплатные варианты больше подойдут для экспресс-тестов, а платные имеют более расширенный функционал.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как выбрать хороший дешевый хостинг",
          "link": "https://sweb.ru/journal/article/kak-vybrat-horoshiy-deshevyy-hosting/",
          "turbo:topic": "Как выбрать хороший дешевый хостинг",
          "turbo:source": "https://sweb.ru/journal/article/kak-vybrat-horoshiy-deshevyy-hosting/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как выбрать хороший дешевый хостинг</h1><figure><img src=\"https://s.sweb.ru/img/news/ded1185f7f482daf246211ca7a861137.jpg\"></figure><h2></h2></header><h2>Качественный хостинг дешево: миф или реальность?</h2> <p>Хостинг – услуга, в рамках которой вы сможете разместить и администрировать ваши сайты в сети. В одной из прошлых статей мы уже разобрали <a href=\"/journal/article/kak-vybrat-hosting-dlya-sayta/\" title=\"Как выбрать хостинг\" target=\"_blank\">отличия платного от бесплатного хостинга</a>, теперь же хотим рассказать, как можно сэкономить при выборе платного хостинга.</p><p>Большинство веб-мастеров выбирают хостинг-провайдера неосознанно, выбор им помогают сделать реклама или дешевая цена за услугу. К сожалению, используя такой подход веб-мастер обрекает себя в дальнейшем на регулярную смену провайдеров, что приводит к потере времени и нервных клеток. Кроме этого, неработающий по вине&nbsp;выбранного наобум&nbsp;хостера сайт может принести вполне реальные убытки.</p> <p>Чтобы правильно подобрать дешёвый, но качественный хостинг, рекомендуем сформировать список запросов и прочитать данную статью до конца.</p> <h2>Как подобрать самый дешевый веб-хостинг сайтов?</h2> <p>Чтобы купить хостинг дешево и не ошибиться в выборе, первым делом стоит определить ряд характеристик, которым он должен удовлетворять.</p> <h2>Параметры хостинга</h2> <ul> <li>Веб-сервер:&nbsp;Apache,&nbsp;Nginx;</li> <li>Язык программирования: актуальные версии&nbsp;PHP,&nbsp;Perl,&nbsp;Ruby,&nbsp;Python&nbsp;и другие — те, которые используются вашими сайтами;</li> <li>Фреймворки:&nbsp;Django,&nbsp;Node.js&nbsp;и другие необходимые;</li> <li>Система управления базами данных: актуальные версии MySQL,&nbsp;MariaDB и другие;</li> <li>Библиотеки, модули и прочие настройки:&nbsp;Imagemagick, Zend Guard Loader, Zend Optimize,&nbsp;IonCube,&nbsp;gzip&nbsp;сжатие и другие;</li> <li>Характеристика сервера: мощность процессора, жесткие диски должны быть только NVMe&nbsp;SSD;</li> <li>Доступность: uptime >99.96%;</li> <li>Панель управления хостингом: собственная,&nbsp;ISPmanager,&nbsp;Cpanel,&nbsp;Plesk,&nbsp;Brainy,&nbsp;Vesta&nbsp;и другие;</li> <li>Количество припаркованных доменов: желательно неограниченно;</li> <li>Почта: антиспам и антивирус для почты, ограничения почтовой системы;</li> <li>Наличие защиты от DDos атак;</li> <li>Антивирус для сайта: ручная и автоматическая проверка файлов сайта;</li> <li>Техническая поддержка: быстрая скорость ответа 24/7 и&nbsp; возможные способы коммуникации;</li> <li>Другое: удобство оплаты, статистика нагрузки/памяти/посетителей,&nbsp;Crontab.</li> </ul> <h2>Основные параметры хостинг-тарифов</h2> <ul> <li>Количество сайтов, которое можно разместить в рамках конкретного тарифа;</li> <li>Количество баз данных, которое вы можете создать для своих сайтов;</li> <li>Количество&nbsp;FTP-аккаунтов для доступа файлам хостинга;</li> <li>Количество почтовых ящиков, которые вы можете создать в рамках услуги;</li> <li>Количество ресурсов сервера, которые могут быть использованы в рамках тарифа;</li> <li>Акции и бонусы: бесплатный домен и <a href=\"/journal/article/vsyo-chto-nuzhno-znat-ob-ssl-sertifikatah/\" target=\"_blank\">SSL-сертификат</a> или скидки на оплату;</li> <li>Возможность протестировать хостинг бесплатно.</li> </ul> <p>Составив лист ожиданий от хостинг-провайдера, следует заранее обратиться в онлайн-чат хостинга и задать все интересующие вас вопросы. Так вы сэкономите время, вычеркнув неподходящие варианты из своего списка кандидатов. Вы также можете отправить в техническую поддержку весь список ваших потребностей и запросить рекомендацию самого дешевого тарифного плана, удовлетворяющего вашему списку.</p> <p>Оставив несколько вариантов, стоит запросить у хостинга тестовый период. На тестовом периоде вы сможете разместить свой сайт по техническому адресу и проверить его работоспособность и скорость, а также сравнить внутреннюю инфраструктуру каждого хостера.</p> <p>Следуя данный схеме выбора, у вас есть все шансы подобрать самый дешевый и качественный хостинг для своих сайтов на долгие годы.</p> <h2>Где купить лучший хостинг для сайта дешево?</h2> <p>Большинству сформированных ваше запросов соответствует один из лидеров хостинг индустрии в России – хостинг SpaceWeb. Идет в ногу со временем, имеет актуальное железо и программное обеспечение. Даже в самых дешевых тарифных планах — большие лимиты на использование ресурсов сервера и БД.</p> <p>В данный момент в&nbsp;SpaceWeb&nbsp;можно купить <a href=\"/?utm_source=site&utm_medium=article&utm_campaign=bj&utm_term=hosting_deshevo\" target=\"_blank\">дешевый хостинг для сайта</a> за 49 рублей в месяц и получить в подарок регистрацию доменного имени в одной из самых популярных доменных зонах и&nbsp;SSL-сертификат для защищенного https соединения с вашим сайтом!</p> <p>Помимо этого, техническая поддержка SpaceWeb&nbsp;может бесплатно перенести ваши сайты и подарить 4 месяца хостинга без первоначального платежа!</p> <p><a href=\"/?utm_source=site&utm_medium=article&utm_campaign=bj&utm_term=hosting_deshevo\" target=\"_blank\">Попробуйте</a> один из лучших и выгодных хостингов России бесплатно в течение 14 дней.</p><img src=\"https://s.sweb.ru/img/onboardbnrs/c8c8340532e73ff0ba66258e5304efdb.png\" /><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Обзор «1С-Битрикс Управление сайтом» и «Битрикс 24»",
          "link": "https://sweb.ru/journal/article/obzor-1s-bitriks-upravlenie-saytom-i-bitriks-24/",
          "turbo:topic": "Обзор «1С-Битрикс Управление сайтом» и «Битрикс 24»",
          "turbo:source": "https://sweb.ru/journal/article/obzor-1s-bitriks-upravlenie-saytom-i-bitriks-24/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Обзор «1С-Битрикс Управление сайтом» и «Битрикс 24»</h1><figure><img src=\"https://s.sweb.ru/img/news/eac1a49e92a1484f16154f53d40ee671.png\"></figure><h2></h2></header><p>В нашу компанию часто приходят вопросы от ",
            "#cdata-section1": " владельцев бизнеса разного масштаба. Один из популярных вопросов: «Какие сервисы, продукты и инструменты помогут полностью организовать работу компании в сети. Есть ли такие комплексы программ?»</p> <p>Прежде чем ответить на данный вопрос, давайте разберемся в причинах его появления.</p> <p>Подумайте, сколько времени, денег и сил нужно потратить на разработку собственных систем? Такие гиганты, как Google, Yandex, Apple разрабатывали свои системы десятилетиями и вложили в разработку миллионы, а то и миллиарды долларов США.</p> <p>У большинства компаний нет таких возможностей. Бизнесу нужны система и инструменты для работы в сети прямо сейчас и желательно&nbsp;недорого.</p> <p>В истории достаточно примеров крупных провалов, когда компании вкладывали огромные деньги в разработку собственных систем, не имея инструментов для работы с клиентами и сотрудниками в режиме реального времени. Как итог&nbsp;— закрытие проектов и подача заявлений о банкротстве.</p> <p>К счастью, в 2021 году есть отечественный программный продукт по доступной цене, способный полностью удовлетворить потребности бизнеса не только в России, но и за рубежом.</p> <p>«1С-Битрикс» разрабатывает IT-решения&nbsp;с 1998 года и на данный момент является лидером российского рынка среди производителей программного обеспечения для работы бизнеса в интернете.</p> <p>Сегодня мы поговорим о комплексе программ «1С-Битрикс24: магазин + CRM», который состоит из двух программ: CMS «1С-Битрикс: управление сайтом» и CRM «Битрикс 24». Рассмотрим каждую из них.</p> <h2>Обзор CMS «1С-Битрикс: Управление сайтом»</h2> <p>«1С-Битрикс: Управление сайтом» — это профессиональная система управления сайтами и интернет-магазинами.</p> <p>По данным рейтинга iTrack на апрель 2021 года «1C-Битрикс» является самой популярной коммерческой CMS по количеству установок на сайтах.</p> <p><img style=\"max-width: 800px;\" src=\"https://s.sweb.ru/img/news/ece097ce090c7f17dd862906d6363395.png\"><br> <em style=\"text-align: center;\">Данные о популярности коммерческих CMS от рейтинга iTrack</em></p> <p>Среди пользователей системы множество крупных интернет-магазинов, предприятий, банков и государственных учреждений: Госдума РФ, Эхо Москвы, Евросеть, re:Store, «Газпром Нефть», банк ВТБ, МТС, Ростелеком и многие другие.</p> <p>На данный момент можно приобрести одну из 4 лицензий «Битрикса» стоимостью от 5400 до 72900 рублей, каждая из которых имеет свой набор функций.</p> <p><img style=\"max-width: 800px;\" src=\"https://s.sweb.ru/img/news/83b6b1ccab7ac8fd1e83ca56f397c6c4.png\"><br> <em style=\"text-align: center;\">Лицензии 1С-Битрикс в магазине хостинга SpaceWeb</em></p> <h2>Возможности CMS «1С-Битрикс: Управление сайтом»</h2> <p>В зависимости от типа лицензии 1С-Битрикс позволяет:</p> <ul> <li>Создать сайт любой сложности: от визитки и блога до форума и интернет-магазина с возможностью полного редактирования структуры сайта и информации на нем;</li> <li>Регистрировать пользователей на сайте, распределять права доступа и осуществлять по ним email рассылку;</li> <li>Анализировать информацию, которая нужна для оптимизации контента под продвижение в поисковых системах (SEO);</li> <li>Отслеживать и устранять проблемы с производительностью сайта с возможностью его ускорения при&nbsp;помощи географически распределённой сетевой инфраструктуры (CDN).</li> <li>Осуществлять автоматический бэкап сайта в «облако» и возможность восстанавливать его оттуда;</li> <li>Реализовать все возможности крупного интернет-магазина, включая прием и обработку заказов и размещение в&nbsp;товарном каталоге тысяч наименований товаров с возможностью их обновления в формате XML из «1С» или других программ, также делать импорт-экспорт данных каталога в формате Excel;</li> <li>Управлять скидками и наценками, оптовыми, дилерскими, розничными ценами, в том числе в зависимости от зоны доставки;</li> <li>Настроить сайт для оплаты заказа через обычные и электронные платежные системы;</li> <li>Реализовать E-mail маркетинг, включая триггерные рассылки, автоматизированные рассылки о новинках и акциях по сегментам, а также анализ эффективности этих рассылок.</li> </ul> <p><img src=\"https://s.sweb.ru/img/news/fe2eb83ce518eea56a3fa82cae9f7c61.png\"> <em style=\"text-align: center;\">Пример админ-панели для интернет-магазина</em></p> <p>В целом, если вы уже ранее работали с какой-либо системой управления сайтом, то разобраться в инструментах «1С-Битрикс: Управление сайтом» не составит для вас труда. Функционал панели может отличаться в зависимости от типа CMS, который вы выбрали при установке CMS (интернет-магазин, корпоративный портал и т.д).</p> <p>Для ознакомления со всеми функциями продукта «1С-Битрикс», можно установить демо-версию к себе на виртуальный сервер и познакомиться с интерфейсом бесплатно в течение 30 дней. Также можно воспользоваться онлайн версией по ссылке, где вы можете запустить продукт и протестировать его в течение 3 часов.</p> <h2>Обзор CRM «Битрикс 24»</h2> <p>«Битрикс 24» - система, позволяющая организовать коллективную работу в компании при помощи рабочих инструментов в социальном формате.</p> <p><img src=\"https://s.sweb.ru/img/news/6715978724c18ca80f31cce769c9cab7.png\"></p> <p>С помощью данного сервиса возможно хранение данных о сотрудниках и клиентах, управление рабочим временем и планирование задач, доступное даже для небольших компаний.</p> <h2>Для чего нужен «Битрикс 24»</h2> <p>Концепция социального Интранета позволяет объединить рабочие инструменты корпоративного портала с привычным функционалом социальных сетей.</p> <p>Интранет – это внутренняя часть системы по совместному использованию и обмену данными среди пользователей (сотрудников) корпоративного сайта или частной сети.</p> <p>С помощью функционала программы «Битрикс 24» пользователи получают доступ к социальному порталу, клиентской базе (CRM), могут осуществлять работу с документацией и управлением задачами, а также заниматься планированием рабочего времени.</p> <p>Система «Битрикс 24» нужна для контроля всех процессов внутри вашей компании.</p> <h2>Как работать в «Битрикс 24»</h2> <p>Для начала работы с системой, пользователю необходимо создать учетную запись или войти в уже имеющуюся.</p> <p>В личном кабинете можно изменить свои личные данные, выбрать темы оформления, настроить уведомления, а также редактировать информацию в разделе «Моя страница».</p> <p><img src=\"https://s.sweb.ru/img/news/9690f2ef8cee5fb44477739e447eb63d.png\"></p> <p>Широкий функционал продукта «1С-Битрикс» позволяет настроить пункты меню по своему усмотрению. Система уведомлений оповещает о предстоящих встречах, установленных сроках и событиях.</p> <p>В разделе помощи можно найти ответы на большинство вопросов о том, как пользоваться «Битрикс24». Также доступна служба технической поддержки и консультация в онлайн-чате с виртуальным помощником. Служба технической поддержки доступна только для пользователей с коммерческим тарифным планом.</p> <h2>«Битрикс 24»: инструкция для начинающих</h2> <p>После ознакомления с информацией о том, что такое «Битрикс 24» и регистрацией на сайте, пользователь приступает к работе с системой.</p> <p>Первым делом создаем структуры компании (бухгалтерия, служба контроля качества, маркетинг, сектор касс и т.п.). Для этого необходимо внести данные в подраздел «Структура компании», которая находится в разделе «Компания». Важно понимать, что правильное создание структур поможет эффективно распределить обязанности и права для всех сотрудников.</p> <p>После создания структур компании нужно перейти в раздел «Настройки портала» и отметить название, контактные данные, рабочий график, настроить формат времени и назначить доступ к «Живой ленте» для определенных сотрудников.</p> <p>С помощью инструмента «Битрикс24.Диск» можно загрузить документы, которые будут необходимы сотрудникам. Здесь удобно сохранять договора, коммерческие предложения, внутреннюю документацию, спецификации, чек-листы и т.д.</p> <p>Работа со списками контактов проводится в разделе «CRM», куда можно импортировать их из почтовых сервисов, таблицы «Excel» или из файла формата «.csv». Если объем контактов небольшой, то их можно внести вручную, используя кнопку «Добавить контакт».</p> <p>Инструмент «Календарь» позволяет добавлять события и встречи, планируя не только время, но и возможных участников.</p> <p>После настройки необходимого функционала сервиса можно приступить к формированию списка сотрудников. С помощью кнопки «Пригласить сотрудников» возможно добавить их в выбранные отделы, заполнив для каждого основную информацию и отправив приглашение на электронную почту.</p> <h2>«Битрикс 24»: преимущества системы</h2> <p>Безопасность системы. Разработчики постоянно усовершенствуют функционал и защиту для коммерческих проектов.</p> <p>Круглосуточная техническая поддержка и возможность обратной связи. Любой пользователь может оставить разработчикам свои идеи и предложения по улучшению сайта или повышению качества обслуживания.</p> <p>Индивидуальные решения для разных категорий компаний. При наличии определенных знаний и навыков, пользователь может самостоятельно создавать свои системы управления.</p> <p>Возможность интеграции баз данных в единую систему. Возможность совмещения с системой 1C и бухгалтерскими программами.</p> <h2>«Битрикс 24»: недостатки системы</h2> <p>Большие требования системы к мощностям хостинг-провайдеров.</p> <p>Стоимость системы. Для ознакомления и первоначальной работы с системой подойдет бесплатный тарифный план, но с ростом компании и увеличением количества сотрудников и внутренней документации возникнет необходимость перехода на коммерческий тарифный план.</p> <h2>Установка 1С-Битрикс на сервер</h2> <p>Процесс запуска системы прост и сравним с установкой других популярных систем управления.</p> <p>На <a href=\"https://www.youtube.com/c/spaceweb\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Youtube канале SpaceWeb</a> доступно видео с инструкцией по установке «1С-Битрикс24: Интернет-магазин + CRM». Оно универсально и для установки других продуктов от 1С-Битрикс.</p> <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/XwnwutPbidk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe> <p><b> Краткая инструкция по установке Bitrix24 на сервер</b></p> <ul> <li>Необходима чистая услуга <a href=\"https://sweb.ru/vds/\" target=\"_blank\" rel=\"noopener noreferrer\">VPS с дистрибутивом BitrixVM</a>. Если таковой нет, необходимо заказать.</li> <li>Вбиваем в адресную строку браузера IP-адрес, указанный в панели управления для вашего VPS-сервера с дистрибутивом BitrixVM и начинаем пошаговую установку.</li> <li>Выбираем нужный продукт (Например, Интернет-магазин + CRM), создаем администратора и задаем параметры регистрации пользователей. Установка завершена, можно перейти в панель и ознакомиться с интерфейсом.</li> </ul> <h3>Итоги</h3> <p>Подводя итоги, отметим самые главные тезисы из этого обзора.</p> <p>1С-Битрикс предоставляет комплексное решение и инструменты для бизнеса в России и вряд ли вы найдете достойную альтернативу. К примеру, разработка подобной системы для компании на других CMS (Wordpress, Joomla, Drupal, Opencart) потребует серьезных вложений и много времени на создание. К тому же, установка бесплатных решений/плагинов для этих CMS может сделать вашу систему уязвимой, что в итоге может привести к крупным финансовым и репутационным потерям.</p> <p>Комплексная лицензия стоит 99000 рублей в год, что&nbsp;сперва&nbsp;может показаться высокой ценой. Учтите, что наняв в компанию одного разработчика за 20$ в час вы израсходуете этот бюджет за несколько недель, а на выходе получите сырой набросок. Можно начать своё знакомство с более простых решений от «1C-Битрикс», например, с лицензии «Старт» стоимостью 5400 рублей в год. При необходимости лицензию потом можно изменить.</p> <p>В настоящий момент для клиентов хостинга SpaceWeb доступна <a href=\"/web/hosting-forbitrix/\" target=\"_blank\" rel=\"noopener noreferrer\">акция</a>. При покупке или продлении лицензии 1С-Битрикс в нашем магазине по официальной цене вы получите до года хостинга или VDS в подарок! Спешите воспользоваться!</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Антивирус для сайта",
          "link": "https://sweb.ru/journal/article/antivirus-dlya-sayta/",
          "turbo:topic": "Антивирус для сайта",
          "turbo:source": "https://sweb.ru/journal/article/antivirus-dlya-sayta/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Антивирус для сайта</h1><figure><img src=\"https://s.sweb.ru/img/news/6fc0f1dec366b262ab4467884d11cbe8.png\"></figure><h2>Автоматический антивирус для проверки и удаления вирусов с сайта</h2></header><p>Любой сайт, размещённый на хостинге, подвержен опасности заражения вирусами. Чем это грозит его владельцу? Поисковые системы в таком случае добавляют к сайту специальную отметку, которая видна в сниппете при выдаче результатов поиска. Она предупреждает пользователя, что переходить по ссылке опасно. В результате рейтинг такого сайта падает вместе с посещаемостью.<br></p><p>Даже после лечения сайта от вирусов восстановление посещаемости и репутации произойдёт не сразу. Особенно неприятно, если в продвижение ресурса были вложены деньги. Какой же есть выход?</p> <h2>Виды вирусов на сайте</h2> <p>Приведём пример. С началом пандемии стал бурно развиваться рынок онлайн-образования. Многие учебные заведения и платформы не имели защиты от киберугроз. К середине 2020 года на долю образовательной отрасли пришёлся 61% от общего количества кибер-атак. Одна из основных угроз — это фишинговые атаки.</p> <p>Конечно, это не единственный вид кибер-угрозы, и учебные платформы — не единственная цель для вирусов.</p> <p>Кратко перечислим основные виды вирусов.</p> <h3>Вирусные вставки кода на сайтах</h3> <p>Один из самых распространённых способов заражения - это iframe-вставки. С помощью специального кода, заключённого в теге iframe, можно загрузить и запустить на компьютере жертвы скрипт. Код спрятан в скрытое окно со значением 0 по высоте и по ширине, поэтому его визуально не обнаружить. Может быть добавление в код сайта функции eval.</p><br><p> <em>Основные цели этих вставок:</em> </p><ul> <li>Мошенничество.</li> <li>Кража номеров кредитных карт.</li> <li>Сбор логинов, паролей и прочей конфиденциальной информации.</li><li>Загрузка вирусов на компьютер клиента.</li></ul><p></p> <h3>SQL-инъекции</h3> <p>Инъекции - это отдельный класс уязвимостей в OWASP Top-10. Это уязвимость в программном обеспечении, которая заключается в отсутствии или некорректном экранировании (фильтрации) специальных символов в участке кода, работающем с базой данных. Специальный код, как правило, переданный через поле ввода текста на сайте, даёт команды на выполнение и изменяет базу данных или делает копию её содержимого. Таким образом злоумышленник может получить/изменить пароли для управления сайтом.</p><br> <h3>Фишинговые атаки</h3> <p>Мошенники рассылают поддельные электронные письма или создают поддельные веб-сайты, имитирующие страницы входа известных сайтов, чтобы обманом заставить пользователей раскрыть свои логин и пароль. Эту практику иногда называют «фишингом» — отсылка к английскому слову «рыбалка», потому что мошенник выуживает информацию о личной учетной записи.</p> <h3>Веб-шелл</h3> <p>Это вредоносный скрипт, используемый злоумышленником для поддержания постоянного доступа к уже скомпрометированному веб-приложению. Сама веб-оболочка не может атаковать или использовать удаленную уязвимость, поэтому это всегда второй этап атаки (этот этап также называется пост-эксплуатацией). Веб-оболочки могут обеспечить постоянный бэкдор в веб-приложения и связанные с ними системы.</p> <h3>Бэкдоры</h3> <p>Это тип вредоносного ПО, которое отменяет обычные процедуры аутентификации для доступа к системе. В результате удаленный доступ предоставляется к ресурсам в приложении, что дает злоумышленникам возможность удаленно выполнять системные команды и обновлять вредоносное ПО. Установка бэкдора достигается за счет использования уязвимых компонентов в веб-приложении.<br></p> <h3>Дорвей</h3> <p>Инструмент «черного SEO». Сайт, созданный для перенаправления пользователей на другой интернет-ресурс. Такие ресурсы считаются поисковым спамом. Они создаются с целью занять высокие позиции в выдаче по выбранным поисковым запросам.</p> <h3>Спам-скрипты</h3> <p>Ведут рассылку спама через php-скрипты. Владелец сайта узнаёт от такой рассылке, как правило, только из предупреждения от хостинговой компании.<br></p> <h2>Как вирус попадает на сайт?</h2> <p>Какими путями может быть заражён сайт:</p> <ul> <li>Через компьютер веб-мастера, который пользуется FTP-менеджерами, если он сохраняет пароли от админки в браузере и использует типовые имена учётных записей;</li> <li>Высока доля веб-приложений с уязвимостями XSS (межсайтовое выполнение сценариев). Один из частых примеров - кража Cookies (файлы в браузере для хранения данных);</li> <li>После утечки данных доступа к хостингу в письмах (стандартная практика взлома почтовых ящиков и их сканирования для поиска такой информации);</li> <li>Установка плагинов, тем и расширений с уже имеющимся бэкдором внутри (например, из непроверенного источника);</li> <li>Небезопасное восстановление паролей;</li> <li>Уязвимости CMS, плагинов и расширений CMS;</li> <li>Уязвимости в самописных или сторонних скриптах.</li> </ul> <p>Самописные сайты или популярные движки — любой ресурс может оказаться целью атакующего. Причем CMS имеют открытый код. Когда злоумышленник находит уязвимость, он при помощи эксплоита (подвид вредоносных программ) или бота пытается ей воспользоваться на всех сайтах, имеющих эту версию движка. Поэтому атака бывает массовой, а из-за того, что вовремя обновляют версии менее половины владельцев сайтов, проблема может быть масштабной.</p> <p>В среднем на одно веб-приложение приходится более 30 уязвимостей, шесть из которых имеют высокий уровень риска.</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/9ff5692bde483b13550f9b78a4b3b840.png\"></p> <p>Что может произойти&nbsp;после проникновения вируса на сайт: заражение сайта с целью дальнейшего распространения вируса, кража данных пользователей сайта, кража внутренних данных сайта и сопряжённых систем.</p> <p>Кому и зачем это нужно? Злоумышленники зарабатывают на распространении вирусов, размещении рекламы и ссылок, краже данных с банковских карт, краже и перепродаже коммерческой информации, шантаже и прочем.<br></p> <h2>Проверка сайта на вирусы онлайн</h2> <p>Защитить ваш сайт поможет ряд предосторожностей: регулярное обновление ПО сайта, правильные настройки, сложные пароли, которые нужно часто менять и не сохранять в браузере, отсутствие стандартных логинов (вроде admin), регулярные бэкапы.</p> <p>Но этих мер недостаточно. Важен выбор хорошего проверенного провайдера, который заботится о безопасности сайтов своих клиентов.</p> <p>SpaceWeb для безопасного размещения у себя на хостинге предлагает <a href=\"https://help.sweb.ru/entry/949/\" target=\"_blank\" rel=\"noopener noreferrer\">антивирус для сайта</a> от лидера рынка веб-безопасности компании Virusdie.</p> <p>Никаких сложных настроек и подключений к стороннему ресурсу не требуется. В панели управления можно в один клик запустить проверку сайта, а также вылечить обнаруженные вирусы.</p> <h2>Как работает антивирус для сайта</h2> <p>Virusdie поставляет своё решение в целом для всего хостинга, поэтому нет нужды думать, как подключить его для своего сайта. Все сайты в SpaceWeb автоматически проверяются на вирусы раз в месяц. Отчёт с результатами проверки доступен в панели управления. В случае выявления вирусов клиент дополнительно получает уведомление по email.<br></p>Для выполнения ежедневной и/или ручной (в любое время) проверки сайта на вирусы необходимо подключить подписку на антивирус в панели управления. Стоимость подписки для одного сайта составляет 199 руб. в месяц. Подписка также позволяет в автоматическом режиме удалять/лечить обнаруженные вирусы.<br><h2>Вылечить сайт от вирусов</h2>Инструмент активируется в разделе панели управления «Антивирус и трафик». В отчёте напротив каждого заражённого файла появляется кнопка \"Вылечить\". После её нажатия запускается модуль лечения. Кроме того, есть возможность массового лечения: нужно отметить флажком каждый зараженный файл и нажать кнопку «Вылечить» в блоке массовых действий. Если вы уверены, что файл не заражён и срабатывание антивируса ложное, то вы можете исключить файл из числа проверяемых, нажав на кнопку \"Исключить\". <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/5d0f95c3480e59913f74278f0ecefdc4.png\"></p> <p>Почему нужно именно лечить файлы, а не удалять? В большинстве случаев файл не полностью является вирусом, а содержит вирусные вставки. Его удаление может нарушить работу сайта. Модуль лечения удалит только вредоносную часть файла, сохранив стабильную работу сайта.<br></p> <p>Если вы столкнётесь с угрозами, которые неизлечимы автоматически, их можно попробовать устранить вручную, сделав предварительно бэкап.</p> <h2>Антивирус Virusdie: отзывы, описание</h2> <p>Virusdie (Вирусдай) это облачный сервис, который автоматически выполняет проверку сайта на вирусы онлайн, находит вредоносные программы и помогает очистить от них сайт. Компания начала свою историю в 2012 г. и за это время превратилась в разработчика инструментов, которыми пользуются миллионы пользователей по всему миру.</p> <p>Вирусдай имеет многоуровневую защиту при работе с сайтами и серверами хостинга: это значит, что он представляет собой множество отдельных подсистем, имеющих свою архитектуру и систему безопасности.</p> <p>Взаимодействие с сервисом возможно благодаря:</p> <ul> <li>Вирусдай.Сервер (SDK).</li> <li>API лечения файлов.</li> <li>API внешней проверки.</li> </ul> <p>Все данные передаются в зашифрованном виде. Антивирус обнаруживает и автоматически очищает сайт от вирусов и разных видов заражений (шелы, редиректы, спамботы, трояны) в файлах PHP, JS, HTML, изображениях и системных файлах.</p> <p>Что должен делать владелец сайта, чтобы защититься от кибер-угроз: менять пароли, <a href=\"https://sweb.ru/journal/article/4-prichiny-sdelat-bekap-sayta/\" target=\"_blank\" rel=\"noopener noreferrer\">регулярно делать бэкапы</a>, своевременно обновлять CMS, их плагины, чаще проверять сайт на наличие вирусов. SpaceWeb предлагает <a href=\"https://sweb.ru\" target=\"_blank\" rel=\"noopener noreferrer\">хостинг сайтов</a> с автоматической проверкой на угрозы безопасности и позволяет уделять этому минимум времени и сил.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как узнать на каком хостинге находится сайт?",
          "link": "https://sweb.ru/journal/article/kak-uznat-na-kakom-hostinge-nahoditsya-sayt/",
          "turbo:topic": "Как узнать на каком хостинге находится сайт?",
          "turbo:source": "https://sweb.ru/journal/article/kak-uznat-na-kakom-hostinge-nahoditsya-sayt/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как узнать на каком хостинге находится сайт?</h1><figure><img src=\"https://s.sweb.ru/img/news/c35a98034e6fad17c82dda758b1d8569.jpg\"></figure><h2>Или инструкция «как определить хостинг сайта» без заумных терминов</h2></header><!--noindex--><p>В интернете вы найдете около 5 способов того, как узнать, где размещен сайт. Но эти варианты, кроме одного, могут либо не дать ответ на вопрос, либо дать неверный, что еще хуже. Единственный достоверный способ выяснить, на каком хостинге размещен сайт это определение хостинга по ip адресу сайта. А в конце статьи мы разобрали несколько других способов проверки хостинга сайта и расписали, почему не рекомендуем ими пользоваться.</p> <p>Впрочем, довольно лирики. Приступим уже к практике! Ниже пошаговая инструкция, в которой мы подробно расписали и рассмотрели на примере, как узнать, на каком хостинге сайт. </p> <h2>ДОСТОВЕРНЫЙ СПОСОБ УЗНАТЬ ХОСТИНГ САЙТА<br></h2> <p>Вариаций того, как определить хостинг сайта с помощью его IP-адреса, как вы догадываетесь, тоже несколько. Мы рассмотрели самый простой и удобный из них. Он позволит получить достоверный ответ на вопрос даже неискушенному интернет-пользователю.</p> <p><b>1. Открываем командную строку.</b> </p> <p>Возможно, звучит страшно, но мы вас уверяем — это максимально просто и займет буквально 5 минут. К тому же, командная строка — это обычный интерфейс для работы с компьютером, только текстовый. Такой же обычный, как, например, те же Word или Excel, но просто без красивого дизайна, а потому и текстовый. </p> <p>Итак, есть много способов запустить консоль (это другое название той же самой командной строки, только более короткое), но мы покажем только один —&nbsp; универсальный, который работает для всех версий операционных систем Window, Linux и Mac OS. </p> <p>Если на вашем компьютере установлена операционная система Windows, то для вызова консоли нажмите на клавиатуре одновременно клавишу с логотипом Windows и клавишу с латинской буквой R (при этом вообще не важно, латинская ли у вас раскладка на клавиатуре включена или кириллическая). Введите в открывшемся поле команду «cmd» и нажмите кнопку «OK».</p> <img src=\"https://s.sweb.ru/img/news/8c4fd1782ba420047e648735274792c2.jpg\" alt=\"Узнаем хостинг сайта\"> <p></p> <p>Если на вашем компьютере установлена операционная система Linux, то для вызова консоли нажмите на клавиатуре одновременно клавиши «Ctrl», «Alt» и клавишу с латинской буквой «T» (при этом вообще не важно, латинская ли у вас раскладка на клавиатуре включена или кириллическая). <br> </p> <p>Если на вашем компьютере установлена операционная система Mac OS, то для быстрого вызова консоли, которая в Mac OS носит название «Терминал», вам будет удобнее всего щелкнуть по иконке Spotlight в виде лупы (она находится в верхнем правом углу экрана), в строке поиска ввести слово «Терминал» и дважды кликнуть по иконке терминала, отобразившейся в результатах поиска напротив слова «Программы».</p> <p><b>2. По домену узнаем, какой IP-адрес у интересующего нас сайта.</b></p> <p>В открывшейся консоли пишем латинскими буквами слово «ping», потом ставим пробел и пишем домен того сайта, о котором хотим получить информацию. Затем нажимаем клавишу «Enter» на клавиатуре. В нашем случае мы для примера ввели домен «korablpurga.ru». </p> <img src=\"https://s.sweb.ru/img/news/35b500c32f8c87776bb387c2ad2e0937.jpg\" alt=\"Узнаем хостинг сайта\"> <br> <p></p> <p>После этого в консоли будет виден IP-адрес, на котором находится этот сайт. Все IP-адреса принадлежат каким-либо провайдерам. Так что теперь, зная, по какому IP-адресу находится сайт, остается лишь выяснить, какому провайдеру этот IP-адрес принадлежит. Так что копируем IP-адрес, состоящий из 10 цифр, разделенных точками, и переходим к последнему шагу. В нашем случае IP-адресом для сайта на домене korablpurga.ru является «77.222.61.113».</p> <img src=\"https://s.sweb.ru/img/news/1656e427f24336a4469185b08c67b16b.jpg\" alt=\"Узнаем хостинг сайта\"> <br> <p></p> <p><b>3. По IP-адресу узнаем, на каком хостинге сайт.</b></p> <p>Сервис, который позволяет определить, какому провайдеру принадлежит тот или иной IP-адрес, называется «whois-сервис». Не пугайтесь незнакомых слов: пользоваться этим сервисом сплошное удовольствие. Тем более что он совершенно бесплатен и не требует регистрации.</p> <p>Так что заходим на <a href=\"/whois/\" title=\"\" target=\"_blank\">наш сервис Whois</a>, вводим в поле «IP-адрес или домен» полученный на прошлом шаге IP-адрес и нажимаем кнопку «Проверить».</p> <img src=\"https://s.sweb.ru/img/news/0fe04048f6980ee810664a33803ddaeb.png\" alt=\"Whois cайта\"> <p></p> <p><b><br></b></p><p><b>В строке «Провайдер»</b> будет указано название компании, в которой размещен сайт.&nbsp;</p><p><img src=\"https://s.sweb.ru/img/news/0a5ea0fa7f95d624093692acfd0945c0.png\" alt=\"Whois cайта\"><br><b><span style=\"font-size: 16px;\">МЕНЕЕ ДОСТОВЕРНЫЕ СПОСОБЫ ОПРЕДЕЛЕНИЯ ХОСТИНГА САЙТА</span><br></b></p> <p>Неизвестно по какой причине в Интернете полно статей, авторы которых пытаются всеми силами придумать максимально возможное число способов нахождения хостинга сайта, даже не задумываясь о том, что они частенько не работают. Это тот самый случай, когда в погоне за количеством страдает качество.</p> <p>Как и обещали в начале нашей статьи, в этом разделе мы приведем в качестве примера несколько других способов, которыми не рекомендуем пользоваться из-за их недостоверности.</p> <ul class=\"stretch\"> <li><b>Узнать хостинг сайта по домену</b> <br> <p>Такой способ можно отнести к едва ли не самым популярным методом, описываемым на просторах Интернета. Его суть проста: в нем предлагается с помощью whois-сервиса узнать, DNS какого хостера используются для поддержания работоспособности домена интересующего нас сайта, а потом предположить, что для обеспечения работоспособности и самого сайта, наверное, используются мощности того же хостера. Правдивость получаемой таким образом информации о хостинге сайта, к сожалению, не велика.</p> <p>Все дело в том, что домен сайта и сам сайт могут располагаться у разных хостинг провайдеров, например, если владельцу ресурса нравится качество хостинга у одного хостера, а цены на продление доменов — у другого.</p> </li> <li><b>Узнать хостинг сайта по страницам 403 или 404 ошибок.</b> <br> <p>Этот способ определения хостинга рассчитан на то, что если владелец интересующего вас сайта не сделал для него собственные страницы ошибок веб-сервера, то при их вызове можно будет увидеть страницы ошибок хостинг-провайдера, идущие по умолчанию (если они у этого хостера, конечно, есть). Минус этого способа кроется в том, что часто небольшие хостинговые компании просто не имеют собственных страниц ошибок веб-сервера. А еще чаще случается так, что у сайта есть свои страницы ошибок или что при попытке открыть несуществующую страницу на сайте с CMS система просто скрывает страницу ошибки, предоставляемую этой CMS по умолчанию.</p> </li> </ul> <h2>МОЖНО ЛИ СКРЫТЬ ХОСТИНГ САЙТА</h2> <p>Можно. Конечно, можно. Если владелец сайта не захочет, чтобы кто-то знал, на каком хостинге находится его сайт, он примет для этого все возможные меры и определить хостинг такого сайта будет уже, увы, невозможно без обладания хороших технических знаний.</p> <p>К счастью, таких сайтов очень, очень мало. Поэтому вероятность, что вы окажитесь в тупиковой ситуации, крайне мала.</p> <p>Не будем в этой статье подробно рассматривать, как скрыть хостинг своего сайта, так как это уже совсем другая история, для рассмотрения которой потребуется целая статья, но все же о нескольких самых простых способах расскажем.</p> <p>Во-первых, для скрытия хостинга сайта можно воспользоваться каким-либо CDN-сервисом, который с помощью CDN-прокси, пропускающим через себя трафик, скроет настоящий IP-адрес сайта. Во вторых, можно взять сам хостинг у одного провайдера, а IP-адрес использовать другого провайдера. В-третьих, сайт можно разместить на выделенном сервере хостера со своей собственной подсетью IP-адресов и настроить BGP, который будет использоваться для маршрутизации своей собственной AS, установив предварительно BGP-peers. Одним словом, возможность скрыть хостинг есть всегда. Было бы желание : )</p> <h2>ДЛЯ ЧЕГО ЗНАТЬ, НА КАКОМ ХОСТИНГЕ РАЗМЕЩЕН САЙТ</h2> <p>Интересный факт, что причин на то хоть и может быть множество, в основном их всего лишь 4:</p> <p><b>1. Для того, чтобы пожаловаться на сайт.</b></p> <p>К сожалению, мир не идеален, и интернет не исключение. Все мы знаем, что в сети могут встречаться недобросовестные владельцы сайтов, занимающиеся, например, мошенничеством, рассылкой спама или другой незаконной деятельностью. В этом случае необходимость узнать, где размещен сайт, появляется для того, чтобы написать хостинг-провайдеру жалобу.</p> <p><b>2. Для того, чтобы перенести свой сайт на тот же хостинг.</b></p> <p>Бывает, что качество хостинга вашего сайта устраивает вас не до конца, в то время как один из известных вам сайтов, напротив, работает безо всяких нареканий — быстро и стабильно. В таком случае потребность узнать, где размещен определенный сайт, возникает для того, чтобы понять, куда именно лучше перенести ваш сайт.</p> <p><b>3. Для того, чтобы узнать хостинг собственного сайта</b></p> <p>Хоть это и может показаться странным, но как показывает практика это весьма распространенное явление. Компании достаточно часто поручают ведение своего сайта сторонним лицам, и когда перестают с ними работать, данные о хостинге теряются, а к тому времени, когда возникает необходимость продления домена или услуг хостинга, найти эти данные уже невозможно. Поэтому единственно верным решением в таком случае бывает просто узнать своего хостинг-провайдера.</p> <p><b>4. Пользователи хотят узнать, на каком хостинге размещен сайт, ради интереса.</b></p> <p>Любопытство, любопытство и еще раз любопытство! Некоторые из любопытства читают новости о жизни поп-звезд, а некоторые хотят знать все о сайте, который их интересует. На вкус и цвет, как говорится...</p> <!--/noindex--><img src=\"https://s.sweb.ru/img/onboardbnrs/c8c8340532e73ff0ba66258e5304efdb.png\" /><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Обзор zend расширения OPCache для PHP",
          "link": "https://sweb.ru/journal/article/obzor-zend-rasshireniya-opcache-dlya-php/",
          "turbo:topic": "Обзор zend расширения OPCache для PHP",
          "turbo:source": "https://sweb.ru/journal/article/obzor-zend-rasshireniya-opcache-dlya-php/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Обзор zend расширения OPCache для PHP</h1><figure><img src=\"https://s.sweb.ru/img/news/83f52e6daf53677b87c33e5c98b6a45b.png\"></figure><h2>Легкий способ увеличить скорость сайта</h2></header><ol style=\"width:100%;\"> <li><a href=\"#zend-opcache\">Zend OPcache Акселератор PHP</a></li> <li><a href=\"#why-opcache\">Преимущества использования</a></li> <li><a href=\"#opcache-wordpress\">Тестирование OPCache Wordpress, Joomla, Drupal</a></li> <li><a href=\"#bitrix-opcache\">OPCache 1C Bitrix</a></li> <li><a href=\"#umi-opcache\">OPCache UMI CMS</a></li> <li><a href=\"#hosting-opcache\">Включение zend Opcache на хостинге</a></li> </ol> <h2 id=\"zend-opcache\">Зачем нужен Opcache?</h2> <p>OPCache появился в 2013 году и с того момента стал оптимальным и рекомендуемым разработчиками PHP решением для кэширования опкодов. В классическом варианте алгоритм отдачи контента состоит из обращения к файлу, последующего открытия файла для чтения, после чего происходит компиляция и в конечном итоге отдача контента клиенту.&nbsp; </p> <p>При включении OPCache компиляцию из процесса можно исключить (кроме первичного обращения к файлу), это позволит увеличить быстродействие кода, т.к.&nbsp; при обработке любого скрипта компиляция является наиболее ресурсозатратным процессом.&nbsp; </p> <p>Сегодня развитие расширения PHP OPCache производится только в пределах версии PHP 7. </p> <h2 id=\"why-opcache\">Почему стоит включить OPCache?</h2> <p>Помимо обеспечения экономии ресурсов сервера и сокращения времени загрузки страниц сайта, включение OPCache дает ряд других значимых преимуществ: </p><ul> <li>Улучшение поведенческих факторов пользователей на сайте и сокращение числа отказов (когда посетитель сразу уходит с сайта, например, потому что он долго загружается). Посетители охотнее проводят время на сайтах с быстрым откликом;</li> <li>Google и Yandex отдают предпочтение сайтам с быстрой загрузкой страниц;</li> <li>Высокая скорость работы сайта увеличивает конверсию, что особенно актуально для интернет-магазинов.</li> </ul> <p></p> <h2 id=\"opcache-wordpress\">Как OPCache улучшает производительность на Wordpress, Joomla и Drupal?</h2><div><br></div> <div><img src=\"https://s.sweb.ru/img/news/fd5fbcd35021855d0f11ecd13a9ffd4d.png\" alt=\"OPCache обеспечивает повышение производительности сайтов на Wordpress, Joomla и Drupal\" align=\"none\"> <br> </div> <p>В ходе проведения исследования мы установили, что на среднестатистическом сайте использование OPCache улучшает скорость загрузки в несколько раз, при этом количество используемой памяти сокращается в 2-4 раза. Таким образом, простое включение расширения OPCache наглядно демонстрирует увеличение производительности на популярных CMS.</p> <h2 id=\"bitrix-opcache\">Как установка OPCache улучшает работу 1С Bitrix?</h2> <p>Ниже представлен сайт клиента, который длительное время не мог решить проблему с оптимизацией конфигурации своей системы. <br>Рассмотрим, какие показатели были у него до включения OPCache Битрикс.</p> <p><img src=\"https://s.sweb.ru/img/news/439bc7b24f6faa93271a0302026b4739.png\" alt=\"Пример работы opcache на сайте на 1С битрикс\" align=\"none\"> <br> </p> <p>Благодаря несложной <a href=\"https://help.sweb.ru/entry/868/\" title=\"\" target=\"_blank\">инструкции</a> включения расширения zend OPCache PHP, владельцу сайта удалось повысить оценку конфигурации системы и увеличить среднее время отклика в 6 раз. Еще один рекомендуемый инструмент улучшения производительности для владельцев проектов на Bitrix.</p><img src=\"https://s.sweb.ru/img/news/f163967b88a9e86e284a696797f66fe1.png\" alt=\"Ускорение bitrix с OPCache\" align=\"none\"> <br> <h2 id=\"umi-opcache\">Включение OPCache на UMI CMS</h2> <p>Рассмотрим, как включенный OPCache влияет на производительность umi cms. <br>В первом случае OPCache отключен и система показывает среднюю производительность.</p> <p><img src=\"https://s.sweb.ru/img/news/97e80f1b658ef8ffb589114449a107c7.png\" alt=\"Пример работы opcache на сайте на Umi CMS\" align=\"none\"> <br> </p> <p>После включения OPCache производительность системы увеличилась почти вдвое.</p> <p><img src=\"https://s.sweb.ru/img/news/9721212b9e57dc54240d49340c087da8.png\" alt=\"Ускорение UMI с OPCache \" align=\"none\"> <br> </p> <h2 id=\"hosting-opcache\">Включение и настройка OPCache на хостинге sweb</h2> <p>Установка и настройка OPCache не требует особых технических знаний.</p> <p>На тарифах \"<a href=\"https://sweb.ru/hosting/\" target=\"_blank\">стандартного виртуального хостинга</a>\" для включения OPCache перейдите в раздел «Настройка сайта» в панели управления, и во вкладке «Общие» выберите «Apache 2.2 + PHP 7.1 opcache». <br><b>Важно</b>: Перед выбором обязательно убедитесь в том, что ваш сайт совместим с этой версией PHP.</p> <p>На тарифах \"<a href=\"https://sweb.ru/reactive-hosting/\" target=\"_blank\">реактивного хостинга</a>\" OPCache включен начиная с версии PHP 5.5.</p> <p>Подробнее:&nbsp;<a href=\"https://help.sweb.ru/entry/868/\" target=\"_blank\">https://help.sweb.ru/entry/868/</a></p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "false",
          "title": "VPS с тестовым периодом",
          "link": "https://sweb.ru/journal/article/vps-s-testovym-periodom/",
          "turbo:topic": "VPS с тестовым периодом",
          "turbo:source": "https://sweb.ru/journal/article/vps-s-testovym-periodom/",
          "turbo:content": {
            "#cdata-section": " <header><h1>VPS с тестовым периодом</h1><figure><img src=\"https://s.sweb.ru/img/news/58cf5913de8ae8f98b35dcf2377f7f09.png\"></figure><h2></h2></header><p><b>Тестовый период на VPS</b> позволяет получить бесплатный доступ к VPS-сер ",
            "#cdata-section2": " веру на небольшой срок и на определенных условиях. Это может быть полезно если вы хотите:</p> <ul> <li>настроить свой проект на VPS и убедиться, что он корректно работает;</li> <li>проверить время отклика до сервера, скорость работы и мощность виртуальной машины;</li> <li>начать размещение проекта на VPS до фактического зачисления средств на баланс аккаунта (зачисление средств от юридических лиц происходит в среднем в течение 3 дней).</li> </ul> <p>В данном обзоре мы будем брать на тест <a href=\"https://sweb.ru/vds/\" target=\"_blank\" rel=\"noopener noreferrer\">VPS от хостинга SpaceWeb</a>, так как&nbsp;этот хостер позволяет оперативно получить доступ к VPS на 3 дня и на безвозмездной основе. После получения тестового периода мы проверим реальные показатели виртуальной машины с помощью серии тестов.</p> <h2>Как взять VPS на тестирование?</h2> <p>Переходим на официальный сайт хостинга SpaceWeb в раздел «<a href=\"https://sweb.ru/vds/\" target=\"_blank\">VDS</a>».</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/103fbf3d151c15ab4d1095418a4c7452.png\" alt=\"Как выбрать VPS для тестирования\"></p> <p>Внимательно отнеситесь к выбору тарифа для тестового периода. Если вы возьмете тариф «KVM-10» и впоследствии окажется, что ресурсов вам недостаточно, изменить тариф во время тестового&nbsp;периода вы не сможете. Рекомендуемый по ресурсам тариф, подходящий для большинства проектов и панелей управления VPS – «KVM-20».</p> <p>Нажимаем «Выбрать» справа от нужного тарифа, в новом окне указываем дистрибутив, который будет предустановлен на VPS и почту для регистрации.</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/f8a343fb5f0d897afaee615614bac2d2.png\" alt=\"Заказ VPS с тестовым периодом\"></p> <p>После регистрации нам будет предложено заполнить реквизиты аккаунта. Нажимаем на синюю кнопку «Заполнить реквизиты».</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/feee67ed83b12fc1028932e561f488af.png\" alt=\"Регистрация тарифа VPS\"></p> <p>Заполняем открывшуюся форму данными владельца аккаунта в соответствии с примерами в этой форме. Указывайте в форме номер телефона, к которому у вас есть доступ, иначе тестовый период активировать не получится. Отправляем форму и получаем возможность активировать тестовый период. Нажимаем «Подтвердить номер телефона» →&nbsp;«Выслать код».</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/416f743d8a4061a254a59cbf81ff1cf8.png\" alt=\"\"></p> <p>Вводим полученный на телефон код и подтверждаем. Ожидаем включение тестового периода.</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/d50c1a1b3928bd2948da41b582798e83.png\" alt=\"\"></p> <p>После активации тестового периода вам будут доступны основные разделы для управления услугой VPS, а именно:</p> <ul> <li>в разделе «Управление» можно включить/перезагрузить сервер и посмотреть краткую информацию по услуге;</li> <li>в разделе «Резервные копии» можно вручную создать бэкап или настроить создание резервных копий по расписанию;</li> <li>в разделе «VNC» можно посмотреть, что происходит на мониторе вашего VPS-сервера или управлять VPS с помощью команд;</li> <li>в разделе «Статистика и логи» вы можете посмотреть графики нагрузки на сервер;</li> <li>в разделе «IP-адреса» находятся ваши выделенные IP-адреса.</li> </ul> <p>Также вам доступны общие разделы: «Домены», «SSL-сертификаты», «Поддержка», «SEO и Реклама». Для запуска сайта на VPS вы можете установить одну из бесплатных панелей управления, например, Brainy или Vesta. Вся полезная информация по услуге VPS собрана в разделе «<a href=\"https://help.sweb.ru/\" target=\"_blank\">Помощь</a>».</p> <h2>Как протестировать VPS?</h2> <p>Выполним серию классических тестов для проверки показателей виртуальной машины, а после сравним их с результатами других хостинг-провайдеров. Для этого необходимо <em>подключиться к консоли</em> вашего VPS.</p> <p><b>Предупреждение!</b> Рекомендуем выполнять тесты на чистом VPS без размещенных проектов.</p> <p>Первый тест производительности проведем с помощью утилиты UnixBench. Это набор тестов, которые сопоставляют скорость выполнения кода на виртуальной машине с производительностью эталонной системы. На основе сравнения выставляется балл, определяющий производительность.</p> <p>В данной статье на VPS с дистрибутивом Ubuntu мы будем использовать следующую последовательность команд:</p> <p><code>wget https://github.com/teddysun/across/raw/master/unixbench.sh <br> chmod +x unixbench.sh<br> ./unixbench.sh</code></p> <p>После ввода команд запустится соответствующий тест.</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/7dedc89e9c14a2c806ff21c4241b5a25.png\" alt=\"Тестирование VPS\"></p> <p>После завершения теста проверьте показатель UnixBench в последней строке отчета в консоли.</p> <p>Для независимой оценки полученных в этом тесте показателей мы обратились к мониторингу vps-провайдеров и на момент написания статьи VPS от Spaceweb оказался на 4 месте по показателю UnixBench среди сотни других. При этом имеем незначительный отрыв от лидеров мониторинга в 2-3%.</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/0ee2c36168200b249d45257788bc72df.png\" alt=\"Результат тестирования VPS\"></p> <p>Проведем еще один тест с помощью shell-скрипта nench, который позволяет получить данные о производительности процессора, задержке ввода-вывода диска в режиме реального времени, скорости доступа к серверу.</p> <p><code>(wget -qO- wget.racing/nench.sh | bash; wget -qO- wget.racing/nench.sh | bash) 2>&1 | tee nench.log</code></p> <p>После выполнения команды получим соответствующий отчет в окне консоли.</p> <p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/96c2338d2409ddc24f955464e5fe0631.png\" alt=\"Проводим тестирование VDS\"></p> <p>Мы провели этот тест несколько раз на всех тарифах VPS и загрузили данные на специальный сервис, чтобы сравнить результаты с другими хостинг-провайдерами.</p> <p>Зеленым выделены хорошие показатели относительно цены и других хостинг-провайдеров. Остальные показатели в норме и схожи с другими. Низких показателей, выделенных курсивом, в таблице нет.</p><img style=\"max-width: 600px;\" src=\"https://s.sweb.ru/img/news/c48e5c41b8421492ba438f1f205f83d4.png\"><br> <p>Как видно исходя из результатов 2-х популярных тестов, виртуальные машины от хостинга SpaceWeb являются одними из самых производительных среди сотни других VPS-провайдеров.</p> <p>Есть ряд и других разнообразных тестов производительности, которые вы можете самостоятельно запустить на виртуальной машине: DD CPU, SYSBENCH MYSQL, DD I/O, SYSBENCH I/O, SYSBENCH CPU.</p> <p>Отдельными тестами после размещения проекта можно проверить производительность систем Битрикс, Wordpress, а также замерить время соединения с сервером и ожидание отклика от него. Подробнее об этом мы расскажем в следующих обзорах.</p> <h2>Ограничения на тестовом периоде VPS</h2> <p>Также важно рассказать об ограничениях на тестовом периоде VPS.</p> <p><b>Текущие ограничения:</b></p> <ul> <li>получить тестовый период на VPS c ISPmanager Lite не получится. Панель управления ISPmanager Lite – коммерческое программное обеспечение, которое предоставляется хостинг-провайдеру на возмездной основе. Хостинг-провайдер готов предоставить вам тестовый период только на свои услуги;</li> <li>во время тестового периода отключен протокол SMTP. Отключение протокола сразу отсекает спамеров. Для добропорядочных пользователей это ограничение не доставит серьезных проблем;</li> <li>ограничена пропускная способность канала до 10 Мбит. Незначительное ограничение, которое в большинстве случае не нужно для теста проекта. Ограничение связано с защитой от недобросовестных клиентов, использующих VPS в цепочке своего ботнета для DDoS-атак.</li> </ul> <p>Как мы с вами видим, ограничения незначительны&nbsp;и <a href=\"https://sweb.ru/web/testvps/\" target=\"_blank\">тестовый период на VPS</a> от хостинга SpaceWeb подойдет для размещения подавляющего большинства проектов в интернете. Будем рады видеть вас в рядах клиентов хостинга SpaceWeb!</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "false",
          "title": "Что такое VPS и VDS сервер",
          "link": "https://sweb.ru/journal/article/chto-takoe-vps-i-vds-server/",
          "turbo:topic": "Что такое VPS и VDS сервер",
          "turbo:source": "https://sweb.ru/journal/article/chto-takoe-vps-i-vds-server/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Что такое VPS и VDS сервер</h1><figure><img src=\"https://s.sweb.ru/img/news/9ea0d4bd97acda1c89e79818a944bb28.jpg\"></figure><h2>Простыми словами о виртуальном выделенном сервере</h2></header><p>Владельцы порталов, сервисов и приложений регулярно задумываются об увеличении ресурсов сервера. В этом плане следующей ступенью масштабирования для ряда проектов становится перенос сайта с услуги хостинга на VPS — виртуальный частный сервер (<span>англ. Virtual Private Server)</span>. Эта услуга также часто называется VDS — виртуальный выделенный сервер&nbsp;<span>(англ. Virtual Dedicated Server)</span>. Это два названия одной и той же услуги.</p> <h2>Что такое VPS/VDS простыми словами?</h2> <p>Представьте себе мощный сервер, начинка которого (процессор, оперативная память, постоянная память и т.д.) собрана по последнему писку технической моды и обладающий огромными вычислительными мощностями.</p> <p>Теперь представьте, что есть специальная технология виртуализации, позволяющая в рамках этого мощного сервера создать несколько виртуальных машин (мини-серверов), каждая из которых будет обладать собственной операционной системой и количеством ресурсов.</p> <p>В нашем случае каждая виртуальная машина и есть услуга VPS.</p> <h2>В чем основная разница между стандартным хостингом и VPS?</h2> <p><img src=\"https://s.sweb.ru/img/news/3c60bff599134c7caaac94638115bc2e.png\"></p> <p>На сервере стандартного хостинга больше клиентов и по умному алгоритму между ними распределяются все ресурсы сервера. В этом плане клиенты хостинга зависят друг от друга (от того, кто сколько ресурсов потребляет).</p> <p>В случае с VPS вы получаете выделенную виртуальную машину с фиксированным&nbsp;количеством ресурсов, которая находится вне зависимости от других владельцев vps/vds на сервере.</p> <p>Иными словами, ресурсов на VPS&nbsp;у вас будет больше. Производительность, скорость и работоспособность на протяжении времени будет стабильнее, так как на виртуальном сервере вы будете один.</p> <p>Исходя из этого, на выделенном виртуальном сервере у вас нет никаких ограничений на количество сайтов, доменов, баз данных, почтовых адресов и т.д.</p> <p>Также на vps администратору&nbsp;предоставляется полная свобода действий, от выбора дистрибутива и программного обеспечения до точечных конфигурационных настроек сервера и ПО. Например, вы можете установить последние версии php и mysql, выбрать стек (набор) технологий (LAMP, LEMP).</p> <h2>Основные характеристики VPS от SpaceWeb</h2> <p>У нас предусмотрено несколько <a href=\"https://sweb.ru/vds/\" target=\"_blank\" rel=\"noopener noreferrer\">тарифов для аренды VPS</a>.</p> <p>Для начала разделим характеристики услуги VPS на 2 группы. В группу №1 поместим характеристики услуги, которые не зависят от тарифного плана. В группу №2 поместим характеристики, которые меняются в зависимости от тарифного плана.</p> <p><em>К первой группе характеристик относятся:</em></p> <ul> <li><b>Технология виртуализации – KVM</b><br> Если вы не являетесь опытным пользователем <span>VPS</span>, то данная технология вам ни о чем не скажет. Постараемся объяснить просто и кратко. <br> Технология виртуализация нужна для того, чтобы в рамках одного мощного сервера организовать работу нескольких виртуальных машин (VPS), каждая из которых имеет свою операционную систему и количество выделенных ресурсов. <br> Среди хостинг-провайдеров для услуги <span>VPS&nbsp;</span>наиболее популярными технологиями виртуализации являются KVM и XEN. Ранее SpaceWeb использовал XEN, однако проводимые нами исследования и запросы клиентов подтолкнули нас на переход к технологии KVM. Узнать о преимуществах KVM вы можете в разделе \"<a href=\"https://help.sweb.ru/entry/162/\">Помощь</a>\".</li> <li><b>Пропускная способность</b> <br> На серверах SpaceWeb общая пропускная способность до 20 Гб/сек, конкретно 1Гб на порт. В этом плане на услуге <span>VPS&nbsp;</span>стабильные каналы связи, способные принять больше трафика и обработать большее количество запросов для сайтов на <span>VPS&nbsp;</span>, так как клиентов на всем сервере под <span>VPS&nbsp;</span>значительно меньше, чем на сервере стандартного виртуального хостинга.</li> <li><b>Бесплатная защита от DDoS</b><br> Для всех клиентов <span>VPS&nbsp;</span>на SpaceWeb автоматически и <strong>бесплатно</strong> подключается круглосуточная комплексная защита от DDoS-атак. Комплекс Arbor Peakflow предназначен для крупных провайдеров и развернут у более 70% ведущих мировых операторов, например МТС, Акадо, Ростелеком и многие другие. Комплекс способен оказать защиту от атак мощностью до 5 Тбит/с на границе сети и до 180 Гбит/с на уровне приложений.</li> <li><b>Скоростные NVMe SSD-диски</b><br> NVMe SSD-диски – передовое решение для обеспечения быстрой записи и чтения данных (файлов, скриптов, картинок сайта) с диска. Результаты тестирования дисков SATA SSD и NVMe SSD показывают, что производительность и скорость дисков NVMe в несколько раз лучше дисков SATA SSD. <br><img style=\"margin: 15px; max-width: 800px;\" src=\"https://s.sweb.ru/img/news/7fa53a17b5f1ea65ccdafbb74e9575e8.jpg\"></li> <li><b> Панель управления услугой VPS</b><br> В личном кабинете vps от хостинга spaceweb вам доступен ряд новых функций. <br> Раздел «Управление» – вкл/выкл vps, перезагрузить, данные по vps. <br> Резервные копии – сделать ручной бэкап или настроить расписание резервирования. <br> VNC Консоль – окно управления сервером с помощью ssh-команд. <br> Статистика по нагрузке и логи сервера. <br> Подключить дополнительные ip-адреса. <br><img style=\"margin: 15px;\" src=\"https://s.sweb.ru/img/news/7e0495dd1accd88f6b5c38f45b72c1a2.png\"></li> <li><b>Дополнительно</b> <br> Вне зависимости от тарифного плана вы бесплатно получаете 2 IP-адреса (IPv4 + IPv6), 3 резервных копии, неограниченный трафик и круглосуточную техническую поддержку, а также возможность установки популярных дистрибутивов Ubuntu, Centos, Debian, BitrixVM.</li> </ul> <p><em>Ко второй группе характеристик относятся:</em><br> <b>CPU</b> – в зависимости от тарифа вам доступно от 2 до 8 ядер на vps. <br> <b>RAM</b> – в зависимости от тарифа вам доступно от 1024 до 8192 Гб оперативной памяти. <br> <b>Диск</b> – в зависимости от тарифа вам доступно от 10 до 80 Гб дискового пространства. </p> <h2>Как выбрать VPS от SpaceWeb?</h2> <p>В недавнем опросе в нашей <a href=\"https://vk.com/spaceweb_ru\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">группе ВКонтакте</a> мы получили неоднозначный ответ на вопрос «Какой тариф оптимален для вашего сайта?»</p> <p><img style=\"margin: 15px; max-width: 500px;\" src=\"https://s.sweb.ru/img/news/84fd7b6b87f134be282130b5ed0532a4.png\"></p> <p>По большей&nbsp;части это связано с тем, что многие наши клиенты держат крупные приложения и порталы на VPS/VDS серверах, а потому им недостаточно минимального тарифного плана.</p> <h2>Сколько ресурсов нужно вам или как выбрать VPS?</h2> <p>В случае если сайта у вас нет или вы только планируете его создать, то вы можете зарегистрироваться на минимальном тарифном плане «<strong>KVM-10</strong>». При работе с VPS вам будут доступны данные по нагрузке на сервер. Если нагрузка на сервер будет максимальной, вы сможете в любой момент увидеть, каких ресурсов вам не хватает и перейти на другой тариф из панели управления.</p> <p>Если сайт у вас есть и это не простой лендинг или авторский блог на wordpress, то рекомендуем зарегистрироваться на тарифе «<strong>KVM-20</strong>». Укажите номер телефона и для вас включится тестовый период на 3 дня. Этого времени достаточно, чтобы перенести действующий сайт или его резервную версию для проверки работоспособности и потребления ресурсов сервера. По графику нагрузки вы сможете понять, стоит ли вам улучшить свой тарифный план.</p> <h2>Как управлять VPS?</h2> <p>Для управления <span>VPS&nbsp;</span>опытные пользователи используют связку из консольного управления по протоколу SSH (некий аналог работы по ftp, только с помощью ввода команд) и удобную панель управления для <span>VPS&nbsp;</span>(аналог панели управления хостингом).</p> <p>Для новичка достаточно при заказе выбрать панель управления ISPmanager Lite и тогда, возможно, управление с помощью ssh не потребуется. У вас будет удобная панель управления со всеми необходимыми возможностями.</p> <p>Если вы собираетесь самостоятельно ставить другую панель управления (Brainy, Vesta), обязательно обратите внимание на то, какие требования предъявляет разработчик к VPS серверу. Например, для установки панели управления Brainy требуются следующие параметры:</p> <p><img style=\"margin: 15px; max-width: 300px;\" src=\"https://s.sweb.ru/img/news/94d9e4ae87af644056de66237aede104.png\"></p> <p>&nbsp;</p> <p>А значит, для комфортной работы с панелью Brainy рекомендуется тарифный план «<strong>KVM-20</strong>» и выше.</p> <h3>Заключение</h3> <p>Если вы действительно планируете развивать свой проект в будущем, и это далеко не мелкий сайт или блог, то переход с услуги хостинга вам не избежать. Услуга VPS станет для вас глотком свежего воздуха, если вы хотите:</p> <ul> <li>Развивать и масштабировать проект</li> <li>Обслуживать сайт на самых свежих версиях программного обеспечения</li> <li>Быть независимым от других клиентов хостинга и иметь полную свободу действий.</li> </ul> <p> В ближайшее время мы подготовим для вас ряд обучающих статей и видеообзоров по данной услуге. Сейчас вы можете получить тестовый период в течение 3 дней и попробовать изучить услугу самостоятельно.</p> <h4>Полезные ссылки:</h4><p> <a href=\"https://help.sweb.ru/entry/1039/\">ТЕСТОВЫЙ ПЕРИОД</a><br><a href=\"https://help.sweb.ru/entry/161/\">ПЕРЕНОС АККАУНТА НА VDS</a><br><a href=\"https://help.sweb.ru/entry/752/\">ПЕРЕНОС НА VDS С ISP-MANAGER</a><br><a href=\"https://help.sweb.ru/entry/878/\">ПЕРЕНОС НА VDS C BRAINYCP</a><br><a href=\"https://help.sweb.ru/entry/879/\">ПЕРЕНОС НА VDS С VESTACP </a></p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как выбрать хостинг для сайта?",
          "link": "https://sweb.ru/journal/article/kak-vybrat-hosting-dlya-sayta/",
          "turbo:topic": "Как выбрать хостинг для сайта?",
          "turbo:source": "https://sweb.ru/journal/article/kak-vybrat-hosting-dlya-sayta/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как выбрать хостинг для сайта?</h1><figure><img src=\"https://s.sweb.ru/img/news/2a9a455274df1ed40ea21d7f8ee96d64.jpg\"></figure><h2></h2></header><p>Выбор хостинга для сайта - один из важнейших этапов при создании сайта. Обычно под хостингом сайтов понимается <a href=\"/hosting/?utm_source=site&utm_medium=article&utm_campaign=bj&utm_term=kak_vybrat_hosting\" target=\"_blank\">виртуальный хостинг</a>, именно на нём работает большинство существующих сайтов. От правильного выбора хостинга зависит успешность работы всего сайта: и посещаемость, и скорость загрузки страниц, и позиция сайта в поисковиках, и много чего ещё.</p> <p>В этой статье мы рассмотрим виды хостинга сайтов, разберёмся, в чём их основные преимущества и недостатки, а также предоставим общие рекомендации по выбору хостинга.</p> <h2>Какой хостинг выбрать – платный или бесплатный?</h2> <p>Если выбирать между платным и бесплатным хостингом только с точки зрения капиталовложения, то бесплатный хостинг может и лучше. На этом его достоинства и заканчиваются. Как известно, бесплатный сыр бывает только в мышеловке. Бесплатный хостинг должен на что-то существовать, и поэтому бесплатен лишь условно - своеобразной платой за эти услуги обычно является размещение чужой надоедливой рекламы на страницах вашего сайта.</p> <p>К прочим недостаткам бесплатного хостинга можно отнести: плохую выдачу размещаемых сайтов поисковыми системами, медленную работу серверов, маленькое дисковое пространство под сайт, ограничение размера файлов, отсутствие многих других функций, присущих полноценному хостингу. Всё это ставит под угрозу развитие сайта, а его перенос на другой хостинг зачастую равносилен созданию сайта заново с нуля. Кроме того, если сайт на бесплатном хостинге чем-то не понравится администраторам, его могут и вовсе удалить без предупреждения. Также бесплатные хостинги&nbsp;могут попросту закрыться, вместе с вашим сайтом.</p> <p>Платный хостинг лишён всех недостатков бесплатного хостинга и предоставляет пользователю несравнимо большее количество и качество услуг. Единственный минус платного хостинга – за него надо платить. Однако, в условиях жёсткой конкуренции между хостинг-компаниями ваши затраты на полноценный хостинг для сайта скорее всего не превысят 250 руб. в месяц. При этом вы получите поддержку современных веб-технологий (MySQL, PHP, Perl, SSI, SSL, FTP, SSH), стабильную и быструю работу серверов, благосклонное отношение поисковиков к вашему сайту, заинтересованную в вас службу поддержки и многое другое. А затраты при желании можно с лихвой окупить партнерскими программами.</p> <p>Таким образом, платный хостинг является единственным разумным выбором при серьёзном подходе к созданию сайта. А иначе, зачем вообще тратить своё время?</p> <h2>На что следует обратить внимание при выборе платного хостинга?</h2> <p>Теперь подробнее о тех услугах, на которые следует обратить внимание при выборе хорошего платного хостинга:</p> <p><strong>Бесплатный тестовый период</strong>. Позволяет заранее опробовать возможности хостинга и решить, подходит ли он вам. Такую возможность обычно предлагают крупные хостинг-компании, уверенные в качестве своих услуг.</p> <p><strong>Круглосуточная техническая поддержка</strong>. При выборе хостинга имеет смысл задать техподдержке несколько вопросов для оценки скорости реагирования. Если долго не отвечают, значит, и к возможным проблемам будут относиться так же равнодушно.</p> <p><strong>Автоматическая установка систем управления сайтом</strong> (их ещё называют приложениями, CMS или движками). Позволяет, устанавливать CMS в 2-3 щелчка мышью из панели управления, не вдаваясь в технические подробности. Можно и самостоятельно установить нужную CMS или загрузить уже созданный ранее сайт, однако для этого потребуются некоторые навыки. Поэтому автоустановка особенно важна для начинающих веб-мастеров.</p> <p><strong>Простая и понятная панель управления</strong> — нужна для управления услугами хостинга. Если бесплатный тестовый период не предоставляется, то, скорее всего, оценить её функциональность получится только после оплаты хостинга.</p> <p><strong>Автоматическое регулярное резервное копирование бэкап</strong>. Позволит легко восстановить сайт, в случае необходимости. <a href=\"/journal/article/4-prichiny-sdelat-bekap-sayta/\">Зачем делать бэкап сайта?</a></p> <p><strong>Неограниченный трафик</strong>. Означает, что вам ни при каких обстоятельствах не придётся платить за трафик (объём информации, передаваемой между сервером и посетителями сайта).</p> <p><strong>Размер дискового пространства для сайта</strong>. Должен быть достаточен для размещения ваших сайтов&nbsp;и обычно зависит от тарифа. Большинству сайтов достаточно от 100 Мб до 1 Гб. Есть, разумеется, и очень маленькие сайты с небольшим количеством страниц и изображений с миниатюрной CMS или вообще без неё, занимающие менее 1 Мб.</p> <p><strong>Количество сайтов</strong>&nbsp;и почтовых ящиков на одном аккаунте. Обычно зависит от выбранного тарифа. Рекомендуем&nbsp;выбирать с&nbsp;небольшим запасом.</p> <p><strong>Количество баз данных MySQL</strong>. Обычно зависит от тарифа. MySQL нужна для работы многих CMS, разумеется, есть CMS работающие и без неё.<br><br><strong>Поддержка PHP, Perl </strong>или других необходимых для CMS языков программирования. Стоит&nbsp;обратить внимание на актуальность используемых версий языков, а также&nbsp;поддержку более старых версий.<br><br><strong>Доступ по протоколу FTP (SFTP, SSH)</strong>. Позволяет легко закачать файлы сайта на хостинг, или при необходимости скачать их оттуда.<br><br><strong>Цены на регистрацию и продление доменных имён</strong>. Изредка встречающаяся практика у неблагонадежных хостеров —&nbsp;домен&nbsp;предоставляется бесплатно, но регистрируется он на компанию хостинга. Ваш домен должен оформляться на ваши паспортные данные или на организацию.</p> <h2>Какой платный хостинг лучше выбрать?</h2> <p>Рекомендуем выбрать <a href=\"/?utm_source=site&utm_medium=article&utm_campaign=bj&utm_term=kak_vybrat_hosting\" target=\"_blank\">хостинг для сайта SpaceWeb</a>, который по всем вышеописанным параметрам соответствует званию лучшего хостинга. Стоимость тарифа для одного сайта с бесплатным доменом и SSL-сертификатом начинается от 49 рублей в месяц, что является одной из самых низких цен на рынке! Переходите по ссылке и протестируйте хостинг бесплатно в течение 14 дней.</p><p>А чтобы вы могли удобно выбрать хостинг в зависимости от ваших требований, мы подготовили таблицу со&nbsp;<a href=\"/how-to-choose-hosting/?utm_source=site&utm_medium=article&utm_campaign=bj&utm_term=kak_vybrat_hosting\" target=\"_blank\" title=\"Сравнение типов хостинга\">сравнением типов хостинга</a> SpaceWeb.</p><img src=\"https://s.sweb.ru/img/onboardbnrs/c8c8340532e73ff0ba66258e5304efdb.png\" /><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "MySQL 5.7 — нововведения",
          "link": "https://sweb.ru/journal/article/mysql-57--novovvedeniya/",
          "turbo:topic": "MySQL 5.7 — нововведения",
          "turbo:source": "https://sweb.ru/journal/article/mysql-57--novovvedeniya/",
          "turbo:content": {
            "#cdata-section": " <header><h1>MySQL 5.7 — нововведения</h1><figure><img src=\"https://s.sweb.ru/img/news/e6c08ab3f3ea5fe71c330f1951d88bfc.jpg\"></figure><h2>Обзор изменений и улучшений в БД</h2></header><p>Мы изучили презентации, заявления и выступления ведущих специалистов компании Oracle, участвовавших в разработке и тестировании продукта, и решили поделиться с вами полученными результатами.&nbsp;В версии MySQL 5.7 проделана значительная работа по улучшению производительности и масштабируемости системы для высоконагруженных проектов. Управление системой стало проще и безопаснее. Добавлены новые возможности, благодаря которым вы сможете работать с базами данных на совершенно ином уровне!<br></p> <p><b>Основные улучшения:</b></p> <ul> <li>В 2 раза быстрее MySQL 5.6</li> <li>Улучшенный InnoDB</li> <li>Улучшена репликация</li> <li>Новая модель стоимостного оптимизатора. Улучшена производительность запросов.</li> <li>Улучшение схемы производительности</li> <li>MySQL SYS Schema</li> <li>Повышенный уровень безопасности</li> <li>Поддержка JSON</li> </ul> <p>&nbsp;</p> <h2>Показатели производительности MySQL 5.7 vs MySQL 5.6</h2> <p>Выжимка из презентации продуктового менеджера Oracle Мэтта Лорда, посвященной выходу версии MySQL 5.7 и презентации разработчика MySQL Алексей Копытова на DevConf. На рисунке ниже команда Oracle провела тест производительности систем 5.5, 5.6 и 5.7 с помощью утилиты sysbench на read-only нагрузках. В&nbsp; результате теста MySQL версии 5.7 показал в несколько раз большую производительность, чем его предшественники.&nbsp;</p> <p><img src=\"https://s.sweb.ru/img/news/d47a84814b34c6efcf9e74cd4c3a7e24.png\" width=\"699\" height=\"461\"></p> <p>&nbsp;</p> <p>Также была выполнена оптимизация скорости соединения. В версии 5.7 скорость создания соединения в сравнении с версией 5.6 стала значительно быстрее, в особенности, при большом количестве клиентов.</p> <p><img src=\"https://s.sweb.ru/img/news/d74c1c476f90af222b86333b03d88ea7.png\" width=\"700\" height=\"462\"></p> <p>&nbsp;</p> <p>Одним из основных направлений по улучшению в версии 5.7 была оптимизация в работе движка InnoDB. На графике ниже вы можете наблюдать результат сделанных улучшений на примере связки InnoDB и Memcached плагина.</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/b05a7a5656402bb22575d6a6dfc86296.png\" width=\"700\" height=\"460\"></p> <p>&nbsp;</p> <p>В несколько раз выросло и количество соединений в секунду, которое способен обрабатывать MySQL.&nbsp;</p> <p>&nbsp;<img src=\"https://s.sweb.ru/img/news/4701b64f56f120f70e4492ed03fbb4df.png\" width=\"700\" height=\"448\"></p> <p>&nbsp;</p> <h2>Новые возможности в MySQL 5.7</h2> <p>Ниже приведена выжимка основных улучшений от представителей Oracle, из официального письма Geir Høydalsvik - старшего директора по разработке MySQL и выступления разработчика MySQL Дмитрия Ленева на DevConf 2016</p> <p><strong>Добавление поддержки JSON в MySQL</strong></p> <p>Благодаря недавно добавленной поддержке JSON в MySQL теперь вы можете сочетать гибкость NoSQL с мощью реляционной базы данных.</p> <p>Оптимизированный бинарный формат позволяет серверу эффективно хранить, извлекать и искать данные JSON. Это расширяет возможности CREATE TABLE и ALTER TABLE, чтобы они могли создавать столбцы JSON, и расширяет функцию Field, разрешая INSERT и SELECT из полей с типом JSON.</p> <p>&nbsp;</p> <p><strong>Преимущества столбцов JSON</strong></p> <ul> <li>Улучшенный бинарный формат хранения (быстрый доступ по ключам и к элементам массивов)</li> <li>Оптимизирован для чтения</li> <li>Кодировка Utf8mb4</li> <li>Валидация JSON при вставке</li> <li>Поддержка JSON элементов, таких как числа, строки, объекты, массивы.</li> </ul> <p>&nbsp;</p> <p><strong>Набор встроенных функций для взаимодействий с JSON</strong></p> <p>Позволяет пользователям создавать значения данных JSON из других реляционных данных, извлекать реляционные данные из значений данных JSON, анализировать структуру значений и текста JSON (валидность, длина, глубина, ключи), выполнять поиск внутри данных JSON и управлять ими.</p> <ul> <li>JSON_EXTRACT()/оператор ->, JSON_SEARCH(), JSON_CONTAINS(),....</li> <li>JSON_SET(), JSON_INSERT(), JSON_REMOVE(),....</li> <li>JSON_VALID(), JSON_LENGHT(), JSON_DEPTH(),...</li> <li>JSON_ARRAY(), JSON_OBJECT()</li> <li>JSON_QUOTE(), JSON_UNQUOTE()</li> </ul> <p>&nbsp;</p> <p>Доступен компаратор для сравнения в SQL запросах, аналогичный компаратору DATE / TIME / DATETIME, который позволяет сравнивать скаляры JSON с константами SQL и скаляры JSON с скалярами JSON. Компаратор полагается на поддержку DOM. Компаратор преобразует константу SQL в скаляр JSON, а затем сравнивает значения.</p> <p>&nbsp;</p> <p><strong>Упорядочивание скалярных значений JSON</strong></p> <p>Функция создает ключи сортировки, которые необходимы внутренней функции файловой сортировки для правильной сортировки значений JSON. При упорядочивании скалярных значений JSON с помощью ORDER BY они будут возвращены в порядке, определенном компаратором JSON.</p> <p>&nbsp;</p> <p><strong>Анализатор выражений для сгенерированных столбцов.</strong></p> <p>Позволяет оптимизаторам находить возможности для использования любых индексов, определенных для сгенерированных столбцов. Один из предполагаемых вариантов использования этой функции - создание и автоматическое использование индексов для документов JSON.</p> <p>&nbsp;</p> <p><strong>Генерируемые столбцы</strong></p> <p>В операторах CREATE TABLE и ALTER TABLE доступна поддержка спецификации генерируемых столбцов. Из выражения, указанного при создании столбца вычисляются значения сгенерированного столбца.</p> <p>Cтолбцы могут быть VIRTUAL (вычисление при чтении строк) или STORED (вычисление при вставке или обновлении строк), при этом индексы вы можете создать для обоих типов. Анализируя выражения, оптимизатор, кстати,&nbsp; старается использовать наилучший «функциональный» индекс.</p> <p>&nbsp;</p> <p><b>Генерируемые столбцы: STORED vs VIRTUAL</b></p> <p><strong>STORED</strong><br>→ Может быть PRIMARY KEY<br><span>→</span>&nbsp;BTREE, FULLTEXT, GIS <br> <span>→</span>&nbsp;Добавление колонки требует перестроения таблицы и блокирует обновления<br><span>→</span>&nbsp;Добавление индекса in-place/не блокирует обновления <br> <br> <strong>VIRTUAL</strong><br><span>→</span>&nbsp;Не может быть PRIMARY KEY <br> <span>→</span>&nbsp;Только BTREE <br> <span>→</span>&nbsp;Добавление колонки мгновенно <br><span>→</span>&nbsp;Добавление индекса in-place/не блокирует обновления</p> <p>&nbsp;</p> <p><strong>Улучшения при выполнении запросов и в оптимизаторе.</strong></p> <p>Функция оценки затрат расширяет модель стоимостного оптимизатора, позволяет использовать оценки механизмов хранения: сколько строк и индексов таблицы присутствует в памяти. Оптимизатор использует различные константы затрат для расчета стоимости доступа к данным, которые находятся в памяти, и данным, которые необходимо прочитать с диска. В первоначальной реализации эти две константы стоимости имеют одинаковое значение по умолчанию, но могут быть изменены администратором сервера, чтобы оптимизатор использовал разные затраты на данные в буфере памяти и данные, необходимые для чтения с диска. Обратите внимание, что в настоящее время оценки того, находятся ли данные в памяти или их необходимо прочитать с диска, основываются только на эвристике. Точность этих оценок будет значительно улучшена, если поддержка этих оценок будет реализована отдельными механизмами хранения.</p> <p>&nbsp;</p> <p><strong>Другие оптимизации:</strong></p> <ul> <li>Более умный учет условий при выборе порядка таблиц в join;</li> <li>Подзапросы из FROM обрабатываются как view;</li> <li>UNION ALL не требует временных таблиц;</li> <li>Полностью cost-based выбор индекса для ORDER BY ... LIMIT N;</li> <li>Более оптимальное использование sort-buffer для несортируемых полей.</li> </ul> <p>&nbsp;</p> <p><strong>X plugin</strong></p> <p>Добавляет возможность оптимизации базы данных за счёт обновлённого протокола связи с веб-сервером, который способен производить асинхронные запросы. Также доступна новая утилита для более эффективной работы с веб-сервером и новый NoSQL API, который делает акцент на JSON, CRUD, а также document store.</p> <p>EXPLAIN FOR CONNECTION <br> • Улучшения в EXPLAIN JSON (общая стоимость, по таблицам, кол-во обработанных данных) <br> • Улучшен режим ONLY_FULL_GROUP_BY и включен по умолчанию <br> • IN поддерживает кортежи [выражения вида («a», «b»)] <br><br> Новый механизм подсказок оптимизатору /*+ … */: <br> – MAX_EXECUTION_TIME, BKA, MRR, ICP, <br> NO_RANGE_OPTIMIZATION,SEMIJOIN, SUBQUERY <br> Query Rewrite Plugin <br><br> Работает после обработки парсером перед оптимизацией и выполнением и позволяет изменить проблемный запрос без изменения приложения:</p> <p>– Добавить подсказок оптимизатору <br> – Поменять порядок в join<br><span>–&nbsp;</span>Решает проблему «плохих» запросов от ORM, сторонних приложений <br><span>–&nbsp;</span>Больше не нужно использовать proxy в этих случаях</p> <p>&nbsp;</p> <p><strong>Улучшения в InnoDB</strong><br><br> Производительность/масштабируемость</p> <ul> <li>Поддержка native partitioning</li> <li>Быстрее, меньше ресурсов</li> <li>Поддержка trasportable tablespaces</li> <li>General tablespaces</li> </ul> <p><strong>Улучшения Fulltext</strong></p> <p>Поддержка parser plugin<br>CJK и MeCab парсеры<br>Поддержка GIS индексов</p> <p>Быстрый ALTER TABLE для VARCHAR<br> Оптимизация создания индексов (create index bulk load)<br> Изменение размера buffer pool без рестарта<br> Сохранение горячих страниц из buffer pool для прогрева (--innodb-buffer- pool-dump-pct=)<br> Поддержка 32k и 64k страниц</p> <p>Управление MERGE_THRESHOLD<br> Оптимизация работы с временными табличками (пользовательскими и intrisic)<br> Transparent Page Compression (punch-hole)<br><br> <strong>Репликация</strong> <br><br> <strong>GTID</strong></p> <p>– Включение GTID без downtime и перезапусков <br> – Slave без binlog <br><br> <strong>Поддержка репликации из многих источников </strong></p> <p>Изменение настроек фильтрации без перезапуска <br><br> <strong>Улучшения в полу-синхронной репликации </strong></p> <p>– Ожидание подтверждения от нескольких slave <br> – Фиксация транзакции только после подтверждения (корректный failover, решение проблемы с видимостью изменений) <br> – Отдельные потоки для отсылки и получения подтверждений <br><br> <strong>Безопасность</strong> <br><br> Безопасность по умолчанию<br>–&nbsp;Автогенерация пароля root@localhost при инсталляции <br> – Нет анонимов<br><span>–&nbsp;</span>Простое и безопасное создание БД через mysqld —initialize <br><br> <strong>SSL</strong></p> <p>– Включен по умолчанию <br> – --ssl на клиенте его требует <br> – Автоматическое обнаружение и генерация ключей <br> – --require-secure-trasport на сервере<br><br> <strong>Поддержка политик смены паролей </strong></p> <p>Временная блокировка и разблокировка пользователей <br> Режимы AES шифрования <br><br> <strong>Расширена поддержка PROXY пользователей </strong></p> <p>– Теперь и при аутентификации через встроенные механизмы сервера <br> – Можно использовать для эмуляции ролей <br><br> Максимальная длина имени пользователя теперь 32</p> <p>CREATE/DROP USER IF EXIST<br><br> PERFORMANCE_SCHEMA и SYS<br><br> <strong>Добавлена инструментация для: </strong></p> <p>– Блокировок метаданных (MDL) <br> – Транзакций <br> – Хранимых процедур и prepared statements <br> – Использования памяти <br><br> <strong>Аггрегированная статистика по: </strong></p> <p>– типам памяти/пользователям/хостам/соединениям <br> Включает данные: <br> – объем, количество выделений, high/low watermarks</p> <p><strong>Добавлены P_S таблицы для: </strong></p> <p>– Состояния slave (аналог SHOW SLAVE STATUS) <br> – Пользовательских переменные <br> – Статусных и системных переменных <br><br> <strong>Оптимизировано использование памяти </strong></p> <p>Многочисленные настройки (фильтрация по пользователям, включение/выключение истории для соединений) <br> SYS schema (ps_helper) теперь доступен по умолчанию<br><br> <strong>GIS</strong> <br><span></span></p> <p><span>–&nbsp;</span>Выкинули старый код и перешли на Boost.Geometry ! <br> – Для вычислений и операций <br> – Меньше ошибок, больше функциональности <br><br> <strong>Импорт/экспорт из/в</strong></p> <p>– GeoHash <br> – GeoJSON</p> <p>Новые вспомогательные функции ST_Distance_Sphere(), ST_MakeEnvelope(),...<br><br> <strong>Реализовали поддержку R-tree в InnoDB </strong><br> – Транзакции/ACID/MVCC при работе с GIS<br><br> <strong>MySQL Document Store </strong><br><br> Использует новый JSON тип и индексы на генерируемые столбцы <br> Оперирует коллекциями JSON объектов <br><br> <strong>Новый MySQL Shell </strong><br> — JavaScript, Python, SQL <br><br> <strong>Коннекторы с новым CRUD API: </strong><br> – Java, NodeJS, Net, Python <br> – Поддерживают работу с коллекциями и таблицами <br> – Цепочки методов (method chaining) <br> – Асинхронное выполнение <br> – Поддерживает parameter binding</p> <p>&nbsp;</p> <p>С полным списком улучшений вы можете ознакомиться по ссылкам на официальный сайт:</p> <ul> <li>Что нового в MySQL 5.7 - <a href=\"https://dev.mysql.com/doc/refman/5.7/en/mysql-nutshell.html\" rel=\"noindex nofollow\">https://dev.mysql.com/doc/refman/5.7/en/mysql-nutshell.html</a></li> <li>Изменения в версии MySQL 5.7.8 - <a href=\"https://dev.mysql.com/doc/relnotes/mysql/5.7/en/news-5-7-8.html\" rel=\"noindex nofollow\">https://dev.mysql.com/doc/relnotes/mysql/5.7/en/news-5-7-8.html</a></li> </ul> <p>&nbsp;</p> <p>Кстати говоря, нашим клиентам уже доступен <a href=\"/hosting\">хостинг с MySQL 5.7</a>! Вы можете абсолютно бесплатно протестировать работу вашего сайта на новой базе&nbsp;MySQL 5.7 в течение 14 дней с момента регистрации.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Что нового в PHP 7.4?",
          "link": "https://sweb.ru/journal/article/chto-novogo-v-php-74/",
          "turbo:topic": "Что нового в PHP 7.4?",
          "turbo:source": "https://sweb.ru/journal/article/chto-novogo-v-php-74/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Что нового в PHP 7.4?</h1><figure><img src=\"https://s.sweb.ru/img/news/a4778afa92cf1307156382f5298dac10.png\"></figure><h2></h2></header><p>Новая версия PHP 7.4 порадовала немало разработчиков улучшением производител ",
            "#cdata-section3": " ьности, безопасностью&nbsp;кода и упрощением синтаксиса. Разберем несколько наиболее важных нововведений в версии PHP 7.4, а также устаревшие функции, от которых стоит отказаться.</p> <h3>Предварительная загрузка</h3> <p>Для улучшения производительности добавили предварительную загрузку, способную значительно улучшить этот показатель. Предварительная загрузка дает возможность грузить скрипты в память сервера, где они будут использованы для дальнейших запросов.</p> <p>Управление предзагрузкой выполняется с помощью внесение в php.ini директивы opcache.preload, указывающей на файл, который будет скомпилирован и исполнен при включении сервера.</p> <p>Стоит учитывать важный момент! Для повышения производительности сервер перезапускают, если источник preload файлов меняется.</p> <h3>Типизированные свойства в PHP 7.4</h3> <p>Значительные изменения произошли в PHP 7.4 в сторону более строгой типизации этого языка. Теперь для типизации доступно большинство функций, кроме void и callable.</p> <p>Пример подсказки типом в переменных класса:</p> <p><code>&nbsp;<?php<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; class A<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;{<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;public string $name;&nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;public Foo $foo;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; }</code></p> <h3>Стрелочные&nbsp;функции&nbsp;(короткие&nbsp;замыкания)&nbsp;в&nbsp;PHP&nbsp;7.4</h3> <p>В&nbsp;версии&nbsp;PHP&nbsp;7.4&nbsp;добавлен&nbsp;синтаксис&nbsp;коротких&nbsp;замыканий,&nbsp;который&nbsp;способен&nbsp;значительно&nbsp;очистить&nbsp;PHP-код&nbsp;и&nbsp;сделать&nbsp;его&nbsp;более&nbsp;лаконичным.</p> <p>Пример стрелочных функций, захватывающих переменные по значению автоматически:</p> <p><code><?php<br><br>$y&nbsp;=&nbsp;1;<br>&nbsp;<br>$fn1&nbsp;=&nbsp;fn($x)&nbsp;=>&nbsp;$x&nbsp;+&nbsp;$y;<br>//&nbsp;эквивалентно&nbsp;использованию&nbsp;$y&nbsp;по&nbsp;значению:<br>$fn2&nbsp;=&nbsp;function&nbsp;($x)&nbsp;use&nbsp;($y)&nbsp;{<br>&nbsp;&nbsp;&nbsp;&nbsp;return&nbsp;$x&nbsp;+&nbsp;$y;<br>};<br><br>var_export($fn1(3));<br>?>&nbsp;</code></p> <h3>Примечания</h3> <p>Короткие замыкания могут получить доступ к родительской области, при этом ключевое слово use - не нужно. $this доступен так же, как и у обычных замыканий. Такие замыкания могут содержать в теле только одну строку, которая также является оператором возврата.</p> <h3>Слабые ссылки в&nbsp;PHP&nbsp;7.4</h3> <p>В PHP 7.4 добавлена прямая поддержка слабых ссылок с помощью класса WeakReference. Он дает возможность разработчикам сохранить ссылку на объект, которая не будет преградой для уничтожения этого объекта. Ранее поддержка Weak References осуществлялась с помощью расширения pecl-weakref.</p> <h3>Оператор присваивания нулевого слияния (NULL) в PHP 7.4</h3> <p>Оператор присваивания значения NULL&nbsp;сокращает количество&nbsp;операций по объединению нулевых значений и уменьшает размер кода некоторых операторов.</p> <p>Простыми словами \"если левый параметр не существует или равен null, то присвоить ему значение равное правому параметру\".</p> <p><code>// PHP 7.0<br><br>$cart['id'] = $cart['id'] ?? 0;</code></p> <p><code>// PHP 7.4<br><br>$cart['id'] ??= 0;</code></p> <h3>Ковариантные возвраты и контравариантные параметры</h3> <p>За редким исключением, ранее в PHP использовали только инвариантные параметры и возвращаемые типы. В последней версии PHP 7.4 допускают ковариацию возвратов и контравариантность для параметров.</p> <p>Существующие типы параметров</p> <noindex><ul> <li>Инвариант: если тип супертипа ограничивает тип подтипа;</li> <li>Ковариант: если порядок типов сохраняется (типы упорядочены от более специфических к более общим);</li> <li>Контравариант: если он меняет порядок (типы упорядочены от более общих к более конкретным).</li> </ul></noindex> <p>Для лучшего понимания ковариантных возвратов и контравариантных параметров предлагаем вам ознакомиться с RFC, а ниже мы рассмотрим несколько простых примеров.</p> <h4>Ковариантный тип возврата</h4> <p><code>interface Factory {<br><br>&nbsp;&nbsp;&nbsp;&nbsp;function make(): object;<br><br>}<br><br>class UserFactory implements Factory {<br><br>&nbsp;&nbsp;&nbsp; function make(): User;<br><br>}&nbsp;</code></p> <h4>Контравариантный&nbsp;параметр</h4> <p><code>interface Concatable {<br><br>&nbsp;&nbsp;&nbsp; function concat(Iterator $input);<br><br>}&nbsp;<br><br>class Collection implements Concatable {<br><br>&nbsp;&nbsp;&nbsp; // accepts all iterables, not just Iterator<br><br>&nbsp;&nbsp;&nbsp; function concat(iterable $input) {/* . . . */}<br><br>}</code></p> <h3>Устаревшие&nbsp;функции&nbsp;в&nbsp;PHP 7.4</h3> <p>В PHP 7.4 ряд функций уходит в прошлое, что оказывает существенное влияние на ранее написанный код. Поэтому перед переходом на php 7.4 рекомендуем вам внимательно изучить документацию обновленной версии и не игнорировать предупреждения об устаревших (deprecated) функциях. Таким образом вам будет легче мигрировать на новые версии PHP в будущем.</p> <br><b>Некоторые из устаревших вещей</b><img src=\"https://s.sweb.ru/img/news/28125f2e8c075ade7d0300d39c3d7886.png\"> <h3>Два новых метода сериализации объектов</h3> <p>Для сериализации объектов ранее использовали лишь 2 механизма: методы __sleep()/__wakeup() и интерфейс Serializable. Некоторые разработчики полагают, что это приводит нагруженному и уязвимому коду. Чтобы избежать подобных проблем были добавлены 2 новых метода&nbsp; __serialize и __unserialize.</p> <h3>Wordpress&nbsp;на&nbsp;PHP&nbsp;7.4</h3> <p>По состоянию на 28 мая 2019 года более 66% сайтов на&nbsp;Wordpress&nbsp;используют версию&nbsp;PHP&nbsp;5.x.&nbsp; в то время как Wordpress&nbsp;рекомендует пользователям использовать последнюю версию&nbsp;PHP. Также большинство популярных плагинов, которые владельцы сайтов ставят на свои сайты, имеют свойство обновляться и работать только на последних версиях&nbsp;PHP.</p> <p>Отсутствие свежей версии&nbsp;PHP&nbsp;для&nbsp;Wordpress&nbsp;и всех подключенных плагинов приводят к тому, что владелец сайта не имеет возможности обновлять их код и обрекает себя на более высокую уязвимость, низкую производительность и невозможность использовать новые функции&nbsp;Wordpress&nbsp;или плагинов.</p> <p>Некоторые популярные&nbsp;PHP-разработчики делятся своими исследованиями производительности в зависимости от версии&nbsp;PHP&nbsp;и большинство сходится во мнении, что&nbsp;PHP&nbsp;7.4 способно обрабатывать до 3 раз больше запросов в секунду в сравнении с предыдущими версиями&nbsp;PHP.</p><noindex> <h4>Тесты WordPress 5.0 PHP</h4><br> <p> </p><ul style=\" background: #80808012; padding: 15px;\"> <li>WordPress 5.0 PHP 5.6: 91,64 запросов / сек;</li> <li>WordPress 5.0 PHP 7.0: 206,71 запросов / сек;</li> <li>WordPress 5.0 PHP 7.1: 210,98 запросов / сек;</li> <li>WordPress 5.0 PHP 7.2: 229,18 запросов / сек;</li> <li>WordPress 5.0&nbsp;PHP 7.3:&nbsp;253,20 запросов / сек;</li> <li>WordPress 5.0&nbsp;PHP 7.4:&nbsp;271,20 запросов / сек.</li> </ul></noindex> <p></p> <h3>PHP 7.4 для клиентов хостинга SpaceWeb</h3> <p>Вы можете выбрать нужную версию PHP в разделе «Сайты» - <a href=\"https://cp.sweb.ru/hosting/sites\">«Настройки конфигурации»</a>.<br> Обратите внимание, что PHP 7.4 доступен в связке с Apache 2.4, в котором отличается синтаксис некоторых директив .htaccess. Подробнее в разделе <a href=\"https://help.sweb.ru/entry/1035/\">«Помощь»</a><br> Перед сменой настоятельно рекомендуем <b>удостовериться в совместимости</b> вашего сайта с выбираемой версией.</p> <h3>PHP 7.4 для новых клиентов</h3> <p>Хотите протестировать работу своего сайта на PHP 7.4 одним из первых? <a href=\"/hosting/\">Заказывайте виртуальный хостинг в SpaceWeb</a> — у нас PHP 7.4 уже доступен на любом тарифе! При необходимости мы можем <a href=\"/hosting/transfer/\">бесплатно перенести ваш сайт к нам на хостинг</a>. А бесплатный тестовый период в 14 дней позволит вам не спеша провести тестирование сайта на самом современном оборудовании и программном обеспечении.</p><img src=\"https://s.sweb.ru/img/onboardbnrs/c8c8340532e73ff0ba66258e5304efdb.png\" /><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Способы монетизации сайта",
          "link": "https://sweb.ru/journal/article/sposoby-monetizatsii-sayta/",
          "turbo:topic": "Способы монетизации сайта",
          "turbo:source": "https://sweb.ru/journal/article/sposoby-monetizatsii-sayta/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Способы монетизации сайта</h1><figure><img src=\"https://s.sweb.ru/img/news/3eef6a2cb67de618923b852753d84176.png\"></figure><h2></h2></header><p>Существует огромное количество методов и способов заработка в интернете. Один из них — это монетизация собственного сайта. Этот процесс представляет собой заработок на сайте путем привлечения посетителей, размещения рекламы, простановки ссылок на другие ресурсы, размещения видеороликов, статей и другой информации.</p> <p>Однако, основные способы — это распространение информации рекламного характера и получение за это дохода. Для того чтобы монетизировать сайт, его нужно создать, что сопряжено с определенными расходами:</p> <ul> <li>Непосредственно создание веб-ресурса;</li> <li>Покупка хостинга;</li> <li>Покупка домена;</li> <li>Наполнение сайта информацией.</li> </ul> <p>Окупить расходы на содержание сайта и получить прибыль позволяет монетизация. Иногда этот метод со временем переходит в основной вид заработка.</p> <p>Все сайты условно делятся на коммерческие, новостные и информационные. В теории можно монетизировать практически любой ресурс интернета. Практически успех монетизации зависит от нескольких факторов:</p> <ul> <li>Количества посетителей – чем больше, тем лучше;</li> <li>Выбор правильного метода монетизации – зависит от тематики сайта;</li> <li>Достоверность и релевантность информации.</li> </ul> <h2>Планируем начало монетизации сайта</h2> <p>По срокам начала нет строгих рекомендаций. Однако лучше всего начинать после того, как на сайте появится&nbsp;стабильный и достаточный поток посетителей. А от его количества зависит выбор метода монетизации, а также количество прибыли, которую можно получить. Если трафик маленький, но стабильный, есть возможность получения прибыли путем использования рекламных сетей. А при регулярном ежедневном трафике в тысячи посетителей открывается перспектива привлечения прямых рекламных предложений. Доход с сайта напрямую зависит от количества и качества посетителей ресурса.</p> <p>Количество прибыли напрямую зависит от:</p> <ul> <li> <p>Количества посетителей;</p> </li> <li> <p>Количества целевого трафика – посетители, которые соответствуют запросам рекламодателей;</p> </li> <li> <p>Эффективности применения современных методов монетизации;</p> </li> <li> <p>Качества и тематики самого веб-ресурса.</p> </li> </ul> <h2>Выбираем методы монетизации сайта</h2> <p><strong>Email-рассылка</strong> — с ее помощью можно сделать сообщество постоянных посетителей, которых интересует тематика вашего сайта. В письмах рассылки можно рекламировать товары и услуги схожие с тематикой сайта.</p> <p>В случае продажи вашего товара формируется список клиентов, которые будут получать рекламные или информационные e-mail рассылки. Если же вы никогда ещё этого не делали, то стоит начать прямо сейчас. Подумайте, как сделать письма более читабельными для своих клиентов и прибыльными для вас.</p> <p>При продаже сторонних товаров через email-рассылку самое главное — подобрать товары, в которых целевая аудитория сайта будет точно заинтересована. Расширение ассортимента - это хороший инфоповод провести рассылку, в особенности, если вы предлагаете сезонный товар.</p> <p>Какие правила важно соблюдать, чтобы вашу рассылку было интересно читать?</p> <p>Каждый получатель вашего письма — VIP клиент. Он должен это понять с первых ваших рассылок. Если вы подписаны на какие-либо рассылки, тогда вы точно понимаете, как сильно раздражает безликое отношение и использованные до дыр шаблоны. Включите в рассылку теплое отношение к своим клиентам и они отплатят вам с лихвой.</p> <p>Создайте расписание рассылок. В этом деле главное регулярность. С этим поможет автоматизация процесса с помощью сервисов рассылок.</p> <p>Тема вашего письма имеет важное значение. Зачастую только от темы письма зависит, прочитают электронное письмо или нет. Соберите список тем почтовых писем, которые вы открывали за последний месяц и попробуйте установить связь, почему вы открыли эти почтовые письма и в чем разница их темы от тех, которые вы проигнорировали. После небольшого анализа вы сможете понять, какую тему лучше указывать вам в вашей рассылке.</p> <p><strong>Партнерские программы</strong>.</p> <p>С помощью партнерских программ (ПП) вы сможете получать&nbsp;дохода от продаж чужих услуг, товаров и инфо-продуктов. Суть заработка состоит в рекламировании товаров партнеров.</p> <p>Можно рекомендовать читателям своего сайта продукты других компаний и зарабатывать на комиссии от продаж, если пользователи переходят и покупают товар по специальной партнерской ссылке. Сейчас на рынке существует огромное количество таких программ, выберите ту, которая будет актуальна для аудитории вашего ресурса.&nbsp;</p> <p>Чтобы монетизировать трафик в партнерской программе, нужно правильно выбрать оффер и рекламный формат. Оффер — это предложение рекламодателя. Для грамотного подбора предложения, нужно изучить аудиторию своего сайта и проанализировать её. Важно, чтобы тематика рекламодателя и вашего проекта были в одной сфере, чтобы не спугнуть целевую аудиторию ненужными им продуктами. С помощью аналитики на сайте посмотрите, какие статьи лучше всего читают пользователи и&nbsp;после этого подбирайте оффер.</p> <p><strong>CPA-сети</strong></p> <p>Это рекламные сети, работающие по принципу Cost Per Action — оплаты&nbsp;за действие. Вебмастер получает вознаграждение за определенные действия привлеченного им посетителя на сайте рекламодателя. Например, регистрацию или приобретение какого-то продукта.</p> <p>В интернете можно найти сотни CPA-сетей, которые предлагают владельцем сайтов огромное количество товаров для продажи и заработка на них. Важно выбрать сеть с безупречной репутацией, стабильными выплатами и точным учетом всех заявок. Для этого посетите рейтинги CPA сетей и присмотритесь к наиболее сочным предложениям. Это оградит вас от&nbsp;потенциальных проблем и излишней переписки&nbsp;с сервисом.</p> <p><strong>Контекстная реклама</strong> – получение денежных начислений за переходы по небольшим объявлениям, которые показываются рекламной системой на вашем сайте в соответствии с интересами посетителя. При этом вам не нужно думать над самой рекламой, достаточно лишь определить места на сайте, где она будет показываться. Пожалуй это самый простой и популярный вид заработка на посещаемом сайте сейчас. Почти всегда используются рекламные системы Google Ads и Яндекс Директ.</p> <h2>Размещаем рекламные материалы на сайте</h2> <p>Кроме выбора хорошего предложения вам также необходимо решить, в каком виде это предложение разместить.&nbsp;Популярные варианты:</p> <p><strong>Ссылка в обзоре или статье</strong>. Подойдет, если предложение рекламодателя отлично вписывается в тематику вашего веб-сайта. Возможно вам стоит написать уникальный обзор или статью и вставить в него рекламную ссылку.</p> <p><strong>Рекламный блок на сайте</strong>. Популярны следующие рекламные форматы: тизерная и баннерная реклама, а также блок контекстной рекламы.</p> <p><strong>Попап (pop up) окна</strong> — всплывающие окна рекламного характера на сайте, пригодные для размещения рекламного предложения и кнопки перехода. В классическом варианте с помощью попап окна вы можете предложить пользователям подписаться на рассылку. Несмотря на то, что многие люди нелестно отзываются о попап окнах, продажи они все же приносят.</p> <p><strong>Баннерная реклама</strong> – владелец сайта размещает рекламные баннеры на своем веб-сайте. Пожалуй, это самый древний способ рекламы и заработка для владельцев собственного сайта. Баннерная реклама — это размещение графического, анимационного или видео-баннера определенных размеров на сайте.<br>Стоит заранее запланировать видные рекламные места для размещения баннеров на своем веб-сайте. Для обычных блогов чаще всего используются размеры: 468px × 60px, 360px × 60px, 125px × 125px, 100px × 100px.</p> <p>&nbsp;</p> <p>Чтобы монетизация сайта проходила успешно, необходимо соблюдать баланс между пользой от контента самого сайта и размещенной на нем рекламой. Ни в коем случае не стоит перегружать сайт рекламными блоками, всплывающими&nbsp;окнами или излишне яркими картинками, этим вы можете отпугнуть посетителей сайта, а в худшем случае получить санкции со стороны поисковых систем, что негативно скажется на посещаемости сайта. В то же время ненавязчивая и аккуратная реклама может&nbsp;стать неплохим дополнительным источником дохода.</p> <p>&nbsp;</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как подобрать домен?",
          "link": "https://sweb.ru/journal/article/kak-podobrat-domen/",
          "turbo:topic": "Как подобрать домен?",
          "turbo:source": "https://sweb.ru/journal/article/kak-podobrat-domen/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как подобрать домен?</h1><figure><img src=\"https://s.sweb.ru/img/news/f9db03ca029360ced63f3f6b5caf02de.jpg\"></figure><h2>6 базовых правил</h2></header><h2>Чем домен короче, тем лучше</h2> <p>Правило очевидное, короткий домен проще запомнить. Например, у хостинг-провайдера SpaceWeb есть домены sweb.ru и spaceweb.ru, и как основной домен для сайта используется именно sweb.ru, так как он короче. Несмотря на то, что в большинстве популярных доменных зон все короткие имена заняты, можно отыскать хороший короткий домен в одной из тематических зон. Например, в SpaceWeb можно зарегистрировать домен в любой из 310 зон. Адрес сайта может положительно влиять на его позиции в поисковых системах. По возможности включите в название домена — основной товар или услугу, это потом пригодится.</p> <h2>Домен должен иметь однозначную трактовку “слышится - пишется”, то есть не иметь спорных букв или буквосочетаний</h2> <p>Например, если вы делаете сайт “весёлый цветочник”, то вариантов написания домена масса: “veseliy-cvetochnic.ru”, “vesely-cvetochnic.ru”, ”veseliy-cvetocnic.ru”, “vesely-cvetocnic.ru”, “veseliy-tsvetocnic.ru”, “vesely-tsvetocnic.ru” и т.д. По какому из них будет располагаться ваш сайт, а по какому сайт конкурента - неизвестно. Либо вам придётся регистрировать все возможные сочетания, что влетит в копеечку. Лучше поискать другие слова, которые будут.</p> <h2>Домен, совпадающий с названием сайта/проекта/компании, должен быть ваш</h2> <img src=\"https://s.sweb.ru/img/news/c22e1eccce4117b75b9c079313c667dd.jpg\" alt=\"Творческий процесс подбора домена\" align=\"none\"> <p>Если ваш сайт/проект/бренд имеет оригинальное название, подобрать домен не составит труда. Например, ваша компания называется “Гвоздикас”, проверяете домен gvozdikas - он свободен во всех зонах. Задача решена. Часто названия проектов придумываются под хороший звучный домен.</p> <p>Обратное правило: если домен, совпадающий с названием вашей компании, занят - это большой риск потери посетителей., т.к. по названию компании будут находить чужой сайт. А в самом плохом случае, если у владельца товарный домена знак , риск потери бренда. В этом случае нужно либо выкупить домен у прежнего владельца, либо сменить название сайта.</p> <p>Например, компания называется “Гвоздика”. Домены в популярных зонах заняты. Но есть и другие доменные зоны. Если вы работаете в Санкт-Петербурге, то вам подойдёт gvozdika.spb.ru, который свободен (на момент написания статьи), или же какая-нибудь тематическая зона - gvozdika.club, например. Зарегистрировать товарный знак “Гвоздика” нельзя, и запретить использовать это слово для домена тоже.</p> <h2>При выборе домена проявите креатив</h2> <p>Это очень пригодиться, если название вашей компании, как часто бывает, состоит из нескольких слов. <br>Что делать в этой ситуации? Вариантов несколько:</p> <ol> <li>Выбрать одно из двух слов и попробовать придумать название домена из него. Например, mirage.ru у сети кинотеатров “Мираж Синема”;</li> <li>Использовать доменную зону в качестве второго слова. Например, echo.msk.ru для радио “Эхо Москвы”;</li> <li>Объединить 2 слова в одно и сократить. Например, sevdol.ru для жилого комплекса “Северная долина”;</li> <li>Использовать дефис. Например, skoda-ap.ru - сайт дилера “Шкода Авто Премиум”.</li> </ol> <h2>Заставьте доменное имя работать на вас</h2> <img src=\"https://s.sweb.ru/img/news/5f10043ffa378731dd41ecc609e5c34d.jpg\" alt=\"Подбор домена для бизнеса\" align=\"none\"> <p>Попробуйте вынести в название домена ваше главное конкурентное преимущество! То, что сразу поможет вам отстроиться от конкурентов. Например, если ваше конкурентное преимущество - низкая цена, то используйте в имени домена слово «cheap», скорость - «fast» или «quick», статус - «luxury» или «exclusive». Это может быть и любой другой признак, который отличает ваш проект от других ему подобных. Например, если вы занимаетесь организацией свадеб на теплоходе, то главное преимущество - это именно теплоход, поэтому домен svadba-na-teplohode.com - отличный выбор!</p> <h2>Доменная зона не имеет практически никакого значения для продвижения будущего сайта</h2> <p>Поисковые системы также совершенно нормально относятся к кириллическим зонам, таким как «рф» и т.п.</p> <p>В то же время, при регистрации красивого и свободного доменного имени, имеет смысл проверить его историю, вбив свободный адрес в поисковики, или посмотрев через Веб-архив. Если по этому адресу ничего не получится найти, то это хорошо. Возможно даже, что по этому адресу когда-то работал сайт со схожей с вашей тематикой, это еще лучше. Опасаться стоит доменов, на которых когда-то были размещены сайты сомнительного содержания, т.к. вся история по домену запоминается и может учитываться поисковыми алгоритмами.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "HTTP2 —обзор технологии",
          "link": "https://sweb.ru/journal/article/http2-obzor-tehnologii/",
          "turbo:topic": "HTTP2 —обзор технологии",
          "turbo:source": "https://sweb.ru/journal/article/http2-obzor-tehnologii/",
          "turbo:content": {
            "#cdata-section": " <header><h1>HTTP2 —обзор технологии</h1><figure><img src=\"https://s.sweb.ru/img/news/97d5aecfa6e02eb7988acdd58f9c0793.png\"></figure><h2></h2></header><p>HTTP/2 является новой версией протокола HTTP, которая уменьшает задержки и позволяет выполнять сразу множество запросов в рамках одного соединения, благодаря чему значительно увеличивается производительность и <strong>ускоряется загрузка</strong> страниц вашего сайта.</p> <h2>Сравнение протоколов HTTP/1 и HTTP/2</h2> <p>Использование протокола HTTP/1.1 со временем привело к одной существенной проблеме. В начале 2000-x сайты создавались на одном лишь HTML с небольшим внедрением CSS-стилей. А вот сайты в наше время часто подгружают несколько css-файлов, скрипты Javascript и даже flash-анимацию. </p> <p>Таким образом между сервером и браузером пользователя может образоваться множество соединений, способных повысить нагрузку на сервер, увеличить время загрузки и отрисовки страниц сайта.</p> <p>Новый протокол HTTP/2 имеет ряд особенностей, способных сгладить данную проблему:</p> <ul> <li>Конвейеризация и мультиплексирование запросов: в рамках одного TCP-соединения могут быть отправлены сразу несколько запросов;</li> <li>Расстановка приоритета потоков;</li> <li>Сжатие размеров данных в заголовках HTTP;</li> <li>Формат данных изменен с текстового на бинарный.</li> </ul> <h2>HTTP/2 работает быстрее HTTP/1?</h2> <p>В проведенных специалистами из компании HttpWatch нескольких тестов использования протокола HTTP/2 обнаружено заметное ускорение.</p> <p> <em>Скорость загрузки по HTTP/1.1 зафиксирована на изображении ниже:</em></p> <img src=\"https://s.sweb.ru/img/news/063a17ecc0a604d059459bf80ef5d912.jpg\"> <p> <em>Скорость загрузки данного ресурса по HTTP/2:</em><br><img src=\"https://s.sweb.ru/img/news/308ac234e89c5cfd344b2ad423d4489c.jpg\"></p> <p>В результате проведенного теста реальное ускорение загрузки составило 23%.</p> =<p> Серии тестов от ряда других компаний показали ускорение в диапазоне 13-18% по протоколу HTTP/2, и это для сайтов с уже выполненной первичной оптимизацией. </p> <h2>Какие браузеры поддерживают протокол HTTP/2?</h2> <p>Следующие браузеры поддерживают протокол HTTP/2 (по сведениям <a href=\"https://caniuse.com\" rel=\"nofollow\">CanIUse.com</a>):<br> <b>Зеленый</b> - полная поддержка, <b>Красный</b> - поддержка отсутствует. </p> <img src=\"https://s.sweb.ru/img/news/51cf1418a18abb2694b1390ad4211ad2.png\"><br> <p>На момент написания обзора составляет ~96.51% браузеров пользователей сервиса CanIUse.</p> <h2>Как использовать HTTP/2 на хостинге?</h2> <p>Для клиентов нашего хостинга поддержка HTTP/2 добавлена на уровне модуля к серверу nginx. Для передачи данных по протоколу HTTP/2 должен быть подключен <a href=\"/ssl/\">SSL-сертификат</a>.</p> <p>Подробные инструкции по SSL-сертификатам доступны по ссылке: <a href=\"https://help.sweb.ru/40/\">https://help.sweb.ru/40/</a>.</p> <p>Поддержку протокола HTTP/2 можно проверить с помощью сервисов или расширений для Mozilla Firefox или Google Chrome.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Новый дизайн ISPmanager Lite",
          "link": "https://sweb.ru/journal/article/novyy-dizayn-ispmanager-lite/",
          "turbo:topic": "Новый дизайн ISPmanager Lite",
          "turbo:source": "https://sweb.ru/journal/article/novyy-dizayn-ispmanager-lite/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Новый дизайн ISPmanager Lite</h1><figure><img src=\"https://s.sweb.ru/img/news/6b3e35376089884bf13af5475f045a1b.png\"></figure><h2></h2></header><p>28 июля состоялось масштабное обновление дизайна одной из самых популярных панелей управления веб-сервером ISPmanager Lite.</p><p>Логика интерфейса не претерпела изменений, а вот дизайн панели существенно эволюционировал!</p><ul><li>ISPmanager шагнул в сторону минималистичного дизайна, изменен стиль иконок навигации для быстрого и удобного поиска нужного раздела панели управления. Сами иконки не отвлекают администратора от рабочей области.</li><li>Для визуального отделения рабочей области от панели навигации внедрили новую цветовую схему, а именно изменение фона панели навигации на темный цвет.</li><li>Пространство между элементами расширено, что позволяет быстро находить нужную информацию в строках внутренних таблиц.</li></ul><p>Некоторые визуальные изменения панели управления ISPmanager Lite представлены на скриншотах ниже.</p><img src=\"https://s.sweb.ru/img/news/d09f73936d39d207ff281de374dced5a.png\"><p style=\"text-align:center;\"><b>Рис.1</b> Главная страница в ISPmanager Lite</p><img src=\"https://s.sweb.ru/img/news/05efeba57e2ad1e360d28a73ad6e4b6d.png\"><p style=\"text-align:center;\"><b>Рис.2</b> Раздел \"Учетные записи\" в ISPmanager Lite</p><p style=\"text-align:center;\"><img src=\"https://s.sweb.ru/img/news/1e67c96549bfe4995a2ae0b7b76d823a.png\"></p><p style=\"text-align:center;\"><b>Рис.3</b> Раздел \"Настройки Web-сервера\" в ISPmanager Lite</p><p style=\"text-align:center;\"><img src=\"https://s.sweb.ru/img/news/d6e84697f6b953abbec5fc4e62ede6ec.png\"></p><p style=\"text-align:center;\"><b>Рис.4</b> Раздел \"Статистика\" в ISPmanager Lite</p><p style=\"text-align:center;\"><img src=\"https://s.sweb.ru/img/news/6d5308699736db88d83d3e15502e0f25.png\"></p><p style=\"text-align:center;\"><b>Рис.5</b> Файловый менеджер в ISPmanager Lite</p><p style=\"text-align:center;\"><img src=\"https://s.sweb.ru/img/news/7eeb8570c26ae6db4a5464fcc023e074.png\"></p><p style=\"text-align:center;\"><b>Рис.6</b> Модули в ISPmanager Lite</p> <h2>Как переключиться на новый интерфейс</h2> <p>Если вы уже пользуетесь панель управления ISPManager, то для переключения на новый интерфейс вам необходимо обновиться до версии 5.261.0. После этого у вас появится возможность переключения между старым и новым интерфейсом.</p><img src=\"https://s.sweb.ru/img/news/9ee71a43e981eee6de8d136228f02e8e.png\"> <p>Начиная с 18 августа 2020 года новый интерфейс будет включен по умолчанию для всех новых установок ISPManager.</p> <p>Хотите попробовать панель управления ISPmanager Lite с обновленным дизайном? <br>Последняя версия ISPmanager Lite уже доступна на <a href=\"https://sweb.ru/vds/\">VDS серверах</a> хостинга SpaceWeb!</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "NVMe SSD диски — обзор технологии",
          "link": "https://sweb.ru/journal/article/nvme-ssd-diski-obzor-tehnologii/",
          "turbo:topic": "NVMe SSD диски — обзор технологии",
          "turbo:source": "https://sweb.ru/journal/article/nvme-ssd-diski-obzor-tehnologii/",
          "turbo:content": {
            "#cdata-section": " <header><h1>NVMe SSD диски — обзор технологии</h1><figure><img src=\"https://s.sweb.ru/img/news/b94e9faa5c1d417301d9c8713e98b38e.jpg\"></figure><h2></h2></header><p>На сегодняшний день самые высокие показатели производительности показывают устройства, работающие по технологии NVMe. Давайте разберемся, что это за технология и какие показатели она выдает.</p> <h2>Что такое NVMe?</h2> <p>NVM Express – тип накопителя семейства SSD, который подключают с помощью шины PCI Express.</p> <p>Новый интерфейс NVMe был разработан для уменьшения задержек и увеличения производительности в работе твердотельных накопителей. NVMe использует новое ПО и механизм обработки очередей, а также более эффективный высокий параллелизм накопительных устройств.</p> <p>Обычные SSD осуществляют свою работу с помощью интерфейса SATA, что приводит к ряду ограничений и уменьшению скорости передачи данных, невзирая на технические характеристики самого накопителя. Фактически&nbsp;подключение к новому интерфейсу снимает те ограничения, которые имеют накопители, работающие по стандарту SATA.</p> <h2>История создания NVMe<br></h2> <p>Первая дискуссия о появлении нового стандарта образовалась на форуме разработчиков компании Intel в далеком 2007 году. В этом же году была собрана группа разработчиков во главе c Intel для проработки интерфейса NVMHCI. Спецификация NVMHCI 1.0 была завершена весной 2008 года, а начальная версия NVMe 1.0 была выпущена только к марту 2011 года.</p> <p>Впервые контроллеры для NVMe были анонсированы в 2012 году фирмой ITD.</p> <p>Первые же накопители с NVMe для ПК и серверов были выпущены компанией Samsung в 2013 году. Скорость чтения данных устройств достигала&nbsp; 3 ГБ/с, что являлось неким прорывом в области твердотельных накопителей.</p> <h2>Сравнение AHCI и NVMe</h2> <p>Традиционный механизм, используемый для подключения накопителей информации стандарта Serial Ata (SATA), в частности твердотельных SSD, называется Advanced Host Controller Interface (ACHI). Именно ему на замену пришла технология NVMe. </p><p>Сравнительный анализ характеристик технологии AHCI и NVMe рассмотрим в таблице 1:</p><table cellspacing=\"0\" border=\"0\"> <colgroup width=\"425\"></colgroup> <colgroup width=\"256\"></colgroup> <colgroup width=\"288\"></colgroup> <tbody><tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><b>&nbsp;Параметр</b></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><b>&nbsp;AHCI</b></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><b>&nbsp;NMVe</b></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"51\" align=\"left\"><font color=\"#000000\">&nbsp;Максимальная глубина очереди запросов</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;1 очередь, до 32 команд в очереди</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;65536 очередей, до 65536 команд в&nbsp; очереди</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"74\" align=\"left\"><font color=\"#000000\">&nbsp;Некэшируемые доступы к регистрам (2000 циклов каждый)</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;6 на команды вне очереди; 9 на&nbsp; команды в очереди</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;2 на команду</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"122\" align=\"left\"><font color=\"#000000\">&nbsp;MSI-X и управление прерываниями</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;1 прерывание; управление&nbsp; отсутствует</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;2048 прерываний, передаваемых&nbsp; сообщениями или MSI-X (Message&nbsp; Signaled Interrupts Extended)</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"74\" align=\"left\"><font color=\"#000000\">&nbsp;Многопоточность и параллелизм</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;Требуется блокировка&nbsp; синхронизации для выдачи команды</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;Не требуется</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"74\" align=\"left\"><font color=\"#000000\">&nbsp;Эффективность для команд 4 Кбайт</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;Параметры команды требуют два&nbsp; серийных запроса DRAM</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;Все параметры команды в одном&nbsp; запросе 64Кб</font></td> </tr> </tbody></table> <p>&nbsp;У технологии NVMe нагрузка может распределяться одновременно на 65000 очередей по 65000 команд, в то время как AHCI имеет одну очередь в 32 команды. При наступлении приоритетной задачи NVMe SSD выполняет ее быстрее, благодаря возможности управления прерываниями.</p> <p>У NVMe один запрос к оперативной памяти (DRAM), у AHCI их два. Таким образов NVMe обладает меньшей задержкой при выполнении команд. Подключив NVMe накопитель через PCI Express, диск развивает скорость до 3.2 ГБ/с, что в 3 раза быстрее SATA.</p> <h2>Сравнение характеристик накопителей SATA и NVMe</h2> <p>Проведем сравнительный анализ производительности твердотельных накопителей с NVMe и SATA в таблице 2:</p><table cellspacing=\"0\" border=\"0\"> <colgroup width=\"327\"></colgroup> <colgroup width=\"256\"></colgroup> <colgroup width=\"288\"></colgroup> <tbody><tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\"><b>&nbsp;Характеристика</b></font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\"><b>&nbsp;Intel® серии D3-S4510 (</b></font><b>SATA)</b><font color=\"#000000\"><b><br></b></font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\"><b>&nbsp;Intel® DC серии P4510 (NVMe)</b></font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Максимальная скорость чтения</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;560 Мб/с</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;3200 Мб/с</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Максимальная скорость записи</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;510 Мб/с</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;2000 Мб/с</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Скорость произвольного чтения</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;97000 IOPS</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;637000 IOPS</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Скорость произвольной записи</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;35500 IOPS</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;81500 IOPS</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Задержка чтения</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;36 мкс</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;77 мкс</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Задержка записи</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;37 мкс</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;18 мкс</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Мощность в активном режиме</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;3.2 Вт</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;12 Вт</font></td> </tr> <tr> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" height=\"30\" align=\"left\"><font color=\"#000000\">&nbsp;Мощность в режиме ожидания</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;1.1 Вт</font></td> <td style=\"border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000; border-right: 1px solid #000000\" valign=\"bottom\" align=\"left\"><font color=\"#000000\">&nbsp;5 Вт</font></td> </tr> </tbody></table><p>У NVMe задержка записи в два раза меньшей, чем у накопителя по SATA. Работа накопителя по PCI Express позволяет развивать максимальную скорость обработки данных до 3,2 ГБ/с, что в 3 раза больше, чем у SATA.<br></p> <p>По всем тестам NVMe демонстрирует уверенное преимущество над SSD. NVMe имеет в несколько раз большую скорость произвольного чтения и записи, что позволяет обработать больше запросов за единицу времени.</p> <p>Отдельно стоит отметить улучшение производительности на примере CMS 1С-Битрикс, которая&nbsp;известна&nbsp;своей требовательностью к быстродействию файловой системы. Размещение CMS на сервере с дисками SSD NVMe позволяет вдвое увеличить производительность CMS, ускорить открытие страниц сайта и сократить время резервного копирования.</p> <p>Таким образом, по всем параметрам накопители с NVMe превосходят накопители SATA. Для получения наивысшей скорости обработки данных, низких задержек и высокой производительности выбирайте хостинг с NVMe дисками, как новейшее и наилучшее решение для размещения вашего сайта.</p><h2>NVMe в SpaceWeb</h2><p style=\"line-height: 17.55px; margin-top: 0.39cm; margin-bottom: 0.39cm;\" align=\"left\">В компании SpaceWeb технология NVMe успешно применяется с 2017 года.&nbsp;</p><p style=\"line-height: 17.55px; margin-top: 0.39cm; margin-bottom: 0.39cm;\" align=\"left\">Диски&nbsp; SSD NVMe используются на серверах виртуального, реактивного хостинга и VPS/VDS. Вы можете протестировать скорость работы своего сайта бесплатно в течение:</p><p style=\"line-height: 17.55px; margin-top: 0.39cm; margin-bottom: 0.39cm;\" align=\"left\">- 14 дней на <a href=\"/hosting/\" title=\"\" target=\"\">Виртуальном хостинге</a>;</p><p style=\"line-height: 17.55px; margin-top: 0.39cm; margin-bottom: 0.39cm;\" align=\"left\">- 7 дней на <a href=\"/reactive-hosting/\" title=\"\" target=\"\">Реактивном хостинге</a>;</p><p style=\"line-height: 17.55px; margin-top: 0.39cm; margin-bottom: 0.39cm;\" align=\"left\">- 3 дней <a href=\"/vds/\" title=\"\" target=\"\">VPS/VDS</a>.&nbsp;</p> <p><br></p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Новые CMS для создания сайтов в 2019 году",
          "link": "https://sweb.ru/journal/article/novye-cms-dlya-sozdaniya-saytov-v-2019-godu/",
          "turbo:topic": "Новые CMS для создания сайтов в 2019 году",
          "turbo:source": "https://sweb.ru/journal/article/novye-cms-dlya-sozdaniya-saytov-v-2019-godu/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Новые CMS для создания сайтов в 2019 году</h1><figure><img src=\"https://s.sweb.ru/img/news/58ff2d490df9f4d8e946c3d5d136dde5.png\"></figure><h2>Системы управления сайтом, набирающие популярность!</h2></header><p>Что ",
            "#cdata-section4": " бы увеличить свой товарооборот и создать специализированный сайт для продаж необходима стабильная система управления контентом, так называемая CMS. Их множество и все они дают возможность создавать и администрировать содержимое (контент) сайта, будь то простой веб-сайт или обыкновенный блог. CMS бывают разные, некоторые наиболее эффективны и именно о них и пойдёт речь далее.</p> <h2>1. Squarespace – создать сайт так просто</h2> <p><br><img style=\"width: 300px; height: 100px;\" src=\"https://s.sweb.ru/img/news/99c467939408c9f3cc9743e9fe1f6302.png\"><br><br>Squarespace является одной наиболее прославленных платформ CMS, так сложилось из-за повсеместной рекламы подкастов. Её создали приблизительно в тот же самый период, когда был создан WordPress. Основное отличие - это то, что в ней исходный код у этой платформы закрыт, поэтому нельзя скачать её софт и развернуть его на своём серверном компьютере.</p> <p>Это встроенный конструктор, используемый для сайтов, для создания блогов и даже хостинга. Владелец страницы должен купить подписку, а система Squarespace упростит генерацию веб-платформы с чистого листа, и это очень удобно, особенно, если нет навыков веб-разработки или если необходимо генерировать веб-площадку за короткий период времени. Как и WordPress, Squarespace даёт возможность установить разнообразные темы и конструировать веб-сайты, заполняя их своим текстом, файлами картинок и видео-файлами.</p> <h2>2. Magnolia — CMS, предназначенная для бизнеса</h2> <p><br><img style=\"width: 300px; height: 100px;\" src=\"https://s.sweb.ru/img/news/6fa517981e0f4d0d42ed57b727984a00.png\"><br><br>Одной из основных привлекательных свойств систем управления контентом - это то, что они, как правило, просты в настройке и использовании. Для увеличения прибыли предприятия нужен собственный веб-сайт, чтобы продвигать свой продукт и услуги. При этом у администратора могут отсутствовать необходимые технические навыки, не каждый без должной подготовки может создать веб-ресурс самостоятельно.</p> <p>Java CMS Magnolia задумана как платформа для организаций, которые нуждаются в веб-сайтах с многопрофильным функционалом.</p> <p>Безопасность — это важное отличие данной системы, эта CMS использует особую архитектуру, что разграничивает публичные и частные элементы страницы, и это весьма облегчает <a href=\"/journal/article/kak-zaschitit-svoy-sayt-ot-vzloma/\" title=\"Как защитить сайт от взлома — советы и рекомендации\" target=\"_blank\">защиту сайта от взлома</a>. Позволяет распределить роли, настроить, что именно позволено пользователям и администраторам. Поэтому всегда будет известно, кто может записывать, кому разрешено изменять, просто смотреть или опубликовывать определённый контент.</p> <h2>3. Weebly. Популярное решение для создания страницы в считанные минуты</h2> <p><br><img style=\"width: 300px; height: 150px;\" src=\"https://s.sweb.ru/img/news/100ce3130661f176c20f9998ebd7dcb2.jpg\"><br><br>Достаточно хорошо узнаваемая CMS. У Weebly есть имя, которое знакомо многим. Это лёгкая в эксплуатации система управления контентом, в ней можно без особого труда настроить простой веб-сайт за пару минут. Платформа использует метод перетаскивания, поэтому можно легко добавлять функции и мультимедиа на сайт. И по тому же принципу, есть возможность быстро удалить всё, что захочется.</p> <h2>4. SpaceWeb: Хостинг с бесплатным конструктором сайтов без рекламы</h2> <p><img style=\"width: 300px; height: 70px;\" src=\"https://s.sweb.ru/img/news/a8627d981ef0b2307d084712cdad02f3.png\"><br></p><p>Если у вас отсутствуют технические знания, вы не хотите переплачивать за работу студии и вам нужен сайт в короткий срок, то конструктор сайтов с хостингом и доменом будет правильным решением! На бесплатном тарифе вам доступно 44 шаблона на основе которых вы сможете легко настроить свой сайт. А на тарифе \"eCommerce\" за 399 рублей в месяц вам доступно более 200 шаблонов и возможность развернуть свой собственный интернет-магазин.<br><i> Подробнее</i>: <a href=\"https://sweb.ru/site-constructor/\">https://sweb.ru/site-constructor/</a></p> <p>Как правило, выбор CMS происходит в соответствии с параметрами движков, навыками разработчика, техническими требованиями к сайту и целями проекта. Какая из систем управления для этого подойдёт лучше, каждый решает самостоятельно.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Продвижение сайта — мифы и ошибки в SEO",
          "link": "https://sweb.ru/journal/article/prodvizhenie-sayta--mify-i-oshibki-v-seo/",
          "turbo:topic": "Продвижение сайта — мифы и ошибки в SEO",
          "turbo:source": "https://sweb.ru/journal/article/prodvizhenie-sayta--mify-i-oshibki-v-seo/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Продвижение сайта — мифы и ошибки в SEO</h1><figure><img src=\"https://s.sweb.ru/img/news/5c840f4f8fef7254ce150e985cbfac77.png\"></figure><h2></h2></header><p>Отсутствие подробной и точной информации по SEO тематике (инструкций и мануалов) является основной проблемой при продвижении сайтов. Поисковые системы надежно скрывают работу алгоритмов ранжирования сайтов, что лишает возможности определить принципы их работы, иначе чем тестируя на практике. За счёт внедрения новых функций и идей на сайте можно понять их влияние на поисковую оптимизацию.</p> <p>Из-за постоянного обновления поисковых алгоритмов возникает нестабильность в их функционировании и несвоевременность получения необходимой информации о них. Негативным моментом является появление некомпетентной информации, являющейся сомнительными догадками. Такие информационные вбросы порождают ряд ничем не обоснованных мифов.</p> <h2>Какие существуют мифы в сфере SEO? Опишем семь наиболее распространенных из них:</h2> <p>1. Гостевой постинг негативен для раскрутки сайтов. Один профессиональный оптимизатор описал злоупотребление гостевым постингом для получения внешних ссылок и сделал в конце вывод якобы о необходимости прекращения использования этого метода для раскрутки. То есть именно так многие восприняли эту информацию, не разобравшись, что речь идёт лишь о злоупотреблении, а не грамотном постинге на белых сайтах. То есть не стоит полностью отказываться от гостевого постинга.</p> <p>2. Соц.сети нивелируют необходимость продвижения сайта. Однако это не совсем так, поскольку именно посты в соцсетях могут улучшить ранжирование вашего сайта и повысить естественный трафик. Не нужно забывать и про оптимизацию, так как без неё продвигаться в ТОП поисковой выдачи невозможно.</p> <p>3. Исчезнут ссылочные сигналы. Многие владельцы стали думать, что ссылочные сигналы не влияют на ранжирование сайтов, поэтому просят у компании Google найти достойную альтернативу для продвижения в ТОП. Такое мнение было подтверждено заявлением Яндекса о прекращении использования ссылочных сигналов. Однако на самом деле входящие ссылки по-прежнему остаются одним из самых сильных инструментов для продвижения сайта. При этом стоит учитывать не количество ссылок, а их качество. Т.е. не стоит покупать ссылки сотнями, но при этом если авторитетный сайт ссылается на ваш сайт — это однозначный положительный сигнал для поисковых систем.</p> <p>4. Нужно использовать в тексте как можно больше ключевых слов. Если в начале становления поисковых систем этот метод и имел эффекта, то в настоящее время большое количество ключевых слов в небольшой статье считается спамом ключевых запросов и приводит к пессимизации (бану) сайта в поисковой выдаче. Простой пример - дорвейные сайты, у которых весь контент состоит из ключевых слов и анкорных ссылок. Такие сайты относятся к приемам черного seo и очень быстро исключаются из поисковой выдачи.</p> <p>5. В качестве фактора ранжирования применяется AuthorRank. Google ввела функцию поддержки авторов с целью синхронизации профиля и отслеживания контента, публикуемого в интернете. Однако этот инструмент влияет только для обеспечения собственной видимости на просторах сети. На ранжирование AuthorRank не оказывает влияния. То есть такая функция несёт пользу для повышения авторитета авторов, а также получения множества других бонусов (размещения собственной фотографии в профиле и её показов в поисковых системах).</p> <p>6. Проведение корреляционного анализа позволяет определить принципы ранжирования сайтов в Google. С момента получения доступа к статистическим данным о корреляционных факторах, оптимизаторы стали воспринимать этот факт, как демонстрацию работы алгоритма ранжирования. На самом деле данные лишь являются исследованиями корреляции, а не тестирования алгоритмов Google.</p> <p>7. Суть оптимизации заключается только в создании качественного контента. Миф создан оптимизаторами, которых постигли неудачи в области SEO. Отрицать влияние качества контента на ранжирование не нужно, но и пренебрегать другими инструментами для продвижения не стоит. Важно грамотно разработать структуру сайта в соответствии с семантическим ядром, поработать над <a href=\"/journal/article/kak-uskorit-zagruzku-sayta/\">скоростью работы сайта</a>, а также работать над удобством использования сайта (юзабилити).</p> <p>Вообще, каждый из этих мифов заслуживает по отдельной статье. Однако для оптимизаторов и владельцев сайтов важно получить всю необходимую информацию в сжатом виде, чтобы не допускать элементарных ошибок. Не нужно оперативно реагировать на мнения тех или иных авторитетных людей и менять стратегию, так как и им свойственно допускать ошибки. Однако если есть проблемы с реализацией планов развития, то нужно её кардинально пересмотреть.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "В чем различия между HTTP и HTTPS",
          "link": "https://sweb.ru/journal/article/v-chem-razlichiya-mezhdu-http-i-https/",
          "turbo:topic": "В чем различия между HTTP и HTTPS",
          "turbo:source": "https://sweb.ru/journal/article/v-chem-razlichiya-mezhdu-http-i-https/",
          "turbo:content": {
            "#cdata-section": " <header><h1>В чем различия между HTTP и HTTPS</h1><figure><img src=\"https://s.sweb.ru/img/news/e4e0151d2b7515faad60de3c1dd4d7ee.png\"></figure><h2></h2></header><p>HTTPS и HTTP – два протокола, с помощью которых передается информация в Интернете. Они предназначены для передачи текстовых данных между клиентом и сервером, а главное различие между ними – в наличии и отсутствии шифрования передаваемых данных.</p> <p>Важной задачей владельца сайта является обеспечение безопасности при передаче информации и ее сохранности. Передача данных по протоколу&nbsp;HTTPS является таким решением.</p> <h2>Что такое HTTP — особенности протокола</h2> <p>HTTP представляет собой прикладной протокол 7 уровня. Действие осуществляется в следующем порядке: клиент направляет запрос к серверу расположения ресурса, протокол форматирует данные нужным образом и предоставляет результат, затем браузер отображает полученные данные. В общем, HTTP – это набор правил передачи информации между браузером пользователя и сервером сайта. В основе его работы находится существующая клиент-серверная передача данных:</p> <ul> <li>Пользователь составляет и вводит запрос</li> <li>Серверное программное обеспечение обрабатывает запрос, систематизирует его, преобразует, а далее отправляет пользователю.</li> </ul> <p>В настоящее время HTTP протокол считается основным фактором нормальной работы интернета, обеспечивая передачу информации между серверами и браузером пользователя. К его достоинствам относятся:</p> <ul> <li>Простота в использовании;</li> <li>Быстрый обмен данными, у HTTP передаваемый объем меньше, чем у HTTPS;</li> <li>Популярность данного протокола и его распространенность.</li> </ul> <p>Но есть один момент. Ресурсы с HTTP в основном используются в информационных и развлекательных сайтах, где безопасность данных не столь существенный вопрос, вследствие чего к нему меньше доверия клиентов.</p> <h2>Что такое HTTPS — достоинства и характеристики</h2> <p>HTTPS поддерживает шифрование с повышенным уровнем безопасного обмена данными. Домены,&nbsp;на которых установлен&nbsp;SSL-сертификат, являются платформой для применения данного расширения. Технологии для шифрования применяются во всех этапах обмена информации. Преимущества следующие:</p> <p>1. Гарантированная безопасность — это решающий фактор при работе с конфиденциальными и финансовыми инструментами. Все ресурсы, работающие с&nbsp;обработкой персональных и финансовых данных работают по протоколу HTTPS;</p> <p>2. Защита от хакерских атак, направленных на прослушивание соединения;</p> <p>3. Поисковые системы настоятельно рекомендуют всем ресурсам перейти на HTTPS протокол;</p> <p>4. Скорость загрузки данных практически одинакова с показателем HTTP. Безопасность важнее, чем&nbsp;несущественный прирост скорости передачи данных.</p> <p>По протоколу&nbsp;HTTPS в большинстве случаев работают: интернет-магазины, сервисы-кэшбэк, платежные ресурсы с электронными кошельками, различные финансовые подразделения, транспортные предприятия, государственные сайты и другие подобные ресурсы.</p> <p>На данный момент, фактически, использование HTTPS с сертификатом SSL — стандарт «де-факто» практически для любого сайта.</p> <h2>Различия SSL сертификатов</h2> <p><a href=\"/ssl/\">SSL-сертификаты</a> имеют несколько разновидностей. Они классифицируются следующим доверительным факторам:</p> <p>1. Проверка в упрощенном виде — DV (domain validation). Подтверждение права на пользование доменом. Обычно такой сертификат можно получить бесплатно.</p> <p>2. Стандартная проверка OV (organization validation). Кроме права на владение доменом, подтверждается фактическое существование организации.</p> <p>3. Расширенная проверка EV (extended validation). Подтверждает большую степень доверия – к перечисленным выше факторам прибавляется правомерное осуществление работы компании.</p> <p>Применяя SSL-сертификат для ресурса, его владелец автоматически увеличивает степень доверия потенциальных клиентов и поисковиков. В момент загрузки страницы в адресной строке появляется надпись «Защищено» или «Secure» - клиенты уже знают, что данные не попадут к мошенникам. Помимо безопасности, переход на HTTPS способствует повышению позиций сайта в поисковой выдаче и предупреждает уход потенциальных клиентов к конкурентам.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как зарабатывают на покупке-продаже доменов",
          "link": "https://sweb.ru/journal/article/kak-zarabatyvayut-na-pokupke-prodazhe-domenov/",
          "turbo:topic": "Как зарабатывают на покупке-продаже доменов",
          "turbo:source": "https://sweb.ru/journal/article/kak-zarabatyvayut-na-pokupke-prodazhe-domenov/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как зарабатывают на покупке-продаже доменов</h1><figure><img src=\"https://s.sweb.ru/img/news/524da3308f5b2715663012339d491be9.png\"></figure><h2></h2></header><p>Доменное имя является основой для бизнеса в интернете. Поэтому любая компания не скупится хорошо заплатить за красивое сочетание в названии домена. Желательно, чтобы оно легко запоминалось и соответствовало направлению деятельности фирмы.</p> <h2>Как зарабатывают на покупке доменов</h2> <p>Есть два способа заработка на покупке-продаже доменов — <em>доменинг</em> и <em>киберсквоттинг</em>. Разберём первый из них.</p> <p><strong>Доменингом</strong> называется процесс регистрации доменного имени без использования брендов. То есть администратор придумывает или покупает доходный, по своему мнению, домен. После чего продаёт его со своей накруткой.</p> <p>Для заработка на перепродаже доменов не надо знать особые тонкости сетевых технологий. Достаточно понимания того, что домен дает доступ к интернет ресурсу путем ввода сочетаний символов в адресную строку.</p> <p>Более популярный вид заработка на доменах — это <strong>киберсквоттинг</strong>. Он подразделяется на несколько видов. Наиболее популярные из них это:</p> <ul> <li>Бренд-сквоттинг — создание имён домена на основе имени бренда, названия торговой марки.</li> <li>Тайп-сквоттинг&nbsp;— это&nbsp;подбор&nbsp;доменных имен, похожих на названия известных ресурсов. Умышленная опечатка рассчитана на рассеянных пользователей.</li> <li>Дроп-домены — покупка брошенных доменов. Тот случай, когда собственник домена не может продлить использование домена или забыл это сделать. Торговец может выкупить доменное имя и предложить прежнему владельцу по большей цене. В этом случае присутствует риск, что владелец отсудит весомую денежную компенсацию. Поэтому такой способ не является добросовестным.</li> </ul> <h2>Как создают, покупают и продают домены?</h2> <p>При создании домена достаточно придумать ему имя и проверить, не занято ли оно. В зависимости от того, какой домен и в какой зоне&nbsp; приобрел торговец, будут изменяться и цены на него.<br></p> <p>В таком бизнесе всё делается постепенно. Торговец присматривается к доменам, выбирает, регистрирует и учитывает финансовые вложения, которые потребуются при&nbsp;продлении пользования. Например, годовая стоимость регистрации домена .ru составит порядка 2-20 долларов. Значительно выше цена продаваемого домена, который востребован и его популярность стремительно растёт. Продать домен в зоне .ru можно за 400-1000 долларов.</p> <p>Самые дорогие домены — в зоне .com. Цена некоторых из них превышает 1 млн.долларов.</p> <h2>Какие хитрости нейминга и продажи доменов используют торговцы</h2> <p>Часто домейнеры пользуются тем, что поисковики автоматически меняют языковую раскладку, и создают копию популярного домена на латинице.</p> <p>Не все ставят точку после www. Этот момент подталкивает торговцев создать соответствующее начало имени домена.&nbsp;<br>Также они создают двойные имена, состоящие из названий популярных фирм, на случай, если компании в будущем объединятся.</p> <p>Домейнеры умеют определять перспективность того или иного имени домена. Для этого они регулярно изучают востребованность различных тематик в интернете, всегда в курсе последних новостей и мировых тенденций.</p> <p>Многие торговцы обходят стороной имена, созвучные с названиями известных государственных структур или брендов, во избежание недоразумений. Опытный торговец не будет скупать все домены подряд, не анализируя их. В противном случае, через год-два такие домены могут быть&nbsp;заброшены, и он понесёт убытки.</p> <p>Таким образом, данный вид заработка действительно может оказаться прибыльным, но и довольно рискованным занятием, способным вылиться в массу проблем.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Топ 10 плагинов Wordpress по версии SpaceWeb",
          "link": "https://sweb.ru/journal/article/top-10-plaginov-wordpress-po-versii-spaceweb/",
          "turbo:topic": "Топ 10 плагинов Wordpress по версии SpaceWeb",
          "turbo:source": "https://sweb.ru/journal/article/top-10-plaginov-wordpress-po-versii-spaceweb/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Топ 10 плагинов Wordpress по версии SpaceWeb</h1><figure><img src=\"https://s.sweb.ru/img/news/21df17ec2bdf40cb434cc946ee118c59.png\"></figure><h2></h2></header><p>Wordpress является популярной и довольно гибкой системой, которую легко трансформировать из блога в автоматизированный сервис, социальную сеть или маркетплейс. Стандартная сборка Wordpress подразумевает использование этой CMS для создания блога, однако все многообразие плагинов в официальном каталоге расширяет границы и пользователи CMS делают из нее собственную экосистему.</p> <p>Новички устанавливают огромное количество плагинов, даже не задумываясь о последствиях.</p> <p><q>- Вроде эта функция на сайте мне нужна, но это не точно!</q></p> <p>Иногда достаточно всего нескольких плагинов, чтобы повысить нагрузку на хостинг, что может привести к снижению скорости обработки хостингом скриптов плагинов и запросов от пользователей. Стоит ли при этом говорить, что большое количество подключенных к Wordpress плагинов и большая посещаемость сайта — вещи несовместимые?&nbsp;</p> <p>Именно поэтому мы собрали список проверенных и популярных Wordpress плагинов, функционала которых в большинстве случаев достаточно и которые с легкостью заменят вам десяток другой бесполезных плагинов с одиночными функциями.</p> <h2>Бесплатный плагин для создания интернет-магазина на Wordpress&nbsp;</h2> <p><img src=\"https://s.sweb.ru/img/news/9485ddfb42b6fb614dc41ff5947a9291.jpg\"></p><p><strong>WooCommerce</strong> считается лучшим плагином для интернет-магазина на wordpress с открытым исходным кодом. Плагин не требует особенных знаний, очень гибкие и простые настройки позволят вам развернуть интернет-магазин в течение дня совершенно бесплатно.</p> <p>Плагин включает в себя следующие опции:</p> <ul> <li>Настройка дизайна магазина;</li> <li>Страницы для товаров, корзина покупок и оформление заказов;</li> <li>Защищённые онлайн платежи с помощью банковской картой и других платежных систем, в том числе оплата наличными курьеру;</li> <li>Настройка правил для доставки;</li> <li>Объединение контента и торговли на своем сайте с помощью модульных блоков;</li> <li>Автоматический расчёт налогов;</li> <li>Возможна интеграция с Google Analytics, MailChimp и Facebook;</li> <li>Основная панель интернет-магазина оснащена ключевыми метриками.</li> </ul> <p>Интерфейс плагина легко расширить за счет открытого кода и дополнительных расширений. Также обладает приложением для Android и iOS, с помощью которого можно контролировать работу интернет-магазина с мобильного устройства.</p> <h2>Бесплатный плагин для ускорения сайта на Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/fdc5363c52e6609d26c7a883eaf4ab43.png\"></p><p>Плагин <strong>Autoptimize</strong> предоставляет огромный набор инструментов для оптимизации вашего сайта, некоторые принципы которой были описаны <a href=\"/journal/article/kak-uskorit-zagruzku-sayta/\" title=\"\" target=\"\">в нашей статье</a>.</p> <p>Autoptimize позволяет выполнить следующие настройки:</p> <ul> <li>Минифицировать размер html, css, javascript кода, при этом объединить их в один файл для быстрой загрузки;</li> <li>Отложить загрузку css стилей и выполнение js скриптов, которые блокируют отрисовку контента и увеличивают время загрузки страницы;</li> <li>Вставить критический css. Иными словами только те стили, которые необходимы для отрисовки страницы, что позволяет уменьшить время загрузки страницы до 1 секунды;</li> <li>Уменьшить размер имеющихся на странице изображений и отложить их загрузку до полной прорисовки самой странице.</li> </ul> <p>И еще с десяток полезных функций, которые помогут повысить производительность CMS WordPress и уменьшить скорость загрузки страниц сайта. При грамотной настройке,&nbsp; Autoptimize позволяет в несколько раз улучшить показатели вашего сайта. Подключение и настройку каждой опции делайте по очереди. Перед оптимизацией обязательно сделайте <a href=\"/journal/article/4-prichiny-sdelat-bekap-sayta/\" title=\"\" target=\"\">бэкап</a>.</p> <h2>Социальная сеть на Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/702e19badfe59fe2488c673678d814c5.png\"></p><p>Плагин BuddyPress — это набор компонентов, позволяющий сделать из вашего блога на Wordpress масштабируемую социальную сеть.</p> <p><strong>BuddyPress</strong> добавляет на ваш WordPress сайт следующие функции:</p> <ul> <li>Общая лента новостей в которой отображаются обновления, посты и прочая активность друзей и групп;</li> <li>Расширение стандартных профилей Wordpress. В профиль интегрируются лента новостей, список друзей, группы, подробную информацию о профиле (биография), контакты и т.д;</li> <li>Добавление пользователей сайта в друзья;</li> <li>Обмен личными сообщениями между пользователей;</li> <li>Создание и вступление в группы по интересам.</li> </ul> <p>Также доступны дополнительные для подключения аддоны, которые позволяют еще больше расширить вашу социальную сеть, например сделать доску объявлений от пользователей или ввести систему баллов.</p> <h2>Лучший SEO-плагин для Wordpress&nbsp;</h2> <p><img src=\"https://s.sweb.ru/img/news/433e9e5b71c4f2ca681247af28ddba86.jpg\"><br></p><p><strong>Yoast SEO</strong> славится анализом seo-контента и является одним из ведущих seo-плагинов для wordpress, который установили уже более 5 миллионов раз.</p> <p>Основные возможности плагина:</p> <ul> <li>Выявлять seo-проблемы на сайте;</li> <li>Получать рекомендации по seo-улучшению вашего текста;</li> <li>Анализировать читабельность ваших текстов. Это поможет улучшить структуру и стили текста;</li> <li>Указывать ключевое содержимое на Wordpress сайте и выполнять по нему фильтрацию;</li> <li>Настраивать отображение сниппетов в поисковых выдачах для каждой записи и страницы;</li> <li>Предлагает для каждого текста ссылки на другие записи (перелинковка);</li> <li>Генерирует карту сайта.</li> </ul> <p>Перед применением настроек обязательно изучите инструкцию и изменяйте опции только при наличии понимания их назначения.</p> <h2>Перевод тем и плагинов на Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/ae6cdafe3b40b97d24a4d8382cd61587.png\"></p><p>Плагин <strong>Loco translate</strong> позволяет переводить с других языков плагины и темы на родной язык.&nbsp;</p> <p>Вам не нужно будет искать нужные слова в коде, вы просто заходите в Loco translate, выбираете плагин или тему и получаете для них список слов, каждое из которых вы можете перевести в один клик.&nbsp;</p> <h2>Плагин безопасности Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/d2c19fabf15f9b715dadc2a83307839c.jpg\"></p><p>Плагин <strong>Wordfence</strong> создан для настройки безопасности Wordpress, <a href=\"/journal/article/kak-zaschitit-svoy-sayt-ot-vzloma/\" title=\"\" target=\"\">защиты сайта от взлома</a>, а также&nbsp;включает сканер вредоносных скриптов. База сигнатур вредоносных скриптов и ip-адресов регулярно обновляется.</p> <p>Брандмауэр Wordfence определяет и блокирует доступ к сайту ip-адресам с плохой репутацией/ботам.</p> <p>Встроенный сканер блокирует запросы, содержащие вредоносный код, а также анализирует ядро Wordpress, темы и плагины на наличие вредоносных скриптов, подозрительных URL-адресов, бэкдоров, SEO-спама, редиректов и инъекций.</p> <p>Защищает админку от взлома методом перебора паролей с помощью ограничения количества попыток на входу в систему.</p> <p>Проверяет ваш сайт на наличие известных уязвимостей в системе безопасности и предупреждает Вас о любых проблемах.</p> <p>В админке плагина представлены результаты анализа системы и статистика блокировок ботов в режиме реального времени.</p> <h2>Конструктор страниц на Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/fa8b6a6facd1f20c9a087a678f3335e6.jpg\"></p><p>Не умеете работать в Wordpress? Плагин <strong>Elementor</strong> добавляет в ваш Wordpress функционал конструктора, благодаря которому вы сможете без труда собирать уникальные структуры для страниц. Плагин предлагает более 100 готовых для работы шаблонов, 300 различных по назначению блоков для страниц и 30 виджетов. Является самым популярным решением на wordpress для конструирования страниц сайта.</p> <h2>Система комментариев для Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/167d298d27730df3e668c82f312b53fb.png\"></p><p><strong>Disqus</strong> — система комментариев, которая предоставляет возможность оставлять комментарии через популярные сервисы Facebook, Twitter, Google. Достаточно зарегистрировать аккаунт в системе Disqus аккаунт и установить плагин. При этом оставленные до установки плагина комментарии в Wordpress не будут удалены, плагин синхронизируется со стандартной системой комментариев Wordpress.</p> <h2>Шорткоды для Wordpress&nbsp;</h2> <p><img src=\"https://s.sweb.ru/img/news/abd43762dc519dd65248a2752280d50b.png\"></p><p>Плагин <strong>Shortcodes Ultimate</strong> представляет собой библиотеку из +50 визуальных элементов, которые вы можете использовать на страницах сайта, в боковых виджетах и даже в коде файлов темы. Используя плагин вы без труда создадите табы, аккордеоны, кнопки, карты, блоки, слайдеры и карусели, таблицы, видео и не только! Плагин совместим с большинством тем, а добавление элементов происходит в один клик.&nbsp; Используйте готовые оптимизированные элементы вместо написания кода собственных.&nbsp;</p> <h2>Классический редактор страниц Wordpress</h2> <p><img src=\"https://s.sweb.ru/img/news/539542c9c7e306972cefb560e93bfd81.png\"><br></p><p>Плагин Classic Editor представляет собой официальное дополнение от разработчиков WordPress, который возвращает возможность использовать классический редактор и панель инструментов редактирования записей. На данный момент плагин установили более 5 миллионов пользователей wordpress, что говорит&nbsp; об актуальности использования старой версии панели в новых версиях wordpress. По словам разработчиков, плагин будет обновляться до 2022 года.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как ускорить загрузку сайта?",
          "link": "https://sweb.ru/journal/article/kak-uskorit-zagruzku-sayta/",
          "turbo:topic": "Как ускорить загрузку сайта?",
          "turbo:source": "https://sweb.ru/journal/article/kak-uskorit-zagruzku-sayta/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как ускорить загрузку сайта?</h1><figure><img src=\"https://s.sweb.ru/img/news/eca2ddbe491d29304ebe8f379a4f28df.png\"></figure><h2></h2></header><p style=\"font-weight:bold;\">Знаете ли вы, что ваш сайт может подгружать свыше 90% неиспользуемых на странице css-стилей и javascript кода?</p> <p style=\"font-weight:bold;\">Это приводит к тому, что:</p> <ul> <li>Веб-страница больше весит;</li><br><li>Страница медленнее прорисовывается;</li><br><li>Дольше загружается;</li><br><li>Уменьшается время нахождения посетителей на сайте;</li><br><li>Ухудшаются позиции сайта в поисковых системах.</li><br> <p>Данная проблема распространена при использовании общего css-файла для всех страниц сайта или любой CMS, к которой вы подключаете плагины или модули, добавление которых приводит к появлению дополнительный css-стилей.</p> <p>Простой пример: есть сайт \"site.ru/index.php\" с лендингом на главной странице, рассказывающем о преимуществах компании. У этого сайта есть личный кабинет на отдельной странице \"site.ru/cabinet.php\".</p> <p>Распространенная ошибка на основе примера: главная страница сайта имеет свою структуру и набор необходимых для работы стилей/js скриптов, а личный кабинет имеет другой необходимый для нормальной работы набор. Ошибка заключается в том, что большинство сайтов подгружают все css стили и все js файлы сайта вне зависимости от типа страницы. То есть главная страница сайта может подгружать лишние стили и скрипты, предназначенные для страницы личного кабинета, а это приводит к многократному увеличению веса главной страницы сайта и последующим неблагоприятным последствиям, вплоть до неправильной работы сайта. <br><br>Даже такой гигант, как vkontakte&nbsp; (см.скриншот) до сих пор работает с этой ошибкой. Колонка \"Unused Bytes\" показывает нам проценты неиспользуемого кода каждого из подгружаемых файлов.</p><p><img src=\"https://s.sweb.ru/img/news/dfac25f79f399dc5bb478da0861533c3.png\"><br></p> <h2>Почему так происходит?</h2> <p>К примеру, классическая сборка Wordpress использует одинаковый header.php (шапку) для всех страниц сайта, в который через functions.php (функции темы) подключаются все css и js файлы сайта.</p> <p>Лучше всего для каждой страницы сайта в теге <head>&nbsp;указывать пути только к необходимым для этой страницы css файлам, а пути к js файлам по возможности вынести перед закрывающим тегом </body>. К примеру, для Wordpress нужно будет создать отдельные шаблоны (header.php и footer.php) для различающихся страниц. Но если у вас таких «различающихся» страниц десятки, а то и сотни? На это потребуется довольно много времени...</p> <h2>Ускоряем CSS и JS</h2> <p>1) Нужно понять, какие из css стилей используются для большинства страниц сайта и подгружать их в первую очередь&nbsp;→ Critical css. Следует сформировать «критический css» и минифицировать его вес (можно с помощью сервиса: <a href=\"https://pegasaas.com/critical-path-css-generator/\" rel=\"nofollow\" target=\"_blank\">https://pegasaas.com/critical-path-css-generator/</a>).</p> <p><br></p> <p>2) Выполнить отложенную загрузку css стилей,&nbsp; в которых нет необходимости для прорисовки страницы сайта.&nbsp;<br>Для этого в коде сайта нужно&nbsp;заменить rel=«stylesheet» на rel=«preload» для тех стилей, которые должны прорисовываться в первую очередь, а для всех остальных добавить тег <link> событие Onload, которое подгрузит стили после полной загрузки страницы.</p> <p><br></p> <p>3) Выполнять асинхронную загрузку JavaScript, добавив атрибут async или defer.</p> <p>&nbsp;Скрипт с атрибутом async выполнится при первой же возможности после его полной загрузки.</p><p><img src=\"https://s.sweb.ru/img/news/6540fb1a3659cf0912527c4581675ac9.png\"><br></p><p><br></p> <p>Скрипт с атрибутом defer выполнится после полной загрузки страницы.</p><p><img src=\"https://s.sweb.ru/img/news/b11a89b4cc74e32376f50304382f0b48.png\"><br></p><p>Надеемся, использование вышеописанных действий поможет вам оптимизировать сайт, улучшить скорость загрузки страниц сайта и повысить его производительность.<br> <b>Перед внесением изменений обязательно сделайте бэкап сайта!</b></p> <p>Для контрольной проверки оптимизации сайта используйте:</p> <p>Инструмент от Google «Pagespeed insights»:&nbsp;&nbsp;<a href=\"https://developers.google.com/speed/pagespeed/insights/\" rel=\"nofollow\" target=\"_blank\">https://developers.google.com/speed/pagespeed/insights/</a></p> <p>Или популярный инструмент среди зарубежных разработчиков «Gtmetrix»:&nbsp;<a href=\"https://gtmetrix.com/\" rel=\"nofollow\" target=\"_blank\">https://gtmetrix.com/</a></p></ul><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Сравнение конструкторов сайтов",
          "link": "https://sweb.ru/journal/article/sravnenie-konstruktorov-saytov/",
          "turbo:topic": "Сравнение конструкторов сайтов",
          "turbo:source": "https://sweb.ru/journal/article/sravnenie-konstruktorov-saytov/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Сравнение конструкторов сайтов</h1><figure><img src=\"https://s.sweb.ru/img/news/236f5c9f4f4751d50c3c04d85d744f7c.png\"></figure><h2></h2></header><p>В наше время собственный сайт — это уже не нечто запредельно дорогое и недоступное для обычного пользователя.</p> <p>Если раньше для создания сайта нужно было искать сотрудников, платить им зарплаты, отслеживать рабочий процесс и сталкиваться с разными рода ситуациями, из-за которых проект может быть под угрозой, то современные конструктор сайта весьма упрощает процесс и экономит время и, конечно, деньги.</p> <p>Конструктор сайтов (англ. <i>site builder</i>) — система для создания сайтов без знания языков программирования. Создать сайт можно как на отдельном сервисе-конструкторе, так и у хостинг провайдера, при наличии услуги \"Конструктор сайтов\".</p> <h2>Преимущества и недостатки создания сайта на конструкторе</h2> <p><img src=\"https://s.sweb.ru/img/news/a86b37d0beee7daaa04fa2aafbe81fe4.jpg\"><br></p><p>Основным преимуществом конструктора является его доступность для пользователя любого уровня подготовки. Таким образом некоторые конструкторы завоевывают популярность ориентируясь на широкую аудиторию, в которую могут входить даже люди, далекие от IT.</p> <p>Нельзя забывать о том, что стоимость создания сайта на конструкторе сравнительно ниже, чем классическая разработка. То есть преимущество доступности таким образом еще и распространяется на стоимость. Низкая цена, а зачастую и вовсе бесплатный тариф не могут не повлиять на решение в пользу создания сайта на конструкторе.</p> <p>Кроме того, контрукторы сайтов прекрасно подходят для тестирования идей и для рекламирования. Сделать сайт и показать клиентами свои товары или услуги можно в рекордно низкие сроки — даже не профессионал может сделать неплохой сайт за 1-2 вечера.</p> <p>Однако, и недостатки данной системы не стоит умалять. Конструктор сайта предполагает создание страницы по уже готовым шаблонам, то есть, вы вполне можете наткнуться на просторах интернета на похожий на ваш сайт. Это вовсе не означает, что если вам необходима уникальная страница с какими-либо индивидуальными задумками, то стоит задуматься о написании сайта или заказе его у специалистов.</p> <p>В некоторых конструкторах на минимальных тарифах присутствует реклама. То есть пользователи вашего сайта будут видеть встроенную рекламу от конструктора. Также зачастую так бывает, что если вы создали сайт на одном из популярных сервисов, то, возможно, этот сервис не «отпустит» ваш сайт, вы не сможете его перенести или выгрузить.</p> <h2>Популярные сервисы - конструкторы сайтов</h2> <br> <ul style=\"width: 100%;\"> <li>WIX</li> <li>uCoz</li> <li>Nethouse</li> <li>uKit</li> <li>Tilda</li> </ul> <p>Помимо сервисов, которые предоставляют исключительно услуги конструктора, данная возможность существует и у многих крупных компаний, которые представляют клиентам возможность создания сайта среди прочих услуг. К таким компаниям относятся крупные хостинг-провайдеры и регистраторы доменов, такие как SpaceWeb.</p> <p>Несмотря на то, что у таких компаний услуга конструктора не является основной, она довольна популярна среди их клиентов, т.к. они доверяют компании за ее техническую поддержку, надежность и солидность.</p> <p>Хостинг провайдер SpaceWeb предоставляет клиентам возможность <a href=\"/site-constructor/\">создать сайт на конструкторе совершенно бесплатно</a>. Даже базовый бесплатный тариф включает десятки шаблонов для создания сайта под любую тематику, а также место на диске, отсутствие рекламы и возможность экспорта сайтов.</p> <h2>Как решить, на каком конструкторе создать сайт?</h2> <p><img src=\"https://s.sweb.ru/img/news/4af7eb051f493ceabcb0f5d878667d26.jpg\"><br></p><p>Для начала необходимо четко определиться с тематикой будущего сайта и решить, на какую аудиторию и посещаемость ваш проект рассчитан. Будете ли вы освещать последние события, рассказывать о своих путешествиях или продавать товары/торты/инструменты?</p> <p>Как правило тарифы конструктора как раз зависит от того, что планируется создавать и для кого. Сайт-визитка или простой каталог могут быть созданы на любом конструкторе, даже на бесплатном тарифе. Главное, чтобы вы выбрали удобный вам функционал.</p> <p>При создании интернет-магазина стоит определиться с размером сайта, с предполагаемым количеством посетителей, количество размещаемых товаров, способами оплаты. Возможность создать интернет-магазин предоставляет далеко не каждый конструктор.</p> <p>Надеемся, наша статья помогла вам разобраться в типах конструкторов сайтов.</p> <p>Сайт на конструкторе — это быстро и удобно, а также не требует навыков программирования и самое главное — это недорого и минимизирует затраты по времени. Высвободившиеся ресурсы вы сможете потратить на рекламу вашего сайта, выбор запоминающегося <a href=\"/domains/\">доменного имени</a> и работу с клиентами.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "4 причины сделать бэкап сайта",
          "link": "https://sweb.ru/journal/article/4-prichiny-sdelat-bekap-sayta/",
          "turbo:topic": "4 причины сделать бэкап сайта",
          "turbo:source": "https://sweb.ru/journal/article/4-prichiny-sdelat-bekap-sayta/",
          "turbo:content": {
            "#cdata-section": " <header><h1>4 причины сделать бэкап сайта</h1><figure><img src=\"https://s.sweb.ru/img/news/80c03268d8cf41923165e99495af4887.png\"></figure><h2>и застраховать себя от потерь</h2></header><p><strong>Бэкап</strong> — это ручное или ав ",
            "#cdata-section5": " томатическое дублирование информации с целью последующего восстановление данных в случае их повреждения или полного уничтожения. В рамках <a href=\"/hosting/\">услуг хостинга</a> можно обозначить два вида бэкапов. Первый — это бэкап файлов сайта, а второй — это бэкап базы данных, в связке с которой работает сайт. Давайте рассмотрим случаи, когда рекомендуется создавать резервную копию файлов сайта и базы данных.</p> <h2>Плановое резервное копирование</h2> <img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/4406c6e741804bf3e3cefae36f09cc8a.png\"><p>В качестве создания контрольной точки для восстановления информации. Бывают случаи, когда самая надежная система дает сбой. По этой причине необходимо всегда иметь рабочую версию сайта. Тем самым, при возникновении форс-мажорной ситуации, вы всегда будете иметь под рукой спасительный бэкап, который поможет восстановить работоспособную версию сайта.</p> <h2>Перед внесением изменений</h2> <p>Например при обновлении ядра CMS, модулей, плагинов, компонентов. Если вы решили внести какие-либо изменения на сайте, то в этом случае также рекомендуется сохранить резервную копию файлов и базы данных. Нужно это для того, чтобы в случае появления ошибок, которые могут возникнуть в ходе обновления сайта, можно было оперативно восстановить рабочую версию сайта.</p> <h2>При доработках на сайте</h2> <img style=\"max-width:800px; \" src=\"https://s.sweb.ru/img/news/00ce1196410fb58229a8784310961fde.jpg\"><p>В случае если на сайте проводятся плановые работы, также настоятельно рекомендуется сохранять резервную копию файлов или таблиц базы данных, на которых проводятся такие работы. Например, вы решили отредактировать системный файл сайта, добавив туда новый функционал. В случае, если вы совершите ошибку при условии, что резервная копия файла была заранее сохранена, вы сможете оперативно выполнить восстановление рабочей версии файла. Также вам стоит сделать бэкап сайта, если сайт дорабатывается сторонними специалистами.</p> <h2>Для защиты сайта</h2> <p>Если ваш сайт подвергся хакерской атаке, то при малейшем подозрении на взлом, необходимо сохранить резервную копию сайта и базы данных. Это необходимо потому, что вредоносный код в дальнейшем может вызвать частичный отказ в работе функционала сайта, а в некоторых случаях привести к полой потере данных. Во всех перечисленных случаях при наличии бэкапа сайта и базы данных можно избежать потери информации тем самым избавив вас от лишних трат времени и средств на восстановление работоспособности сайта.</p> <h2>Бекап на хостинге SpaceWeb</h2> <img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/367377f9422a858790f848ccd405c6e8.png\"><p>Как сделать бэкап сайта? На хостинге SpaceWeb резервные копии файлов и баз данных MySQL <strong>создаются автоматически каждый день</strong>.</p> <p>В панели управлени хостингом в разделе «Бэкапы» вы можете просмотреть все имеющиеся резервные копии за последние 7 дней, и, при необходимости, восстановить данные из них, либо выложить архив с резервной копией на аккаунт. <em>Примечание</em>: рекомендуем регулярно использовать функцию \"выложить архив с резервной копией на аккаунт\". Таким образом у вас будут более старые резервные копии, а не только за последние 7 дней.</p> <p>Восстановить сайт из бэкапа, автоматически созданного на хостинге, можно за один клик — достаточно выбрать дату и необходимые папки или базы данных.</p><img src=\"https://s.sweb.ru/img/onboardbnrs/c8c8340532e73ff0ba66258e5304efdb.png\" /><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Кросспостинг в социальные сети",
          "link": "https://sweb.ru/journal/article/krossposting-v-sotsialnye-seti/",
          "turbo:topic": "Кросспостинг в социальные сети",
          "turbo:source": "https://sweb.ru/journal/article/krossposting-v-sotsialnye-seti/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Кросспостинг в социальные сети</h1><figure><img src=\"https://s.sweb.ru/img/news/a6c656b2041c7e3df6d5da2871ce2ae7.png\"></figure><h2>Получай трафик из социальных сетей в автоматическом режиме!</h2></header><h2>Что такое кросспостинг?</h2> <p><strong>Кросспостинг</strong> – автоматическое, полуавтоматическое или ручное размещение анонсов в социальных сетях и блогах на материалы сайта с указанием ссылки.</p> <p><strong>Цель</strong>: Автоматизация наполнения контентом социальных сетей/блогов с целью привлечения дополнительного трафика.</p><h2>Преимущества кросспостинга</h2><img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/29df59aef171593ef234786c7940d275.jpg\"> <ol> <li>Экономия времени при написании постов. Автоматический кросспостинг позволяет быстро публиковать ссылки на статьи с анонсом одновременно в несколько социальных сетей и блогов даже без участия редактора.</li> <li>Среди SEO-специалистов бытует мнение, что публикация ссылки в соц.сетях позволяет быстрее индексировать содержимое по ссылке поисковыми роботами. Именуется это социальными сигналами.</li> <li>Вы можете составить контент-план на ближайшую неделю или месяцы для своих социальных сетей и запланировать посты. В соответствии с контент планом посты будут опубликованы по расписанию, все что вам остается — это выполнять функцию модератора и анализировать статистику.</li> <li>Перегон трафика из социальных сетей и блогов к себе на сайт. Стоит понимать, что раскручивая \"свою\" группу вконтакте и вкладывая в нее ресурсы, есть риск однажды ее потерять (при несоблюдении правил Вконтакте). Потому так важно держать активную аудиторию на своем сайте и использовать различные каналы для привлечения трафика именно на сайт и для увеличения продаж.</li> </ol> <h2>Кому подходит кросспостинг?</h2> <p>Инструменты кросспостинга в социальных сетях и блогах отлично подходят тем, кто имеет:</p> <ul> <li>Проект с небольшим бюджетом, тематика которого тесно связана с привлечением клиентов из социальных сетей (салон красоты, доставка еды, продажа одежды и другие);</li> <li>Проекты, которые не получается развить в социальных сетях из-за нехватки времени. Использование кросспостинга позволяет в любой момент перейти к активному продвижению и продажам в социальных сетях уже с теплой аудиторией;</li> <li>Для любой компании развитие в социальных сетях означает быть в тренде. Обратите внимание, как популярные журналы Forbes и vc.ru используют кросспостинг анонсов статей, увеличивают активность в группах и получают дополнительный бесплатный трафик к себе на сайт.</li> </ul> <h2>Как правильно использовать кросспостинг?</h2> <img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/55be5925f5a39530bf20be79e250eeeb.jpg\"><p>Учитывайте особенности каждой социальной сети и адаптируйте под них контент. Подберите интересный именно вашим пользователям тип контента (текст/видео/фото), частоту публикаций, отношение к внешним ссылкам и т.д.</p> <p>При косспостинге важно публиковать <strong>уникальный короткий анонс</strong>. Опубликовав новость полностью, вы рискуете потерять авторство, так как ее может украсть другой пользователь или поисковая система присвоит авторство текста вашей странице в социальной сети, а не вашему сайту.</p> <p>Текст анонса должен быть волнующим/интригующим и иметь четкий призыв к переходу по ссылке для продолжения чтения.</p> <p>При косспостинге важно поддерживать активность на площадках. Чтобы не создавалось впечатления, что сообщество в социальной сети ведет бот. Кроме этого необходимо регулярно улучшать качество контента, получать обратную связь от подписчиков, общаться с ними и отслеживать реакцию на ваши публикации.</p> <p>Старайтесь фильтровать свои посты и выкладывать только действительно актуальный материал. Спам постами не добавит позитивную репутацию вашему сообществу.</p> <h2>Как сделать кросспост бесплатно?</h2> <p>Используйте встроенные инструменты в социальных сетях.</p> <p>В настройках аккаунта или сообщества в социальных сетях есть бесплатный функционал для кросспостинга. Например встроенным инструментом можно сделать кросспостинг из Инстаграм в вконтакте, однаклассники, твиттер, фейсбук, Tumblr. Или можно настроить обмен постами между Вконтакте и Twitter.</p> <p><img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/77164ec3366510ca016c2373b378db3a.jpg\" alt=\"Вариант бесплатного кросспостинга в социальные сети\"></p> <p>Плюс данного метода в том, что вы можете быстро настроить экспорт из одной социальной сети в другую не имея технических навыков.</p> <p>Минус данного метода в том, что у каждой соц сети свои инструменты для экспорта постов и ограниченный выбор платформ для интеграции. Если есть необходимость в ведение большого количества социальных сетей, лучше воспользоваться специальными сервисами.</p> <h2>Кросспостинг с помощью онлайн-сервисов</h2> <p>В сети полно сервисов, способных качественно выполнить кросспостинг в Фейсбук, Инстаграм, Одноклассники, YouTube, Вконтакте, Twitter, Telegram, Вайбер, Тамблер, Пинтерест и Мой Мир.</p> <p>Большим плюсом этого решения являются удобные панели управления, позволяющие сделать кросспостинг в популярные социальные сети с адаптацией контента, встроенные фоторедакторы, инструменты анализа активности, а также удобная система планирования. Возьмем несколько популярных сервисов и сравним их в таблице.</p> <p><img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/88e8dc7b496991a7477f030fc0cdb8af.jpg\" alt=\"Сравнение сервисов для кросспостинга контента\"></p> <h2>Кросспостинг Wordpress</h2> <p>Плагин Social Networks Auto Poster</p> <p>Если ваш сайт работает под управлением популярной CMS Wordpress, то для него существует отличное решение в виде плагина Social Networks Auto Poster, позволяющего сделать кросспостинг в выбранные социальные сети в один клик!</p> <p>Для кросспостинга доступны такие социальные сети, как Vkontakte, Facebook, Instagram, Twitter, Youtube, Pinterest, Reddit и еще более 10 зарубежных социальных сетей.</p> <p>В бесплатной версии плагина вы можете подключить к сайту по 1 сообществу для каждой социальной сети, чего вполне достаточно для большинства современных проектов.</p> <p><img style=\"max-width:800px;\" src=\"https://s.sweb.ru/img/news/3d213926c4f0f85cb2d941a4fa9f92f5.jpg\" alt=\"Плагин Wordpress для кросспостинга\"></p> <p>Для новичков настройка плагина может показаться сложной, поэтому следует воспользоваться инструкциями из свободного доступа.</p> <p>В следующем посте мы расскажем, что такое кросс-промоушен. Следите за обновлениями!</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Оптимизация работы с базой данных с помощью Memcached",
          "link": "https://sweb.ru/journal/article/optimizatsiya-raboty-s-bazoy-dannyh-s-pomoschyu-memcached/",
          "turbo:topic": "Оптимизация работы с базой данных с помощью Memcached",
          "turbo:source": "https://sweb.ru/journal/article/optimizatsiya-raboty-s-bazoy-dannyh-s-pomoschyu-memcached/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Оптимизация работы с базой данных с помощью Memcached</h1><figure><img src=\"https://s.sweb.ru/img/news/8a41537e84aee9b832c038e5b91fb310.png\"></figure><h2>Установка и настройка расширения PHP Memcached</h2></header><h2>Что такое Memcached?</h2> <p><b>Memcached</b> – это хранилище данных в памяти с открытым исходным кодом и возможностью масштабирования, используемое в качестве кэша или хранилища сессий и обеспечивающее время отклика на уровне долей миллисекунды.</p><p><i>Список поддерживаемых языков программирования</i>: Python, Java, PHP, C/C#/C++, Perl, Go, Ruby, JavaScript, Node.js.</p><p><i>Список поддерживаемых протоколов</i>: ASCII, Протокол передачи двоичных данных, TCP и UDP.</p><h2>Как работает Memcached?</h2><p>Memcached, в отличие от баз данных не нуждается в доступе к диску или твердотельному накопителю, а производит сохранение необходимых данных в оперативную память, тем самым исключает задержки, связанные с поиском этих данных и обеспечивает более быстрый доступ к ним.</p><h2>Оптимизация работы с базой данных с помощью Memcached</h2> <p>Предположим, нам необходимо сохранять некоторые временные данные, сохранность которых для нас не критична.&nbsp;Объем данных небольшой, но при этом мы вынуждены использовать большое количество запросов.&nbsp;Memcached-server для данной задачи подойдет как нельзя лучше.&nbsp;Для сравнения попробуем записать и прочесть 10000 строк в memcache и mysql:</p><div style=\" overflow-x: scroll; background: #42ecb114; padding: 8px; border: 1px solid #f1f1f1; margin: 15px;\"><br><font size=\"+1\" face=\"Helvetica, Arial, sans-serif\"><?php<br> </font><font size=\"+1\" face=\"Helvetica, Arial, sans-serif\">$start = microtime(true);<br> $memcache_obj = memcache_connect('unix:///home/u/</font><font size=\"+1\" face=\"Helvetica, Arial, sans-serif\"><font size=\"+1\" face=\"Helvetica, Arial, sans-serif\">user</font>/.memcached.sock', 0);<br> for ($i=0;$i<10000;$i++) {<br> &nbsp; memcache_set($memcache_obj, 'var_key'.$i, 'variable'.$i);<br> &nbsp; memcache_get($memcache_obj, 'var_key'.$i).\"\\n\";<br> }<br> $finish = microtime(true);<br> $delta_memcache = $finish - $start;<br> <br> $start = microtime(true);<br> $link = mysqli_connect('localhost', 'user', '***','</font><font size=\"+1\" face=\"Helvetica, Arial, sans-serif\"><font size=\"+1\" face=\"Helvetica, Arial, sans-serif\">user</font>');<br> <br> for ($i=0;$i<10000;$i++) {<br> &nbsp; mysqli_query($link,\"INSERT INTO test (var_key,variable) values ('var_key.$i','variable.$i')\");<br> &nbsp; $result = mysqli_query($link,\"SELECT variable FROM test WHERE var_key = 'var_key.$i' limit 1\");<br> &nbsp; $row = mysqli_fetch_row($result);<br> }<br> $finish = microtime(true);<br> $delta_mysql = $finish - $start;<br> <br> printf (\"\\n\\n\\tMemcached:\\t %s\\n\\tMySQL:\\t\\t %s\\n\\n\", $delta_memcache,$delta_mysql);<br> <br> ?></font></div><p><b>Замеряем время записи и чтения в секундах.</b><b><br></b><i>Memcached</i>: 0.36154913902283 (sec)</p><p style=\"margin-top:-15px;\"><i>MySQL:&nbsp;</i>20.56244802475 (sec)</p><p>Да, для mysql можно оптимизировать запрос, использовать иные движки для хранения и т.п., но все равно, Memcached-server, как сервис хранящий данные в оперативной памяти на основе хеш-таблицы будет выигрывать по скорости у реляционных баз данных всегда.</p><p><span lang=\"EN-US\" style=\"font-size:11.0pt;line-height: 115%;font-family:\"Tahoma\",\"sans-serif\";mso-fareast-font-family:Calibri; mso-fareast-theme-font:minor-latin;mso-ansi-language:EN-US;mso-fareast-language: EN-US;mso-bidi-language:AR-SA\">Memcached</span><span style=\"font-size:11.0pt; line-height:115%;font-family:\"Tahoma\",\"sans-serif\";mso-fareast-font-family: Calibri;mso-fareast-theme-font:minor-latin;mso-ansi-language:RU;mso-fareast-language: EN-US;mso-bidi-language:AR-SA\"> доступен<span style=\"color:#062436\"> на тарифах линейки \"</span></span><span style=\"font-size:11.0pt;line-height:115%; font-family:\"Calibri\",\"sans-serif\";mso-ascii-theme-font:minor-latin;mso-fareast-font-family: Calibri;mso-fareast-theme-font:minor-latin;mso-hansi-theme-font:minor-latin; mso-bidi-font-family:\"Times New Roman\";mso-bidi-theme-font:minor-bidi; mso-ansi-language:RU;mso-fareast-language:EN-US;mso-bidi-language:AR-SA\"><a href=\"https://sweb.ru/reactive-hosting/\"><span style=\"font-family:\"Tahoma\",\"sans-serif\"; color:#36BDF7\">Реактивный</span></a></span><span style=\"font-size:11.0pt; line-height:115%;font-family:\"Tahoma\",\"sans-serif\";mso-fareast-font-family: Calibri;mso-fareast-theme-font:minor-latin;color:#062436;mso-ansi-language: RU;mso-fareast-language:EN-US;mso-bidi-language:AR-SA\">\" и \"</span><span style=\"font-size:11.0pt;line-height:115%;font-family:\"Calibri\",\"sans-serif\"; mso-ascii-theme-font:minor-latin;mso-fareast-font-family:Calibri;mso-fareast-theme-font: minor-latin;mso-hansi-theme-font:minor-latin;mso-bidi-font-family:\"Times New Roman\"; mso-bidi-theme-font:minor-bidi;mso-ansi-language:RU;mso-fareast-language:EN-US; mso-bidi-language:AR-SA\"><a href=\"https://sweb.ru/servers/\"><span style=\"font-family:\"Tahoma\",\"sans-serif\";color:#36BDF7\">Power</span></a></span><span style=\"font-size:11.0pt;line-height:115%;font-family:\"Tahoma\",\"sans-serif\"; mso-fareast-font-family:Calibri;mso-fareast-theme-font:minor-latin;color:#062436; mso-ansi-language:RU;mso-fareast-language:EN-US;mso-bidi-language:AR-SA\">\".<br>Инструкция включения Memcached на различных </span><span lang=\"EN-US\" style=\"font-size:11.0pt; line-height:115%;font-family:\"Tahoma\",\"sans-serif\";mso-fareast-font-family: Calibri;mso-fareast-theme-font:minor-latin;color:#062436;mso-ansi-language: EN-US;mso-fareast-language:EN-US;mso-bidi-language:AR-SA\">CMS доступна по ссылке</span><span style=\"font-size:11.0pt;line-height:115%;font-family:\"Tahoma\",\"sans-serif\"; mso-fareast-font-family:Calibri;mso-fareast-theme-font:minor-latin;color:#062436; mso-ansi-language:RU;mso-fareast-language:EN-US;mso-bidi-language:AR-SA\">: </span><span style=\"font-size:11.0pt;line-height:115%;font-family:\"Calibri\",\"sans-serif\"; mso-ascii-theme-font:minor-latin;mso-fareast-font-family:Calibri;mso-fareast-theme-font: minor-latin;mso-hansi-theme-font:minor-latin;mso-bidi-font-family:\"Times New Roman\"; mso-bidi-theme-font:minor-bidi;mso-ansi-language:RU;mso-fareast-language:EN-US; mso-bidi-language:AR-SA\"><a href=\"https://help.sweb.ru/entry/860/\"><span style=\"font-family:\"Tahoma\",\"sans-serif\"\">https://help.sweb.ru/entry/860/</span></a></span></p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "BrainyCP: Обзор и отзывы",
          "link": "https://sweb.ru/journal/article/brainycp:-obzor-i-otzyvy/",
          "turbo:topic": "BrainyCP: Обзор и отзывы",
          "turbo:source": "https://sweb.ru/journal/article/brainycp:-obzor-i-otzyvy/",
          "turbo:content": {
            "#cdata-section": " <header><h1>BrainyCP: Обзор и отзывы</h1><figure><img src=\"https://s.sweb.ru/img/news/fa5a09df23d871e8f9d5b250be459bd2.png\"></figure><h2>Прогрессивная панель управления сервером</h2></header><p><strong>BrainyCP</strong> — предоставляемая на некоммерческой основе панель управления хостингом, устанавливается на сервер под управлением операционной системы Linux. Миссия, которую преследуют компания — разработать многофункциональное и свободно распространяемое ПО для управления сервером или хостинг-услугами.</p><p>Отлично подойдет как и среднестатистическому web-мастеру для управления VDS, так и хостинг-компании для управления виртуальным хостингом.</p> <h2>Кто разработал BrainyCP?</h2> <p>Прежде чем создать собственный продукт, команда BrainyCP произвела тестирование имеющихся на рынке панелей управления. Разработчики заметили, что бесплатные панели имели базовый набор функций или сильно ограниченный функционал, в то время как платные панели зачастую стоили дороже арендованного сервера, в результате чего компания разработала новое решение, минуя недостатки остальных панелей.</p> <p>Как утверждают в компании, их панель управления выигрывает в сравнении с бесплатными панелями по своей функциональности и составит конкуренцию платным панелям.</p> <p>В 2015 году компания из России, состоящая из 6 человек взялась за разработку продукта и только в конце зимы 2017 появилась первая версия.</p> <h2>Преимущества и возможности BrainyCP</h2> <ul> <li>Панель предоставляется в пользование бесплатно;</li> <li>Возможность выбора веб-сервера от APACHE и NGINX до их связки;</li> <li>Панель поддерживает PHP 5.2-7.1 а также предоставляет возможность управления дополнительными модулями;</li> <li>Используемый FTP-сервер – PureFTPD или ProFTPD. Также доступен встроенный менеджер управлениям файлами российской компании elFinder;</li> <li>Разграничивайте доступ установкой различных параметров и ограничений для хост аккаунтов;</li> <li>Для управления DNS используется DNS-сервер BIND;</li> <li>Возможность удаленного и стандартного бекапирования по расписанию;</li> <li>Доступен встроенный мониторинг с возможностью информирования на почту и автоматической перезагрузкой для слежения за состоянием сервисов;</li> <li>Вы можете настроить дизайн и вид панели для своего удобства.</li> <li>Управление БД происходит на Mysql 5.5, 5.6, MariaDB 10.01, доступен PhpMyAdmin;</li> <li>Организация работы почты состоит из связки Exim + Dovecot + имеется веб интерфейс для работы с почтой;</li> <li>Для организации безопасность установлен Антивирус компании CLAMAV;</li> <li>Вы можете установить как свой сертификат, так и установить в автоматическом режиме бесплатный сертификат от Let's Encrypt;</li> <li>В наличии поддержка IPV6, CSF Firewall.</li> </ul> <h2>Пробная версия BrainyCP</h2> <p>Протестируйте панель, демо-версия доступна на сайте компании: <a rel=\"noindex nofollow\" href=\"https://brainycp.com/demo\">https://brainycp.com/demo</a></p> <p>К сожалению, возможности в режиме демо сильно ограничены.</p> <p>Если хотите протестировать, то вы можете сделать это на <a href=\"/vds\" title=\"\" target=\"\">VDS серверах SpaceWeb</a></p> <h2>Установка BrainyCP</h2> <p>Доступна расширенная установка, что позволяет выполнить загрузку только необходимых пакетов, после чего автоматически сформируется команда для установки BrainyCP на сервер.</p> <p><img alt=\"Установка BrainyCP\" src=\"https://s.sweb.ru/img/news/1d0bbb807859b5f65cbf56be45568d82.png\"></p> <p>Главная страница панели управления обладает интуитивно понятным интерфейсом, продумана каждая мелочь, от значков до порядка разделов. Вверху панели строка индикаторов состояния сервера, что включено, а что выключено.</p> <p><img alt=\"Главная страница панели управления\" src=\"https://s.sweb.ru/img/news/9bf772e7b14a65df7d0e1883eed58ae0.png\"></p> <h3>Менеджер приложений в BrainyCP</h3> <p>В этом разделе можно поставить полезные приложения, например Программное обеспечение, отвечающее за кэширование – Memcached или инструмент для работы с изображениями ImageMagick.</p> <p>Включать/выключать приложения можно с помощью графического интерфейса.</p> <p><img alt=\"Менеджер приложений в BrainyCP\" src=\"https://s.sweb.ru/img/news/89c2f6c4ac2d6a018a067f833fec93e2.png\"></p> <h3>Автоматическая установка CMS</h3> <p>Здесь возможно автоматически установить одну из самых популярных CMS последней версии.</p> <p>Список всех CMS представлен на скриншоте.</p> <p><img alt=\"Автоматическая установка CMS\" src=\"https://s.sweb.ru/img/news/c4b10c0f4378d10870e325e93fbe5b4c.png\"></p> <h3>Встроенный менеджер управления файлами</h3> <p>Базовый функционал: создать файл, загрузить файл, посмотреть файл, распаковать и другое.</p> <p><img alt=\"Встроенный менеджер управления файлами\" src=\"https://s.sweb.ru/img/news/da99ff79b15accff60507eacb4ce9a24.png\"></p> <h3>SSH-сервер</h3> <p>Без лишних слов, возможности представлены на скриншоте.</p> <p><img alt=\"SSH-сервер\" src=\"https://s.sweb.ru/img/news/aa7f60bdcb3ef04637ccf096bf55fa00.png\"></p> <h3>Cron</h3> <p>Если вам нужно выполнение скрипта по расписанию, то с помощью Cron вы можете прописать нужную команду и время ее выполнения.</p> <p><img alt=\"Cron\" src=\"https://s.sweb.ru/img/news/50683d19e7e4fc7a0b226cb48d63d6a2.png\"></p> <h3>FTP-сервер</h3> <p>Установка и управление FTP-сервером доступно в 2 вариантах:</p> <ol> <li>В веб-интерфейсе для новичка.</li> <p><img alt=\"FTP-сервер в BrainyCP\" src=\"https://s.sweb.ru/img/news/3f560965e2daf5d60ecad7c79048f71a.png\"></p> <li>В командной строке в режиме эксперта</li> </ol> <p><img alt=\"FTP-сервер в BrainyCP\" src=\"https://s.sweb.ru/img/news/1e4568ae69d0860099bccaefa173f9a2.png\"></p> <h2>BrainyCP отзывы</h2> <p>На сегодня BrainyCP предоставляется бесплатно, тем не менее его монетизация неизбежна. Однако, полнофункциональная версия панели будет предоставляться бесплатно для тех, кто управляет только 1 сервером. Для тех, кто администрирует более одной компании, нужно будет покупать расширенную, платную версию. Панель зарекомендовала себя как отличное решение для управления севером на linux, предоставляемая полностью бесплатно и обладающая приятным дизайном с огромным набором функций. Если вы устали от ISP manager или VestaCP, протестируйте BrainyCP.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "10 инструментов сжатия изображений",
          "link": "https://sweb.ru/journal/article/10-instrumentov-szhatiya-izobrazheniy/",
          "turbo:topic": "10 инструментов сжатия изображений",
          "turbo:source": "https://sweb.ru/journal/article/10-instrumentov-szhatiya-izobrazheniy/",
          "turbo:content": {
            "#cdata-section": " <header><h1>10 инструментов сжатия изображений</h1><figure><img src=\"https://s.sweb.ru/img/news/2c969bc1b14e985a63ed8f78b8950231.png\"></figure><h2>Сократи время загрузки страниц сайта, используя сжатые изображения!</h2></header><p>Нет ничего печальнее, чем хороший, полезный, удобный сайт, который медленно загружается. Google это очень хорошо знает, поэтому скорость загрузки страницы является одним из факторов, влияющих на положение сайта в результатах поиска.</p> <p>Часто медленная загрузка страницы вызвана большим количеством изображений или большим их размером. Если с первой причиной не так легко разобраться (не с самим содержанием!), то со второй гораздо проще. Инструменты для сжатия изображений помогают в этом.</p> <h2>Инструменты сжатия изображений</h2> <p>В этой статье мы выбрали 10 инструментов сжатия изображений. Основным критерием сравнения является процент экономии после сжатия изображения — насколько изменился его размер.</p> <p>Мы выбрали только инструменты, которые работают онлайн. Мы выбрали программы из известных и часто используемых. В то же время для нас было важно сравнить очень простые инструменты с инструментами для профессионалов, поэтому список выбранных систем довольно разнообразен:</p> <ol> <li>TinyPNG</li> <li>ImageRecycle</li> <li>ShortPixel</li> <li>Imagify</li> <li>Compressor.io</li> <li>ImageCompressor</li> <li>Imageresize</li> <li>Kraken</li> <li>Toolur</li> <li>CompressNow</li> </ol> <p>Некоторые из выбранных нами систем предлагают пользователям 2 типа сжатия: сжатие с потерями и сжатие без потерь.</p> <p>Сжатие с потерями означает, что при уменьшении размера изображения его качество также изменяется. Часто система стремится достичь наименьшего размера изображения при сохранении приемлемого качества.<br>Во время сжатия без потерь (Lossless), его размер оптимизируется таким образом, чтобы сохранить исходное качество изображения.</p> <h2>Описание инструментов сжатия изображений</h2> <p><br><br><img style=\"width: 230px; height: 60px;\" src=\"https://s.sweb.ru/img/news/35b16f375d2f0067beef930112d5b371.png\"></p><p><br><strong>TinyPNG </strong>— это удобный онлайн-инструмент для сжатия изображений, очень простой в использовании. Позволяет загружать до 20 файлов одновременно в бесплатной версии. Размер одного файла ограничен 5 МБ. Платная версия (25 долларов США на пользователя) позволяет загружать изображения размером до 25 МБ, причем количество файлов не ограничено. Инструмент работает быстро и удобно. Однако не позволяет сжимать файлы формата GIF.</p><p><br><img style=\"width: 250px; height: 60px;\" src=\"https://s.sweb.ru/img/news/0884334160972ae8b6c52f5a12e6185d.png\"><br></p> <p><strong>Imagerecycle</strong> — фокусируется на оптимизации размера изображений, но дает вам ряд дополнительных опций. В платной версии Imagerecycle может оптимизировать всю страницу, сжимать URL-адреса и изменять размеры изображений. Imagerecyle в дополнение к онлайн-версии существует в виде плагина Wordpress, расширения для Joomla и Magento и приложения Shopify. Бесплатная версия позволяет сжимать несколько изображений одновременно, которые весят не более 10 Мб.</p><p><br></p><p><img style=\"width: 230px; height: 80px;\" src=\"https://s.sweb.ru/img/news/349c161554c16d23d54a22f11102b8aa.jpg\"><br></p> <p><strong>ShortPixel&nbsp;</strong>— удобный инструмент для сжатия изображений. Он имеет три режима сжатия: «Lossy», «Glossy» и «Lossless». В режиме «Lossy» система пытается найти баланс между наименьшим размером и приемлемым качеством. Режим «Glossy» сжимает изображение, сохраняя при этом хорошее качество изображения, а режим «Lossless» не изменяет изображение во время сжатия, сохраняя исходное качество. Shortpixel позволяет сжимать до 50 файлов одновременно, однако бесплатная версия позволяет изменять размер не более 100 изображений в месяц. Поддерживает JPG, PNG, GIF.</p><p><br></p><p><img style=\"width: 230px; height: 60px;\" src=\"https://s.sweb.ru/img/news/a83db5b8c682d9f713987eb2dff2dcf9.jpg\"><br></p> <p><strong>Imagify </strong>имеет три режима сжатия: от максимального уменьшения размера и приемлемого качества — режим Ultra, через агрессивный режим, до режима без потерь - Normal. Есть бесплатная и платная версия. Бесплатная версия ограничивает размер загружаемых файлов до 2 МБ, а платные версии ограничивают общий ежемесячный размер сжатия файлов от 1 ГБ до 50 ГБ. Imagify также существует как плагин Wordpress.</p><p><br></p> <p><img style=\"width: 230px; height: 80px;\" src=\"https://s.sweb.ru/img/news/91ac8f3eab641f0b510a88731a57c8cc.png\"></p><p><br><b>Compressor.io</b> допускает только сжатие изображения, поддерживает форматы JPEG, PNG, GIF и SVG. Он имеет два типа сжатия: Lossy и Lossless. Компрессор позволяет сразу сравнить исходное и уменьшенное изображение. Инструмент очень прост в использовании.</p><p><br></p> <p><img style=\"width: 230px; height: 80px;\" src=\"https://s.sweb.ru/img/news/a4e8fefeaeebde02b53bdad3d7e5dfe7.jpg\"></p><p><br><b>Image Compressor</b> позволяет выполнять только изображения с потерями. В то же время вы можете сжать до 20 файлов. Инструмент не поддерживает файлы формата GIF. С помощью компрессора изображений вы можете выбрать качество изображения, которое хотите получить. Инструмент live показывает, как изменяется внешний вид изображения и какой процент его размера удается сохранить.</p> <p><img style=\"width: 230px; height: 60px;\" src=\"https://s.sweb.ru/img/news/070ff750b791056d26e01ac08ac3b8e7.png\"></p><p><br><b>Imageresizer</b> — помимо сжатия изображений, инструмент позволяет изменять их размеры. Эта система очень проста в использовании. Вы можете загрузить до 20 файлов одновременно или ввести их URL. Инструмент полностью бесплатный, однако он не поддерживает формат GIF.</p><p><br></p><p><img style=\"width: 180px; height: 40px;\" src=\"https://s.sweb.ru/img/news/d251e69867e65fcba335cbedc169d520.png\"><br></p><p><br></p> <p><strong>Kraken </strong>— это инструмент для профессионалов. С помощью Kraken вы можете делать сжатие с потерями и без потерь. Также имеется функция для экспертов, которая позволяет выбрать необходимое качество и сохранить отдельные метаданные изображения. Система существует в версии плагина Wordpress и Magento. Kraken можно использовать в бесплатной версии с некоторыми ограничениями: 100 МБ - объем для тестирования, нет возможности ввести URL-адрес изображения или загрузить всю страницу.</p><p><br></p> <p><img style=\"width: 230px; height: 60px;\" src=\"https://s.sweb.ru/img/news/c6ee2afc0da1103ab8f606a033222edf.png\"></p><p><br><b>Toolur </b>позволяет не только оптимизировать изображения, но и изменять их размеры. Это дает вам выбор сжатия с потерями и без потерь. Инструмент предлагает 5 методов сжатия с потерями (A, B, C, D, E) и 2 метода сжатия без потерь и 2 типа сжатия (нормальное и прогрессивное). К сожалению, разница между методами и типами сжатия не объясняется на странице. Несмотря на это, для сжатия с потерями пользователь может выбрать целевой уровень качества изображения. Такое большое количество опций и возможностей вызывает путаницу у начинающего пользователя. Инструмент бесплатный и позволяет сжимать 25 изображений одновременно. Toolur не поддерживает формат GIF, а изображения PNG после сжатия обрабатываются в JPG и не сохраняют прозрачность.</p><p><br></p> <p><img style=\"width: 230px; height: 60px;\" src=\"https://s.sweb.ru/img/news/3d7b7adcfa41d9bec4bf7c19dd2984b6.jpg\"></p><p><br><b>CompressNow&nbsp;</b>— инструмент очень простой и бесплатный. Позволяет выбрать уровень сжатия. На системной странице указано, что система поддерживает форматы GIF и PNG. На практике файлы этих форматов после сжатия обрабатываются в формат JPG и не сохраняют прозрачность. Интерфейс системы очень продвинут и прост в использовании.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Как защитить свой сайт от взлома?",
          "link": "https://sweb.ru/journal/article/kak-zaschitit-svoy-sayt-ot-vzloma/",
          "turbo:topic": "Как защитить свой сайт от взлома?",
          "turbo:source": "https://sweb.ru/journal/article/kak-zaschitit-svoy-sayt-ot-vzloma/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Как защитить свой сайт от взлома?</h1><figure><img src=\"https://s.sweb.ru/img/news/577bf37277a29686133d60c3f8be0c53.jpg\"></figure><h2>5 советов по усилению безопасности сайта</h2></header><p>Что только не придумывают владельцы сайтов, чтобы не заниматься вопросами их безопасности: «мой сайт не представляет ценности для хакеров», «вряд ли меня кто-нибудь захочет взломать» и все в этом духе. Мол, работает сайт, и ладно.</p> <p>Полагая, что ваш сайт не представляет для киберпреступников никакой ценности, вы сильно недооцениваете вашего незримого противника. Большинство взломов — это не банальные кража данных или поломка шаблона сайта, а попытка использовать сайт для распространения спама или создания на нем временного хранилища файлов незаконного характера. Другие, не менее распространенные случаи злоупотребления взломанными сайтами, заключаются в использовании сайтов для ботнета или для скрытого майнинга криптовалюты. И не забывайте про интернет-вымогателей. <br> </p> <p>Как правило, взлом выполняется автоматическими скриптами, написанными для эксплуатирования уязвимостей в программном обеспечении. По <a href=\"https://www.ptsecurity.com/upload/corporate/ru-ru/analytics/Cybersecurity-threatscape-2018-Q1-rus.pdf\" rel=\"nofollow\" target=\"_blank\">данным</a> компании Positive Technologies, специализирующейся на информационной безопасности,&nbsp;количество киберпреступлений в 1 квартале 2019 года выросло на 32%&nbsp;по сравнению с аналогичным периодом предыдущего года. И, исходя из прогнозов экспертов, количество кибератак будет расти. Поэтому предлагаем вам действовать превентивно и подготовить защиту заранее.</p> <p>В этой статье собраны 5 лучших советов, которые помогут вам и вашему сайту безопасно работать в интернете.</p> <h2>Регулярно обновляйте CMS сайта</h2> <div><img src=\"https://s.sweb.ru/img/news/1f26381519cdd3f462bbfa8e15632862.jpg\" alt=\"Обновление CMS сайта\" align=\"none\"> <br> </div> <p>Этот совет может показаться очевидным, однако регулярное обновление программного обеспечения имеет важное значение для обеспечения безопасности вашего сайта. Когда в программном обеспечении обнаруживается уязвимость, хакеры моментально пытаются ее эксплуатировать. Не медлите: регулярно обновляйте CMS и все ее компоненты (плагины, модули, файлы темы и др.). Однако не забывайте, некоторые обновления могут быть несовместимы друг с другом. Поэтому перед любым обновлением настоятельно рекомендуем делать резервную копию.</p> <p>Также обязательно подпишитесь на уведомления от поставщика вашего программного обеспечения, чтобы держать руку на пульсе самых последних новостей. На сегодняшний день подавляющее большинство компаний делают email-рассылки, поддерживают push-уведомления и ведут группы в социальных сетях, через которые оперативно оповещают своих подписчиков об обнаруженных уязвимостях и актуальных обновлениях. А некоторые CMS, в числе которых популярный WordPress, сообщают об обновлениях каждый раз при входе в систему.</p> <h2>Устанавливайте SSL-сертификаты</h2> <p>На сайте, который защищен SSL-сертификатом, злоумышленники не могут перехватывать личные данные посетителей: логины, пароли, данные банковских карт и другую информацию. SSL-сертификат гарантирует их защиту. Вспомним, как в свое время поисковик Google <a href=\"https://security.googleblog.com/2014/08/https-as-ranking-signal_6.html\" rel=\"nofollow\" target=\"_blank\">объявил</a>, что будет повышать в поисковой выдаче сайты, которые перешли на протокол HTTPS, что дает неоспоримое преимущество для SEO. Яндекс также не остался в стороне и упомянул о преимуществах использования SSL сертификата в своем <a href=\"https://webmaster.yandex.ru/blog/https-kak-znak-kachestva-sayta\" rel=\"nofollow\" target=\"_blank\">блоге</a>. Так что времена небезопасного протокола HTTP уходят в прошлое. <br> </p> <p>Определить сайт с SSL-сертификатом легко — если вы видите небольшой замок рядом с адресом сайта в браузере, значит сайт защищен, а вся информация передается по защищенному протоколу HTTPS. <br> <br>Компании, выпускающие SSL-сертификаты, называются удостоверяющими центрами, которые, в свою очередь, делятся на коммерческие и некоммерческие. Например, некоммерческий удостоверяющий центр Let's Encrypt выпускает полностью бесплатные и автоматизированные сертификаты, которые защищают сайты не хуже платных аналогов. Главное отличие платного сертификата от бесплатного — финансовая гарантия. В случае взлома платного сертификата удостоверяющий центр может выплатить компенсацию. Порой, это весьма солидные суммы, от $500К и выше.</p> <h2>Шифруйте пароли</h2> <div><img src=\"https://s.sweb.ru/img/news/b30b2509103a9de12539b4fd66eea6df.jpg\" alt=\"Безопасность сайта с сертификатом SSL\" align=\"none\"> <br> </div> <p>Пароли на сайте всегда должны храниться в виде зашифрованных значений, предпочтительно с использованием алгоритма хеширования (например, SHA). Использование этого алгоритма означает, что при аутентификации пользователей вы будете сверять только зашифрованные значения. В случае взлома и кражи захешированных паролей это минимизирует ущерб, поскольку расшифровка таких паролей невозможна. Единственное, что с ними можно сделать, это провести атаку с использованием словаря или угадывать каждую комбинацию скриптом, что в вычислительном плане долго и нецелесообразно. <br> </p> <p>Также крайне важно самому использовать надежные пароли и учить этому посетителей сайта, чтобы защитить их учетные записи. Внедрение таких требований к паролям, как минимальное количество символов, наличие заглавных букв и цифр поможет защитить пользовательские данные в долгосрочной перспективе. <br>В недавнем исследовании, российские эксперты по безопасности проверили 3,7 миллиарда логинов и ключей за последние 3 месяца, которые можно найти в свободном доступе и отметили, что доля надежных паролей (буквы + цифры + символы) в сети всего 3%.</p> <p><b>Как сгенерировать надежный пароль?</b> <br> </p> <ol> <li> Не менее 8 символов, желательно от 16.</li> <li>Должны быть цифры, буквы (в том числе и заглавные) и символы.&nbsp;</li> <li>Пароль должен быть бессмысленный.&nbsp; <br><b>Пример: Rk3@s*9c;H38~Bj<br></b></li> </ol> <p></p> <p>Также особое внимание следует уделить способу хранению пароля. <br>Большинство пользователей предпочитают запоминать пароль, записывать в блокнот или заметки телефона, использовать оффлайн менеджер паролей и приложение на телефон. <br> </p> <h2>Выполняйте резервное копирование сайта</h2> <div><img src=\"https://s.sweb.ru/img/news/3d5a44d49623ca215518cecea4d2402a.jpg\" alt=\"\" align=\"none\"> <br> </div> <p>Резервное копирование может спасти ваш сайт даже тогда, когда нет надежды вернуть работоспособность проекту. Часто бывает, что злоумышленник заносит «заразу» на сайт задолго до того, как вы ее заметите и в этом случае, чем старее будет ваша резервная копия, тем больше шансов на восстановление. Для бизнеса в сети наличие резервного копирования должно быть не менее важным, чем продажи. Если сайт пропадет, ваша торговля не только будет остановлено, но вам нужно будет создавать сайт с нуля, что требует инвестиций и времени.</p> <p>Таким образом, резервное копирование спасает, если:</p> <ol> <li>Произошел взлом злоумышленниками&nbsp;</li> <li>От случайного удаления файлов сайта.&nbsp;</li> <li>От падения сервера, пожара и других катастроф. </li> </ol> Рекомендуем ежедневно делать резервную копию, при это несколькими способами с обязательной, регулярной загрузкой копии на локальный компьютер или на внешнее записывающее устройство, вроде флешки или переносного жесткого диска <p></p> <h3>Как осуществлять резервное копирование?</h3> <p>Существует несколько способов: <br> </p> <ol> <li>В зависимости от CMS, используйте специальные плагины и модули по резервному копированию.</li> <li>Вручную копируйте файлы с сервера на локальный компьютер.&nbsp;</li> <li>Ежедневное копирование, предоставляемое SpaceWeb.&nbsp;</li> <li>При помощи других специальных программ и скриптов.</li> </ol> <h2>Проверяйте сайт на вирусы</h2> <p>SpaceWeb предоставляет пакет антивирусного ПО Revisium, который способен определить:</p> <ol> <li>Вирусные вставки;</li> <li>Веб-шеллы;</li> <li>Бэкдоры;</li> <li>Фишинговые страницы;</li> <li>Дорвеи;</li> <li>Cпам-скрипты; </li> </ol> <p> Антивирусное ПО работает в 2х режимах, в автоматическом и ручном, а также способно самостоятельно, с вашего разрешения, удалять вредоносный код.</p><p>Подробнее с антивирусом Revisium на SpacWeb вы можете ознакомиться здесь: <a href=\"https://help.sweb.ru/entry/38/\" title=\"Антивирусная проверка сайта на хостинге\" target=\"_blank\">https://help.sweb.ru/entry/38/</a> <br>Также предлагаем воспользоваться нашей подсказкой и защитить свой сайт от вредоносного ПО: <a href=\"https://help.sweb.ru/entry/37/\" title=\"Защита от вредоносного содержимого на сайте\" target=\"_blank\">https://help.sweb.ru/entry/37/</a></p> <p>Пожалуй, это основные способы обезопасить свой сайт. <br>Есть также отдельные способы взлома, которые применяют наиболее опытные хакеры и мы отдельно их осветим в следующих статьях. Если вы стали жертвой злоумышленников и вышеуказанные методы безопасности вам не помогают, рекомендуем обратиться к нашему сертифицированному партнеру Revisium.</p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        },
        {
          "-turbo": "true",
          "title": "Всё, что нужно знать об SSL-сертификатах",
          "link": "https://sweb.ru/journal/article/vsyo-chto-nuzhno-znat-ob-ssl-sertifikatah/",
          "turbo:topic": "Всё, что нужно знать об SSL-сертификатах",
          "turbo:source": "https://sweb.ru/journal/article/vsyo-chto-nuzhno-znat-ob-ssl-sertifikatah/",
          "turbo:content": {
            "#cdata-section": " <header><h1>Всё, что нужно знать об SSL-сертификатах</h1><figure><img src=\"https://s.sweb.ru/img/news/839d9ba4872daf31027858c35f23d908.jpg\"></figure><h2>Простым языком</h2></header><p>По сути у SSL-сертификата есть 2 функции.</p ",
            "#cdata-section6": " > <h2>Функция 1: техническая защита соединения между пользователем и сайтом</h2> <div><img src=\"https://s.sweb.ru/img/news/ccbca3865802aa044c55186dc314a7f6.jpg\" alt=\"Незащищенный сайт в браузере\" align=\"none\"> <br> </div> <p>Например, вы зашли в кафе, подключились к местному wifi, и все данные, которые вы передаёте в Интернет, доступны администратору wifi- сети кафе. Если вы заходите на сайт без SSL-сертификата, вводите на нем логин и пароль, не сомневайтесь, злоумышленник уже знает ваши реквизиты.</p> <p>Если же сайт использует SSL-сертификат, данные злоумышленник всё равно сможет получить, но воспользоваться ими - нет, так как они будут зашифрованы.</p> <p>Вывод: Если владелец ресурса не устанавливает сертификат, посетитель сайта рискует передать данные третьим лицам.</p> <p>Долгое время владельцы сайтов не обращали на это внимание. Ситуацию начала меняться с повышением компьютерной грамотности пользователей. Те, кто начали понимать описанный выше пример, перестали доверять сайтам без SSL-сертификатов. Сейчас большинство пользователей понимает, что нельзя вводить данные на сайте без SSL-сертификата.</p> <p>В результате владельцы сайтов стали устанавливать SSL-сертификаты, чтобы сохранить свою аудиторию, а также сохранить позиции сайта по ключевым запросам в поисковой выдаче Яндекса и Google.</p> <h2>Функция 2: определение ответственности за подлинность сертификата и качество защиты</h2> <img src=\"https://s.sweb.ru/img/news/0fb7ef10012804958a6f17909b0e4a76.jpg\" alt=\"Как работает SSL-сертификат\" align=\"none\"> <br> <p> Работает примерно как страховка. Только вместо страховых компаний существуют сертификационные центры. Они проводят необходимые проверки и подписывают сертификат, гарантируя тем самым его надёжность и подлинность. Если сертификат будет скомпрометирован, то есть данные пользователя утекут по вине некачественного сертификата, то сертифкационный центр выплатит пострадавшей стороне приличную компенсацию. </p>Исключения составляют бесплатные сертификаты - для них никакой компенсации не предусмотрено. Справедливости ради, стоит отметить, что “взлом” сертификата - это ситуация из ряда вон выходящая, и как правило приводит к закрытию сертификационного центра.<p></p> <h2>Тип SSL-сертификата.</h2> <p>Различают 3 типа: DV, OV, EV. Что это означает? что именно проверяет сертификационный центр перед подписью сертификата; под чем именно центр подписывается. <br><img style=\"margin-right:-2px;margin-right: -2px; width: 420px; height: 73px; margin-bottom: -30px; margin-top: 6px;\" src=\"https://s.sweb.ru/img/news/01ab757b61942e76eef09b03002d2609.png\" alt=\"DV сертификат SSL\" align=\"none\"> <br> </p> <p> <b>DV</b>- означает, что центр убедился, что лицо, которому выдан сертификат, имеет доступ к управлению доменом, на котором этот сертификат стоит. Собственно это всё. Кто этот владелец и что у него на уме, центр не знает :) Такой сертификат обычно самый дешевый или вовсе бесплатный. <br><img style=\"margin-right: -2px; width: 420px; height: 73px; margin-bottom: -30px; margin-top: 6px;\" src=\"https://s.sweb.ru/img/news/199c9ca80826a94f73a843be33640d18.png\" alt=\"OV сертификат SSL\" align=\"none\"> <br> </p> <p><b>OV</b>- означает, что центр проверил документы организации, которая владеет сайтом, и подтверждает это. В описании такого сертификата всегда можно найти наименование этой организации.&nbsp;</p><img style=\"margin-right: -2px; width: 420px; height: 73px; margin-bottom: -8px; margin-top: 6px;\" src=\"https://s.sweb.ru/img/news/a78a838144a2eb430cf023d5cc89249c.png\" alt=\"EV сертификат SSL\" align=\"none\">&nbsp;&nbsp; <p><b>EV</b>- сертификат с расширенной проверкой. Для его получения компания, которая владеет сайтом, должна пройти целый ряд проверок, в том числе ответить на звонки и письма сертификационного центра и предоставить все документы, которые центр посчитает нужным запросить. Такой сертификат отображается в адресной строке браузера зелёным цветом и сразу выводит наименование организации. Сегодня EV-сертификат - это обязательный атрибут всех финансовых организаций, банков, платёжных систем и просто крупных компаний, которые хотят, чтобы об этом знали их пользователи. </p> <br> <p>Также сертификаты могут различаться по количеству доменов, которые они защищают.</p> <p> <b>1d</b> - защищает 1 домен; <br><b>1d+www</b> - защищает домен и www.домен; <br><b>wildcard</b> - защищает домен и все его поддомены. </p> <p> Поисковые системы Google и Яндекс считают наличие SSL сертификата атрибутом качества сайта. <br>Об этом мы подробно рассказали в статье <a href=\"https://sweb.ru/journal/article/kak-zaschitit-svoy-sayt-ot-vzloma/\">Как защитить сайт от взлома?</a> </p> <p> <br>На этом всё! Ставьте SSL-сертификаты, если вы владелец сайтов, и посещайте только защищённые сайты, если вы пользователь интернета! </p><div data-block=\"share\" data-network=\"telegram, facebook, vkontakte, odnoklassniki, twitter\"></div> "
          }
        }
      ]
    }
  }
}